{"id":"javaland2021","name":"JavaLand 2021","url":"http://javaland.dukecon.org/2021","homeUrl":"http://www.javaland.eu","metaData":{"id":"javaland2021","audiences":[{"id":"1","order":1,"names":{"de":"Anfänger","en":"Beginners"},"icon":"audience_1.png"},{"id":"2","order":2,"names":{"de":"Experten","en":"experts"},"icon":"audience_2.png"},{"id":"3","order":3,"names":{"de":"Fortgeschrittene","en":"Advanced"},"icon":"audience_3.png"}],"eventTypes":[{"id":"1","order":1,"names":{"de":"Best Practices","en":"best practices"},"icon":"eventType_1.png"},{"id":"2","order":2,"names":{"de":"Neuerscheinung oder Feature","en":"new release or feature"},"icon":"eventType_2.png"},{"id":"3","order":3,"names":{"de":"Newcomer","en":"Newcomer"},"icon":"eventType_3.png"},{"id":"4","order":4,"names":{"de":"Projektbericht","en":"project report"},"icon":"eventType_4.png"},{"id":"5","order":5,"names":{"de":"Tipps & Tricks","en":"tips & tricks"},"icon":"eventType_5.png"}],"languages":[{"id":"1","code":"de","order":1,"names":{"de":"Deutsch","en":"German"},"icon":"language_de.png"},{"id":"2","code":"en","order":2,"names":{"de":"Englisch","en":"English"},"icon":"language_en.png"}],"defaultLanguage":{"id":"1","code":"de","order":1,"names":{"de":"Deutsch","en":"German"},"icon":"language_de.png"},"tracks":[{"id":"1","order":1,"names":{"de":"Core Java & JVM Technologien","en":"Core Java & JVM Technologies"},"icon":"track_1.png"},{"id":"2","order":2,"names":{"de":"JVM Sprachen","en":"JVM Languages"},"icon":"track_2.png"},{"id":"3","order":3,"names":{"de":"Methodology & Culture","en":"Methodology & Culture"},"icon":"track_3.png"},{"id":"4","order":4,"names":{"de":"Architektur","en":"Architecture"},"icon":"track_4.png"},{"id":"5","order":5,"names":{"de":"Security","en":"Security"},"icon":"track_5.png"},{"id":"6","order":6,"names":{"de":"Qualität & Testen","en":"Quality & Testing"},"icon":"track_6.png"},{"id":"7","order":7,"names":{"de":"Enterprise","en":"Enterprise"},"icon":"track_7.png"},{"id":"8","order":8,"names":{"de":"Microservices","en":"Microservices"},"icon":"track_8.png"},{"id":"9","order":9,"names":{"de":"Container, Cloud & Infrastruktur","en":"Container, Cloud & Infrastructure"},"icon":"track_9.png"},{"id":"10","order":10,"names":{"de":"Werkzeuge","en":"Tools"},"icon":"track_10.png"},{"id":"11","order":11,"names":{"de":"Data & Streaming","en":"Data & Streaming"},"icon":"track_11.png"},{"id":"12","order":12,"names":{"de":"Innovation","en":"Innovation"},"icon":"track_12.png"},{"id":"13","order":13,"names":{"de":"Frontend, Mobile & UX","en":"Frontend, Mobile & UX"},"icon":"track_13.png"},{"id":"14","order":14,"names":{"de":"Community Aktivität","en":"Community Activity"},"icon":"track_14.png"}],"locations":[{"id":"1","order":1,"names":{"de":"Silverado","en":"Silverado"},"icon":"location_1.png","capacity":0},{"id":"2","order":10,"names":{"de":"Café HILow","en":"Café HILow"},"icon":"location_10.png","capacity":100},{"id":"3","order":11,"names":{"de":"Unter den Linden","en":"Unter den Linden"},"icon":"location_11.png","capacity":100},{"id":"4","order":12,"names":{"de":"JUG Café","en":"JUG Café"},"icon":"location_12.png","capacity":0},{"id":"5","order":13,"names":{"de":"Grüne Wiese","en":"Grüne Wiese"},"icon":"location_13.png","capacity":0},{"id":"6","order":14,"names":{"de":"Hands-on Arena","en":"Hands-on Arena"},"icon":"location_14.png","capacity":0},{"id":"7","order":2,"names":{"de":"Quantum 1","en":"Quantum 1"},"icon":"location_2.png","capacity":0},{"id":"8","order":3,"names":{"de":"Quantum 2","en":"Quantum 2"},"icon":"location_3.png","capacity":0},{"id":"9","order":4,"names":{"de":"Quantum 3","en":"Quantum 3"},"icon":"location_4.png","capacity":0},{"id":"10","order":5,"names":{"de":"Quantum 4","en":"Quantum 4"},"icon":"location_5.png","capacity":0},{"id":"11","order":6,"names":{"de":"Wintergarten","en":"Wintergarten"},"icon":"location_6.png","capacity":0},{"id":"12","order":7,"names":{"de":"Schauspielhaus","en":"Schauspielhaus"},"icon":"location_7.png","capacity":0},{"id":"13","order":8,"names":{"de":"STOCK's","en":"STOCK's"},"icon":"location_8.png","capacity":0},{"id":"14","order":9,"names":{"de":"Rotunde [SPONSORED SESSIONS]","en":"Rotunde [SPONSORED SESSIONS]"},"icon":"location_9.png","capacity":0}],"defaultIcon":"Unknown.png"},"events":[{"id":"607386","start":"2021-03-17T11:00:00","end":"2021-03-17T17:00:00","title":"Community Aktivität: JUG Café - Meet the JUGs","abstractText":"Auch in diesem Jahr soll das JUG Café ein zentraler Treffpunkt im Javaland sein. Natürlich gibt es wieder Möglichkeiten mit Vertretern diverser Java User Groups in Kontakt zu treten und wir bieten euch wie gewohnt den gemütlichen Rückzugsraum für ein ruhiges Gespräch oder eine kurze Pause vom Konferenzgetümmel. Nur für eure Kaffeespezialitäten müsst ihr ausnahmsweise selber sorgen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":0,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"4","speakerIds":["353141","359611"],"languageId":"1"},{"id":"607461","start":"2021-03-17T11:00:00","end":"2021-03-17T15:00:00","title":"Community Aktivität: Hackergarten","abstractText":"Der Hackergarten ist der ideale Ort, um neue Leute zu treffen, Spaß zu haben und das Leben von Entwicklern auf der ganzen Welt \"Patch für Patch\" zu verbessern. Schreibt ein Plugin, eine Dokumentation, fügt neue Features hinzu oder behebt Fehler in Open-Source-Projekten... all dies gemeinsam mit Experten, die bereit sind, ihr Wissen zu teilen. Hier gibt es keine Präsentationen, der Hackergarten ist ein Zusammenschluss von engagierten Entwicklern, die gemeinsam programmieren wollen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":10,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"audienceId":"1","locationId":"6","speakerIds":["365313"],"languageId":"1"},{"id":"606472","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"Per Anhalter durch die Entwickler-Galaxis","abstractText":"Als Software-Entwickler haben wir eigentlich ein klares Ziel vor Augen: Mit Hilfe von Technik ein Problem anzugehen und zur idealen Lösung zu gelangen.\n\nDieses Ziel zu erreichen, und dabei nicht nur heil anzukommen sondern die Reise auch zu genießen, ist in der Realität aber oft deutlich schwieriger, als wir uns das vorstellen. Der Weg zum erfolgreichen Softwareprodukt oder zur idealen Systemlandschaft ist kein linearer Pfad von A nach B sondern voll von Umleitungen, Sackgassen und Überraschungen.\n\nEine der größten Herausforderungen hierbei sind unsere \"Mitreisenden\". Es könnte alles so einfach sein, wären da nicht alle diejenigen, die uns vom Pfad abbringen wollen, Steine in den Weg legen und heimlich die Wegweiser umdrehen.\n\nWie schön wäre es einen Begleiter dabei zu haben, der uns all diese kleinen Hindernisse erläutern könnte und Tipps und Tricks parat hat, wie wir unser Ziel einfacher, schneller und vor allem stressfreier erreichen.\n\nDieser Vortrag soll ein solcher Reiseführer sein. Wir werden unsere Mitreisenden näher beleuchten und zunächst die Fragen beantworten: Wer sind sie? Was sind ihre Ziele und Motivationen? Nur wenn wir wissen, mit wem wir es tagtäglich zu tun haben können wir besser aufeinander eingehen und eine echte Reisegemeinschaft bilden.\n\nAnschließend werfen wir einen Blick auf uns selbst: Was brauchen wir auf der Reise die diversen Hindernisse zu meistern und dennoch entspannt am Ziel anzukommen?\n\nPacken wir also das Handtuch ein und machen uns auf den Weg - es gibt viel zu entdecken!","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":35,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"5","locationId":"13","speakerIds":["386357"],"languageId":"1"},{"id":"606663","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Cryptography 101 for Java developers","abstractText":"So you’re logging in to your favorite crypto currency exchange over https using a username and password, executing some transactions, and you’re not at all surprised that, security wise, everything’s hunky dory…\nThe amount of cryptography to make all this happen is staggering. In order to appreciate and understand what goes on under the hood, as a developer, it’s really important to dive into the key concepts of cryptography.\n\nIn this session, we discover what cryptography actually is, and will use the JCA (Java Cryptography API) en JCE (Java Cryptography Extensions) in the JDK to explain and demo key concepts such as:\n– Message digests (hashing)\n– Encryption, both symmetric and asymmetric\n– Digital signatures, both symmetric and asymmetric\nFurthermore, we’ll show how these concepts find their way into a variety of practical applications such as:\n– https and certificates\n– salted password checking\n– block chain technology\n\nAfter this session, you’ll have a better understanding of basic cryptography, its applications, and how to use the cryptography APIs in Java.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":47,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"5","audienceId":"1","typeId":"1","locationId":"8","speakerIds":["386229"],"languageId":"2"},{"id":"606359","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"Pragmatische Builds mit Apache Maven","abstractText":"Apache Maven ist ein weit verbreitetes Build- und Dependency-Management-Tool. In vielen Projekten kommt Maven zum Einsatz und macht irgendwas ... Aber was passiert tatsächlich hinter den Kulissen? Brauchen wir alle Plugins und Dependencies wirklich? Kann unser Build viel schneller laufen? Was und warum steht das alles in der pom.xml? Magic? Warum läuft das Build auf meinem System nicht?\n\nIm Vortrag wird die grundlegende Funktionsweise von Maven erklärt und anhand eines durchgängigen Live-Coding-Beispiels vertieft. Mit Beispielen aus der Projekt Praxis werden Best Practices im Umgang mit Maven vorgestellt. Am Ende haben wir eine pragmatische pom.xml erarbeitet, die alle Learnings aus dieser Session enthält.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":54,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"10","audienceId":"1","typeId":"5","locationId":"10","speakerIds":["361841"],"languageId":"1"},{"id":"606619","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"Softwarearchitektur 2.0","abstractText":"Themen wie Cloud, DevOps, Kubernetes, Serverless & Co werden für viele zum Alltag. Die Fülle der Begriffe und neuen Technologien bringt Architekten und Entwickler aber regelmäßig ins Schwitzen, wenn es um eine fundierte Auswahl geht. Warum müssen wir uns überhaupt mit diesen Themen beschäftigen?\n\nDie künftige Vision vieler Unternehmen ist die flexible Verarbeitung einer Flut von Daten sowie anschließend die gewinnbringende Nutzung der daraus extrahierten Informationen in allen Teilen des Unternehmens. Die Datenmengen wachsen stetig, daher ist Skalierbarkeit mittlerweile eine wichtige Anforderung. Eine Cloud Native Anwendung kann sich automatisch an sich ständig ändernde Lastanforderungen anpassen. Dafür ist aber eine hochintegrierte Zusammenarbeit zwischen Business, Entwicklung und Betrieb notwendig, um möglichst schnell auf ein sich änderndes Marktumfeld reagieren zu können.\n\nLassen Sie sich überraschen, wie einfach Entscheidungen allein auf Basis bewährter Prinzipien der Softwarearchitektur getroffen werden können. Von einigen sollten wir dabei getrost Abschied nehmen, Wiederverwendung und Technologieunabhängigkeit haben schon früher mehr Probleme gemacht, als Nutzen gebracht. Aus organisatorischen Gründen hat zudem die Redundanzfreiheit eine niedrigere Priorität bekommen. Die Session zeigt, auf welche Prinzipien und sogar Gesetze wir trotz der steigenden Komplexität heutiger Softwaresysteme zurückgreifen können.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":80,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"3","typeId":"1","locationId":"13","speakerIds":["364571"],"languageId":"1"},{"id":"606917","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Newcomer: Scrum im HomeOffice","abstractText":"Während des Lockdowns durch Covid-19 und die neuen Hygieneregelungen mussten viele Entwicklungsteams auf komplette Fernarbeit und HomeOffice umstellen. Die Scrum-Meetings, die ja sonst durch den persönlichen Austausch und die direkte Interaktion zwischen den Teammitgliedern geprägt war, mussten somit ebenfalls sehr plötzlich virtualisiert werden. Als Scrum Master habe ich mich in dieser Zeit sehr stark mit nützlichen Tools und Abläufen, die den Zweck der Scrum-Zeremonien auch im remote Setup bestens unterstützen, auseinander gesetzt und würde gerne meine Erkenntnisse mit den Teilnehmern der Javaland Konferenz teilen.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":49,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"3","locationId":"9","speakerIds":["389618"],"languageId":"1"},{"id":"606363","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"Taming dependencies conflicts for 70 Java libraries","abstractText":"Many Java developers follow documentation to include libraries, and when they run the application for the very first time, they still get really hard to troubleshoot ClassNotFoundError or NoSuchMethodError exceptions. These are symptoms of a dependency conflict that should be totally avoided if library developers follow best practices. At Google Cloud, we have 70+ Java client libraries, each with 20+ direct dependencies, and many more transitive dependencies! Keeping all the libraries dependencies in sync and up to date is a big challenge. Join this talk, to learn about how we manage 70 client libraries in a multi-repo setting, and also aligning dependency versions with best practices, and other techniques to eliminate dependency conflicts for our users.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":36,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"1","locationId":"10","speakerIds":["389253"],"languageId":"2"},{"id":"606512","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Wildwuchs eindämmen mit ArchUnit","abstractText":"Das Entwicklungsteam hat sich auf Namenskonventionen für Klassen und Pakete geeinigt. Und letztens fiel beim Code-Review wieder die eine Klasse auf, die öfter falsch benutzt wird und damit zu Fehlern führt. Solange dies nur auf einer Wiki-Seite steht, sind automatische Prüfungen nicht möglich. Werkzeuge, die aus diesen Regeln Dashboards erzeugen, sind auf den ersten Blick schön anzuschauen, geraten jedoch bald in Vergessenheit.\n\nDie Bibliothek ArchUnit erlaubt es dem Entwicklungsteam, Regeln als Java-Code zu schreiben und sie wie andere Uni-Tests auszuführen. Entwickler können sie jederzeit lokal vor dem Commit ausführen. Der Continuous-Integration-Server führt sie zusammen mit den anderen Unit-Tests aus. Schlagen die Tests fehl, so weist eine verständliche Meldung auf das Problem hin.\n\nDieser Vortrag zeigt, wie Architektur- und Best-Practice-Regeln als ArchUnit-Tests geschrieben werden. Er vergleicht ArchUnit mit anderen Werkzeugen und zeigt Vor- und Nachteile auf.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":71,"keywords":{"de":[],"en":[]},"documents":{"slides":"https://www.doag.org/formes/pubfiles/12925561/2021-nn-alexander_schwartz-wildwuchs_eindaemmen_mit_archunit-praesentation.pdf","manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"1","locationId":"11","speakerIds":["368442"],"languageId":"1"},{"id":"606966","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"Not Dead yet – Java on Desktop","abstractText":"Interestingly a lot of people say Java on desktop is dead and yes it is not in the hyped zone anymore. But on the other hand it is still widely used. This session will try to give an overview on Java on desktop and why it is not dead yet. I will give examples for scenarios where Java on desktop really shines and others where you better choose a web application. It will also show the state of JavaFX with all it's different flavours like standard JavaFX on desktop, on embedded, on mobile using Gluon and on the web using JPro. And of course there will be demos for those different scenarios.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":37,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"13","audienceId":"1","typeId":"1","locationId":"12","speakerIds":["386382"],"languageId":"2"},{"id":"606384","start":"2021-03-17T15:00:00","end":"2021-03-17T15:40:00","title":"Deepfakes 2.0 - Wie neuronale Netze unsere Welt verändern","abstractText":"Stellen Sie sich das mal vor: Sie stehen vor einem Spiegel, sehen aber nicht mehr in Ihr eigenes Gesicht, sondern in das von Barack Obama oder Angela Merkel. In Echtzeit wird Ihre eigene Mimik auf das fremde Gesicht übertragen.\n\nDem TNG Innovation-Hacking-Team ist es gelungen, einen solchen Prototypen zu erstellen und in Echtzeit das Gesicht einer Person auf beliebige andere Gesichter zu übertragen. Die Grundlage hierfür ist der sogenannte \"Deep Fake\"-Ansatz. Durch die Anwendung neuronaler Netze werden hier Gesichter in der Videoeingabe erkannt, übersetzt und zurück in die Videoausgabe integriert. Durch diese Technik ist es möglich, täuschend echte Imitationen auf andere Personen zu projizieren. Zum Einsatz kamen dabei in Keras trainierte Autoencoder-Netze, sowie verschiedene Algorithmen zur Gesichtserkennung.\n\nIn diesem Vortrag geben Thomas Endres und Martin Förtsch eine unterhaltsame und sehr anschauliche Einführung in die Welt der Deepfakes in Echtzeit. Dabei gehen sie insbesondere auf die Techniken im Bereich des Deep Learning ein, die bei dieser Anwendung zum Einsatz kommen. Mehrere Live-Demonstrationen runden das Erlebnis ab.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":46,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"1","typeId":"4","locationId":"12","speakerIds":["371592","365280","386821"],"languageId":"1"},{"id":"606548","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Mobile Java Web Applications with MVC and OpenDDR","abstractText":"We experience a growing number of mobile phones, tablets, phablets, foldables, smart TV, watches or home assistants and similar devices flooding the market almost every day. If you want to create a responsive web application with the best user experience you need dynamic adaptive content according to all relevant aspects of your device. That’s the reason for Device Description Repositories (DDR).\n\nThis session provides an overview of the W3C DDR standard for Mobile Device recognition and the OpenDDR project. Followed by a live demo of extensions to Spring MVC, the Jakarta MVC standard for Java leveraging the power of OpenDDR to simplify the development of cross device web applications. Offering automatic device detection based on OpenDDR, configuration of user preferences, automatically switch the path to the most appropriate view for a particular device or device type. As well as device aware templates, view engines and more.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":9,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"13","audienceId":"1","typeId":"4","locationId":"10","speakerIds":["364760","364707"],"languageId":"2"},{"id":"606647","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Lessons Learned Building a Connector Using Kafka Connect","abstractText":"While many companies are embracing Apache Kafka as their core event streaming platform they may still have events they want to unlock in other systems. Kafka Connect provides a common API for developers to do just that and the number of open-source connectors available is growing rapidly. In this session I will introduce Kafka Connect and share my top tips for building a Kafka Connect connector. I’ll explain how Kafka Connect works, how a connector is structured and some of the things to consider when providing configuration options. This session will be useful to those that are keen to write their own connectors, but also for those that are looking to understand what makes an effective Kafka connector.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":19,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"11","audienceId":"3","typeId":"5","locationId":"10","speakerIds":["378841"],"languageId":"2"},{"id":"606687","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"Evolving APIs","abstractText":"\"Don’t break the Client\" ist der oberste Grundsatz, wenn man ein Public API zur Verfügung stellt. Und auch innerhalb meiner (Micro-)Service-Landschaft gilt: Nur wenn mein API abwärtskompatibel ist, kann ich meinen Service unabhängig deployen. Aber wie kann ich abwärtskompatible APIs realisieren, ohne auf Dauer im hohem Wartungsaufwand für das Aufrechterhalten alter Schnittstellen(-Versionen) zu ersticken? Welche Versionierungsstrategie sollte ich in welcher Situation fahren und wie implementiere ich die verschiedenen Strategien geschickt? In der Praxis erweist sich das Management von APIs und deren Versionen als gar nicht so einfach. Diese Session zeigt mögliche Wege und Alternativen, um der Versionierungshölle zu entkommen.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":84,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"1","typeId":"1","locationId":"7","speakerIds":["382456"],"languageId":"1"},{"id":"606785","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"Newcomer: DevOps – mehr Geschwindigkeit auf der Schiene","abstractText":"Nach gut 2 Jahren als Architekturschaffender in einem \"You build it, you run it\"-DevOps-Team bei der Deutschen Bahn ziehe ich ein Zwischenfazit. Das Ziel am Anfang des Projekts lautete: Eine Cloud-native Plattform für API-getriebene Softwareentwicklung aufzubauen, deren Nutzer andere Java-/JavaScript-Softwareentwickler im Konzern sind. Die im Unternehmen gerade angefangene DevOps-Transformation soll durch unsere Plattform unterstützt werden, um die Geschwindigkeit, in der neue Features den Kunden erreichen, massiv zu erhöhen.\n\nDie Reise beginnt im Reich der Tools und Automatisierung. In diesem Vortrag erfahren Sie, warum sich der erste Ansatz einer zentralen CI/CD-Installation für alle Teams als problematisch erwies und durch dezentrale Pipelines ersetzt wurde. Danach lernen Sie die Tücken unserer Einführung einer eingekauften API-Management-Lösung kennen, und wieso sich der Kauf von großer On-Premise-Software nur schwer mit den agilen Prinzipien vereinbaren lässt. Der Zuhörer lernt zudem, wie wir im Team mit polyglotter Softwareentwicklung zu kämpfen haben und wie wir permanent gegen Wissensinseln ankämpfen. Zuletzt gehe ich darauf ein, wie wir mit umfassender Architekturdokumentation gestartet und gescheitert sind. Unser neuer Ansatz ist eine leichtgewichtige dezentrale Dokumentation mit AsciiDoc und ein im Team abgestimmter Toolstack, der auch vom Zuhörer adaptiert werden kann. \n\nAm Ende der Reise wird der Zuhörer einige Methoden und Tools kennen gelernt haben, um in einem Kontext zu überleben, der an vielen Stellen noch von klassischen Prozessen dominiert wird. Aber eines ist klar: Der Weg Richtung DevOps geht nicht plötzlich, es ist eine Reise mit Umwegen und Hindernissen. Die Reise ist es aber auf jeden Fall Wert!","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":26,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"3","locationId":"9","speakerIds":["386503"],"languageId":"1"},{"id":"607472","start":"2021-03-17T16:30:00","end":"2021-03-17T17:00:00","title":"Community Aktivität: Setup Mob-Programming Dojo","abstractText":"Wir bereiten unser System gemeinsam auf den Workshop vor. Für vorbereitete und fertig eingerichtete Teilnehmer beginnt die Veranstaltung um 17 Uhr. Ab 16:30 Uhr sind alle willkommen um sich gemeinsam vorzubereiten. \n\nIhr benötigt für die Teilnahme: \n- Stabile Internetverbindung \n- Kamera und Mikro/Lautsprecher/Headset (hohe Qualität bevorzugt, ggf. durch Feedback bestätigt, ohne Hall und Störgeräusche) \n- git (ca. version 2.25) ausführbar auf der Kommandozeile \n- mob.sh tool installiert und auf der Kommandozeile ausführbar (https://mob.sh/) \n- Java Version min. 11 \n- github-account und folgendes git-repo zum testen ausgecheckt: https://github.com/thmuch/javaland-2021-mob-programming-setup-check\n- In github eingelogged sein und Zugriff auf die Emails des Account erforderlich für Kollaboration \n- IDE deiner Wahl mit dem git-repo eingebunden und lauffähig (Main, Tests, siehe README im Repo) \n- Webbrowser (Empfehlung: chromium basiert) \n- Für die eigentliche Mob-Programming-Session: Zoom-Client in der neusten Version (&gt; version 5.5.x). \n- Bei der Teilnahme über den Browser macht das Teilen des eigenen Bildschirms manchmal Probleme; Für den verwendeten Zoom-Account ist eine DSGVO Zusatznote Vertragsbestandteil.\n- Optional: 2. Bildschirm oder 2. Gerät (Tablet o.ä.) für Miro-Board, Timer, etc.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":5,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"audienceId":"1","locationId":"2","speakerIds":["370142","368551"],"languageId":"1"},{"id":"606420","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"Good practices for secure Kubernetes AppOps","abstractText":"Viele Entwickler deployen ihre Apps auf Kubernetes (K8s) Clusters die von anderen betrieben werden,\nwie Amazon, Google, Microsoft oder „dem Betrieb“. Das bedeutet, dass auch andere für die Cluster-Security\nverantwortlich sind, richtig? Nein, so einfach ist es nicht! In K8s gibt es vielfältige Security-Optionen:\nRBAC, securityContexts, Network Policies, PodSecurityPolicies, etc. Doch welches sind die\nRelevanten für Entwickler? In diesem Talk werde ich meine persönliche K8s Security Good Practice\nvorstellen, die sich in den letzten Jahren als DevOps mit K8s-Clusters destilliert hat. Dabei wird\npraktisch gezeigt, wie mit überschaubarem Aufwand in der täglichen Arbeit die\nAnwendungssicherheit erhöht werden kann und welche typischen Angrissvektoren bestehen.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":27,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"3","typeId":"1","locationId":"8","speakerIds":["382436"],"languageId":"1"},{"id":"606480","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"Spring Data JDBC Beyond the Obvious.","abstractText":"Das, durch Domain Driven Design inspirierte, ORM Spring Data JDBC limitiert ganz gezielt die Art und Weise wie Objekte modeliert werden können. Dies hat den Zweck Spring Data JDBC konzeptionell einfach zu halten. Wie man dennoch das erreicht was man möchte, auch wenn es nicht dem Standardbeispielen entspricht, zeige ich in diesem Vortrag.\n\nNach einer kurzen Einführung in die Grundlagen von Spring Data JDBC und Vorstellung der neusten Features werden wir uns Themen wie die folgenden anschauen:\n\nBidirektionale Beziehungen.\nID Generierung.\nKontextabhängige Abfragestrategien\nFine tunen von mappings.\n\nDas Ziel ist, das dieser Vortrag sowohl für Einsteiger geeignet ist, aber auch für erfahrene Spring Data JDBC Nutzer interessant ist, da er ein tieferes Verständnis davon vermittelt, wie Spring Data JDBC funktioniert und wie es genutzt werden kann.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":47,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"10","audienceId":"3","typeId":"5","locationId":"7","speakerIds":["354836"],"languageId":"1"},{"id":"606789","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Full-Stack Clojure: Perfekt für wendige Startups","abstractText":"Bei der Entwicklung eines Produkts stellt sich am Anfang immer die Frage: Mit welcher Sprache entwickelt man?\nWir haben mit unserem Startup Clojure gewählt und konnten so mit zwei erfahrenen Clojure-Entwicklern und einem Clojure-Neuling innerhalb von einem Monat ein erstes Produkt auf die Beine stellen. \n\nHier möchten wir euch unsere Erfahrungen mitteilen und einmal darlegen in welchen Bereichen eine funktionale und präzise Sprache wie Clojure Vor- und Nachteile hat.\nDabei schneiden wir unter anderem folgende Themenbereiche an:\n* Grundzüge von Clojure\n* Full-Stack Webapp Entwicklung mit Clojure und Clojurescript\n* Interop mit Java und Javascript\n* Recruiting für Clojure\n* Weshalb Clojure perfekt für agile, kleine Startups ist\n\nEin kurzer Überblick über die von uns gewählten Frameworks und Bibliotheken und die Gründe dafür gehören ebenfalls zum Vortrag.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":12,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"2","audienceId":"1","typeId":"4","locationId":"1","speakerIds":["389391","384320"],"languageId":"1"},{"id":"606516","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"All inclusive?!?","abstractText":"Wann immer wir als Menschen zusammenkommen, versuchen wir eine gemeinsame Sprache zu finden. Meist fällt es uns relativ leicht, die Frage nach gesprochener Sprache oder Gebärdensprache, Deutsch oder Englisch, technik- oder businessorientierter Sprache zu beantworten. \nViel schwerer tun wir uns hingegen mit dem bewussten Einsatz einer inklusiven Sprache. Durch die Gender- und Diversity-Debatte der letzten Jahre sind wir sensibler geworden, sehen die Notwendigkeit dafür und doch fehlen uns manchmal die richtigen Worte. \nIn den meisten Teams arbeiten ganz unterschiedliche Menschen zusammen – verschieden in ihrem Geschlecht, ihrer Herkunft, ihrer Ausbildung, ihrer Erfahrung. Welchen Einfluss hat diese Vielfalt auf die Sprache in unseren Teams, in Unternehmen, im Alltag? Wie sorgen wir dafür, dass sich jeder Kollege und Kunde, jede Kollegin und Kundin in ihrer bzw. seiner Sprache angesprochen fühlt? Wie schreiben wir unsere Dokumente? Benutzen wir eine teamspezifische Sprache? Sprechen wir jede_n Entwickler_in im Team in seiner bzw. ihrer eigene n Sprache an? Ist das nicht alles ziemlich mühsam? \nWie kann inklusive Sprache aussehen, wie finden wir gemeinsam einen guten Weg dorthin? Wann fühlen wir uns angesprochen? Wie verändert unser Denken unsere Sprache und umgekehrt? \nDieser Talk ist ein Mix aus persönlicher Erfahrung und sprachwissenschaftlichem Hintergrund und soll dazu anregen, sich mit der eigenen Sprache (allein oder im Team) auseinanderzusetzen.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":19,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"5","locationId":"11","speakerIds":["389354"],"languageId":"1"},{"id":"607368","start":"2021-03-16T11:00:00","end":"2021-03-16T15:00:00","title":"Community Aktivität: JUG Café - Meet the JUGs","abstractText":"Auch in diesem Jahr soll das JUG Café ein zentraler Treffpunkt im Javaland sein. Natürlich gibt es wieder Möglichkeiten mit Vertretern diverser Java User Groups in Kontakt zu treten und wir bieten euch wie gewohnt den gemütlichen Rückzugsraum für ein ruhiges Gespräch oder eine kurze Pause vom Konferenzgetümmel. Nur für eure Kaffeespezialitäten müsst ihr ausnahmsweise selber sorgen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":1,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"4","speakerIds":["353141","359611"],"languageId":"1"},{"id":"606372","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"No Pain, No Gain: Using Clojure for Web Applications","abstractText":"Many of us are really into the paradigms of functional programming. Whether we like streams, mappings, pure functions or just the immutability of variables and objects. But can you use a modern functional programming language like Clojure for web applications? How does it feel when you write HTML with a functional language and which benefits is the backend going to have?\n\nThis talk provides a look at a web framework called Component in Clojure, dives into the world of lambda expression, and shows how to develop a WebShop-app with this framework. A live demo and coding will complete our functional lookout.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":4,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"2","audienceId":"1","typeId":"1","locationId":"8","speakerIds":["383362"],"languageId":"2"},{"id":"606460","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"Container hinter Schloss und Riegel","abstractText":"Docker war (und ist) kein Security-Tool zum Isolieren von Anwendungen – zumindest nicht in der der Standardkonfiguration. Der Wunsch nach zusätzlicher Sicherheit ist naheliegenderweise groß, weshalb Docker hier inzwischen eine Reihe von Features bietet, welche es einem Angreifer schwerer machen sollen, sich tiefer im System zu verbreiten. Unglücklicherweise sind viele dieser Funktionen standardmäßig abgeschaltet und verbergen sich hinter eher kryptischen Optionen.\n\nDieser Vortrag erklärt (und zeigt an der Shell) zunächst, auf welchen Grundlagen Docker fußt, um die Isolation zwischen Containern zu gewährleisten. Anschließend geht es um Best Practices für das Container Hardening: Was ist beim Erstellen von Docker-Containern zu beachten, welche zusätzlichen Schutzmöglichkeiten bietet Docker, und welche Tools können den Entwickler unterstützen?","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":44,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"5","audienceId":"3","typeId":"1","locationId":"10","speakerIds":["364378"],"languageId":"1"},{"id":"606764","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"Mobile Development with Ionic, React Native, and JHipster","abstractText":"Mobile development offers a lot of options. To develop native apps, you can use Java or Kotlin on Android. On iOS, you can use Objective C or Swift. There are other options, too. You can build hybrid mobile apps and Progressive Web Apps (PWAs). Hybrid mobile apps are those created with web technologies (HTML, JavaScript, and CSS) that look like native apps. PWAs have the ability to work offline and act like mobile apps.\n\nIn this talk, we'll explore a few different mobile technologies: Ionic 4 (with Angular), React Native, and PWAs. You'll walk away with knowledge of how to build mobile and Spring Boot apps in minutes with JHipster.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":22,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"13","audienceId":"1","typeId":"4","locationId":"11","speakerIds":["374919"],"languageId":"2"},{"id":"606335","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"Zeitsparende Metriken - Insbesondere in den Wolken #slideless","abstractText":"Microservices implizieren Kommunikation zwischen Prozessen-auch zwischen JVMs manchmal in den Wolken. Aussagekräftige Metriken beschleunigen nicht nur die Entwicklung, sondern erleichtern auch die Fehlersuche nach dem Deployment.\n\nIn diesem Vortrag möchte ich eine Anwendung \"from scratch\" mit MicroProfile && Co. implementieren und dabei Monitoring, Tracing und Metriken Ideen und Ansätze diskutieren. \n\nDer Fokus der Session liegt auf Produktivität, Testbarkeit und Nachhaltigkeit. Keine Slides, nur kontinuierliche deployments und viel Code.\n\nKritische Fragen der Teilnehmer sind sehr willkommen!","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":45,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"3","typeId":"1","locationId":"13","speakerIds":["353747"],"languageId":"1"},{"id":"606528","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"Schluss mit Cargo Culting!","abstractText":"Hast du letztens in nem Blog ein Framework entdeckt und es gleich am nächsten Tag ins eigene Projekt „zum damit Spielen” eingebaut? Musstest du deine Anwendung schon öfter „skalierbarer”, „performanter” oder „zuverlässiger” machen und zogst dir einen Tech-Stack von den “Big Five” rein, um damit das nächste Amazon, Netflix, WhatEver zu werden?\n\nWahrscheinlich klang das zu dem Zeitpunkt logisch und nach einer superguten Idee. Aber ein paar Monate später weiß man selbst oft gar nicht mehr, was der eigentliche Grund für den Einsatz war. Man macht es, ohne genau zu wissen, warum: Cargo Cult par excellence!\n\nIn diesem Vortrag zeige ich, wie sich Entscheidungen für Technologien, Vorgehen und Praktiken strukturiert auswählen und nachvollziehbar motivieren lassen. Wir sehen uns an, was uns bei der Auswahl (oft unerkannt) antreibt. Dazu fischen wird zuerst die geforderte Qualität für Features aus User Stories und bauen uns ein Netz aus den qualitativen Ansprüchen für den Überblick. Mit einer ordentlichen Portion Architekturtaktiken in den Segeln schippern wir in den sicheren Hafen der fundierten Entscheidungen.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":43,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"1","typeId":"5","locationId":"7","speakerIds":["376291"],"languageId":"1"},{"id":"606595","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"Secure Microservices made easy with MicroProfile JWT","abstractText":"Are you wondering how to secure microservices? MicroProfile JWT  (https://microprofile.io/) has the answer. MicroProfile JWT designs a token based authentication and authorization mechanism, which enables authorized access from clients to services or from services to services by using JWT token. This session will give you a quick overview on the MicroProfile JWT design, followed by a live demo of 2 microservices communication by passing on the JSON web token, running on Open Liberty (https://openliberty.io/) and Quarkus (https://quarkus.io/). Come to this session to understand the technology and learn how to use it.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":26,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"5","audienceId":"1","typeId":"1","locationId":"12","speakerIds":["386430"],"languageId":"2"},{"id":"606724","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"Eine Reise durch die JDKs","abstractText":"Viele von Euch, so wie ich, arbeiten im Job noch mit JDK 8. Daher möchte ich Euch mitnehmen auf die Reise durch die\nJDKs. \nWir starten unsere Reise bei JDK 8 und reisen bis zur aktuellen Version, außerdem wagen wir einen Blick \nauf die Attraktionen der zukünftigen Versionen.\nWir halten unter anderem an folgenden Stationen:\n \n   - JShell\n   - Private Methoden im Interface\n   - Reservierter Typ \"var\"\n   - Erweiterung der Collections\n   - HttpClient/HttpRequest neues FluentAPI  \n   - Switch Expressions\n   - Erweiterung der String Klasse\n   - Records\n   - Sealed Classes\n \nDiese werden zum Teil an Hand von Quelltext Beispielen veranschaulicht. \n \nIch wünsche Euch eine gute Reise. \nP.S. Bringt festes Schuhwerk mit. :)","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":51,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"1","typeId":"2","locationId":"7","speakerIds":["388985"],"languageId":"1"},{"id":"607447","start":"2021-03-17T17:00:00","end":"2021-03-17T19:00:00","title":"Community Aktivität: Workshop - Kotlin/Native und Multiplatform\r","abstractText":"Wir bauen gemeinsam eine auf der DukeCon Kotlin Native Library basierende App, die das Vortragsprogramm der JavaLand anzeigen kann. Hier lernt ihr Kotlin/Native und Kotlin Multiplatform kennen und erfahrt, wie man eine KLib baut, sie konsumiert und auf unterschiedlichen Zielplattformen einsetzt.\n\nVoraussetzungen:\nBitte installiert auf Eurem Rechner/Laptop vor dem Workshop folgende Software:\n- Aktuelle Version von IntelliJ IDEA (aktuell 2020.3.2)\n- oder Android Studio (aktuell 4.1.2)\n- bitte sicherstellen, dass das aktuelle Android SDK installiert habt (wird bei Android Studio automatisch installiert)","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":3,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"3","speakerIds":["374971","363284"],"languageId":"1"},{"id":"606464","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"TypeScript: Grundlagen und fortgeschrittene Techniken","abstractText":"TypeScript ist für viele Frontend-Projekte eine ernsthafte Alternative zu JavaScript, da es - genau wie Java - ein statisches Typsystem enthält. \n\nIn diesem Vortrag möchte ich Euch das mächtige Typsystem von TypeScript vorstellen.  An Hand konkreter Beispiele zeige ich Euch die  Grundlagen der Sprache und stelle Euch erweiterte (und überraschende) Techniken vor, mit denen ihr auch Eure komplexesten Code-Strukturen effizient typsicher implementieren könnt.  \nNach dem Vortrag habt ihr einen Eindruck, was TypeScript alles leisten kann und könnt entscheiden, ob die Sprache für Eure eigenen Projekte eine sinnvolle Alternative zu JavaScript sein kann.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":53,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"13","audienceId":"1","typeId":"5","locationId":"11","speakerIds":["378753"],"languageId":"1"},{"id":"606554","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Doku-Microsites mit jBake","abstractText":"Dokumentation in Markdown oder AsciiDoc zu erstellen ist einfach. GitHub, GitLab und Bitbucket zeigen die Dokumente schon gleich im Repository als HTML-Seite an. Doch wie bekomme ich aus diesen Dokumenten jetzt eine schicke Website hin, die nicht nur das Projekt dokumentiert, sondern auch das Projekt über eine nette Landingpage vorstellt, die Architektur bereitstellt und einen Newsfeed anbietet? \n\nIn diesem Vortrag zeige ich, warum sich jBake gerade für Java-Projekte ausgezeichnet eignet um für jedes Projekte mit wenig Aufwand eine schicke Microsite zu erstellen - vom Plain-Text-Dokument bis zur veröffentlichten Website mit TLS.\n\nDabei werde ich viele Tricks und Kniffe aus dem Projektalltag einfliessen lassen. Landingpage, Architekturdokumentation mit arc42, Anwenderdoku mit AsciiDoc, Blog mit RSS-Feed und eine Suche werden kombiniert und einfach in das bestehende Projekt-Repository entsprechend dem Docs-as-Code-Ansatz integriert. Über ein Open Source Template wird er Einstieg in die Erstellung einer eigenen Microsite nach dem Vortrag erleichtert.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":31,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"10","audienceId":"1","typeId":"1","locationId":"7","speakerIds":["364065"],"languageId":"1"},{"id":"607192","start":"2021-03-16T15:00:00","end":"2021-03-16T15:45:00","title":"Reacting to an event-driven world","abstractText":"We now live in a world with data at its heart. The amount of data being produced every day is growing exponentially and a large amount of this data is in the form of events. Whether it be updates from sensors, clicks on a website or even tweets, applications are bombarded with a never-ending stream of new events. So, how can we architect our applications to be more reactive and resilient to these fluctuating loads and better manage our thirst for data? In this session explore how Kafka and Reactive application architecture can be combined in applications to better handle our modern data needs.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":12,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","locationId":"14","speakerIds":["389877"],"languageId":"1"},{"id":"606558","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"Porting PiggyMetrics from Spring Boot to MicroProfile","abstractText":"PiggyMetrics is a popular open source end-to-end sample which demonstrates the use of Spring Boot and Spring Cloud features in a microservices-style application. Spring Boot and MicroProfile are popular competing frameworks for building apps in the cloud-native microservices style. Functionally, architecturally, and historically they have many things in common.  From a business, economic and governance perspective they have significant differences. This session from Java Champions Ed Burns and Emily Jiang, respectively of Microsoft and IBM, briefly surveys the history and non-technical aspects in comparing the Spring Boot and MicroProfile stacks and then will take you through a real world case study based on PiggyMetrics.  We will share our experience of porting it from Spring to MicroProfile.\n\nPiggyMetrics models a personal finance application and uses cloud native microservices features such as externalized configuration, aggregate logs, service metrics, security propagation, and distributed tracing. The porting exercise utilizes MicroProfile features such as Config, Metrics, Health Check, Fault Tolerance, Open Tracing and JWT Propagation along with Jakarta CDI, REST and JSON Binding.\n\nJoin Ed and Emily for a fun and informative compare and contrast ride.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":3,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"3","typeId":"1","locationId":"13","speakerIds":["353543","386430"],"languageId":"2"},{"id":"606772","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"Newcomer: Building Truly Accessible Software","abstractText":"More and more, companies become aware that making their software accessible is not only the right thing to do, but opens up the software for a bigger market. However, most of the time accessibility is thought of only at the end of a project when there is no time left. Including accessibility concerns right from the start would make it easier to build a truly accessible solution. Still, for us developers, it is difficult to get a solid grasp on accessibility. There is a wide range of tools that check the accessibility of your web application. Most of them perform well, however, they only scratch the surface of what true accessibility means.\nIn this session, I would like to offer an entry point into the complex topic. I explain what accessibility is really about, who benefits from it, and why you shouldn't just rely on tools when developing an accessible application.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":24,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"3","locationId":"13","speakerIds":["369502"],"languageId":"2"},{"id":"606339","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Sustainability in Software Engineering","abstractText":"Der Klimawandel ist real und jeder muss einen Beitrag dazu leisten, den Klimawandel zu stoppen - auch, und vielleicht sogar gerade, Software-Entwickler. Aber wie?\n\nDer Vortrag gibt einen ausführlichen Einblick, welchen Einfluss Software-Entwicklung auf den Klimawandel hat und welche Maßnahmen jeder Software-Entwickler ergreifen sollte, um den Klimawandel zu stoppen.\n\nIm Vortrag beleuchten wir vor allem CO2-Emissionen, welche unterschiedlichsten Bereiche davon im Alltag eines Entwicklers betroffen sind, und was jeder Entwickler tun kann, um die Emissionen dauerhaft zu senken. Entsprechende konkrete Zahlen zu den Emissionen liefern zum Teil überraschende Ergebnisse und Einsichten.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":40,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"1","typeId":"1","locationId":"8","speakerIds":["382598"],"languageId":"1"},{"id":"606436","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"Machinelearning mit Springboot und H20","abstractText":"Schätzungsweise 60% aller Machine-Learning- und Analytics-Projekte in Unternehmen gelangen nicht über eine Experimental- bzw. Pilotphase hinaus. Diese Zahl zeigt eindrucksvoll, dass\nData Science und Operative Systeme oft noch in sehr unterschiedlichen Welten stattfinden. Beide Welten zu verknüpfen bedingt aktuell eher komplexe mehrstufige Prozesse. Oft mit dem Ergebnis,\ndass der ein oder andere Schritt nur manuell durchgeführt werden kann und somit jegliche Möglichkeit zur Automatisierung und damit Skalierung zu nichte macht indem z.B. bereits entwickelte Modelle mühsam händisch im operativen System nachgebaut werden.\nDie Open Source Machine Learning Plattform H2O, welche auch von Stanford-Professoren beraten wird, fungiert jedoch als Brückenbauer zwischen beiden Welten und bietet zur Lösung der dargestellten Probleme eine Sammlung an mächtigen Features an - unter anderem sind dies\neine REST-API, sowie Python- und R-Schnittstellen um Daten einzulesen, Workflows in H2O zu steuern - aber auch die Möglichkeit, Modelle zu generieren, die wiederum direkt im eigentlichen Java Code eingebunden und aufgerufen werden können.\nAll diese Funktionalitäten nutzen wir, um zunächst mit Hilfe eines Springboot-Webservices über eine schlanke Schnittstelle H2O an ein operatives Betrugssystem zu koppeln und somit die Möglichkeit erhalten unserem System automatisiert Input aus verschiedenen Machine Learning-Modellen anzuliefern.\nDer Vortrag skizziert die Umsetzung beginnend bei der Erstellung und Testung des Modells, sowie der Programmierung der benötigten Schnittstellen, bis hin zum automatischen Datenimport, der Anpassung des Generierung des Models sowie dessen schlussendlichen Übernahme ins operative System über H20 und den eigens entwickelten Webservice.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":36,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"11","audienceId":"3","typeId":"4","locationId":"9","speakerIds":["380385"],"languageId":"1"},{"id":"606719","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"Ab ins Home-Office: Kollaboratives Remote Arbeiten für Dev","abstractText":"Ausgelöst durch die aktuelle Corona-Situation wurde viele Teams dazu gezwungen, plötzlich remote miteinander zu arbeiten. Die technischen Vorraussetzungen dafür, wie Laptop, VPN, etc., wurden meistens ziemlich schnell bereit gestellt.\nAber wie sieht es mit der Tool Unterstützung für kollaboratives remote Arbeiten, angefangen von Kommunkation, Konzepterstellung, Pair-Programming bis hin zu Mob-Programming aus?\nIn diesem Talk wollen wir einige Tools, die wir im Projektalltag verwenden, vorstellen und deren Stärken und Schwächen anhand eines typischen Entwickleralltags beleuchten.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":68,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"10","audienceId":"1","typeId":"5","locationId":"10","speakerIds":["380030"],"languageId":"1"},{"id":"606368","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"Der Quality Evangelist – Testmanagement Lost In Transition?","abstractText":"Testen funktioniert häufig recht gut innerhalb eines agilen Teams. Aber teamübergreifendes Testen gestaltet in der Regel äußerst schwierig.\nBesonders nach oder während der Transition von „klassischer“ zu „agiler“ Entwicklung bleiben die angestammten Managementrollen auf der Strecke.\nErgo: Der Anzug des \"alten\" Testmanagers sitzt im agilen Kontext nicht mehr so gut.\nMerke: Managementrollen stehen in krassen Gegensatz zu Agilität.\n\nBedeutet dies: Die koordinierende (Management-) Rolle ist weg, aber die Aufgaben sind noch da?\nAuch wichtig: Wohin mit den Managern?\n\nNoch mehr Fragen:\nWer ist verantwortlich für die Qualität des Produkts? Die Teams! Wer organisiert das Testen in den agilen Teams? Auch die Teams! Aber welches Team ist verantwortlich für das Übergreifenden Testen?\n\nKennen Sie solche oder ähnliche Fragestellungen?\n\nIm Rahmen dieses Vortrags möchte ich skizzieren, wie ein „Quality Evangelist“ diese Fragen beantworten würde.\nNeben bei klären wir gemeinsam, warum es in einem agilen Kontext keine Managementrollen geben kann.\n\nWir werden uns damit beschäftigen, welche Möglichkeiten es gibt, übergreifende Testthemen im agilen Kontext zu betrachten\nund wie man gezielt teamübergreifende Maßnahmen etabliert – natürlich selbstorganisiert und unter Beteiligung der einzelnen Teams.\nWir werden auf Organisationsformen eingehen und uns damit beschäftigen, wie eine zusätzliche Rolle analog zu einem agilen Coach den Teams helfen kann, dem Thema Qualität auch teamübergreifend die Wertschätzung entgegen zu bringen, die der Kunde erwartet.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":23,"keywords":{"de":[],"en":[]},"documents":{"slides":"https://www.doag.org/formes/pubfiles/12820263/2021-nn-georg_haupt-der_quality_evangelist__testmanagement_lost_in_transition_-praesentation.pdf","manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"1","locationId":"9","speakerIds":["386287"],"languageId":"1"},{"id":"606532","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"How to ruin your application performance","abstractText":"LucaNet hat über die Jahre eine sehr komplexe und umfangreiche Software entwickelt. Das bedeutet leider auch, dass sehr viele Leute unterschiedliche Spuren im Code hinterlassen haben. Um die Performance der Software dauerhaft ausreichend zu halten, wurde dafür ein dediziertes Team geschaffen. Performance bedeutet nicht nur Geschwindigkeit, sondern auch Speicherverbrauch und außerdem hängen diese beiden Punkte ja sowieso irgendwie zusammen. Ich möchte in dieser Session ein wenig über unsere Fundstücke und Probleme berichten und diese in einer Art Don’ts für die Entwickler präsentieren.\nAgenda\n- Xmx - Wieviel Speicher verbraucht eigentlich meine Anwendung\n- Control Flow by Exception\n- Autoboxing\n- LinkedLists\n- Streams & Collections","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":67,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"1","typeId":"1","locationId":"12","speakerIds":["389367"],"languageId":"1"},{"id":"606627","start":"2021-03-17T15:00:00","end":"2021-03-17T15:40:00","title":"Anwendungsmodernisierung? Erfolgreich mit ADRs!","abstractText":"Modernisierungsprojekte sind nie einfach. Selbst der Austausch einer \"einfachen\" Bibliothek kann schnell zur unendlichen Geschichte werden. Dabei ist Modernisierung ein fester Bestandteil des Softwarelebenszyklus und wichtig, um das Erreichen von Qualitätszielen fortwährend zu ermöglichen. Wichtig jedoch ist, dass eine parallele Feature-Entwicklung möglich ist, sodass der Impact von Modernisierungen vorab bestimmt und für alle dokumentiert werden muss. \n\nDieser Vortrag zeigt anhand der Migration der Datenbanktechnologie eines Shopsystems, wie Entscheidungen mit ADRs leichtgewichtig dokumentiert und allen Entwicklern zugänglich gemacht werden können. Es soll betrachtet werden, welche Implikationen die Entscheidung hat und wie der Fortschritt toolgestützt überwacht und abgesichert werden kann.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":30,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"3","typeId":"5","locationId":"13","speakerIds":["379082"],"languageId":"1"},{"id":"606671","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"Application Class Data Sharing - eine Bestandsaufnahme","abstractText":"Application Class Data Sharing (AppCDS) hat sich zum Ziel gesetzt, Startzeiten und Memoryauslastung von Java Applikationen zu reduzieren, indem Klassen, welche von einer Applikation genutzt werden, vorbereitet und beim Programmstart direkt geladen werden. Erst nur als kommerzielles Feature erhältlich, später im OpenJDK eingeführt und stetig verbessert, fristet es trotzdem weitestgehend ein Schattendasein. \nIn diesem Vortrag zeige ich, wie man AppCDS konfiguriert und einsetzt, und stelle an einigen Beispielen, von der \"Hello World\" App bis zum schweren Application Server, dar, in welchem Setting es Verbesserungen mit sich bringt und worauf man beim Entwickeln achten muss, um sein Potenzial auszuschöpfen.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":15,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"5","locationId":"8","speakerIds":["381737"],"languageId":"1"},{"id":"606781","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"Newcomer: Grundprinzipien ethischer Nutzung von Künstlicher Intelligenz und deren Ausgestaltung","abstractText":"Anwendungen künstlicher Intelligenz finden immer häufiger Einsatz. \nDa verwundert es nicht, dass bereits mehrere Prinzipienkataloge für eine ethische Nutzung von Institutionen nationaler und internationaler Ebene erarbeitet wurden. Um bei der Prinzipienvielfalt nicht den Überblick zu verlieren, haben Philosophen mit Hilfe einer Meta-Analyse fünf Prinzipien herausgearbeitet, die sich den zentraler Kern ethischer Überlegungen für Künstliche Intelligenz bilden.\n\nIn meinem Vortrag erkläre ich warum zu viele Prinzipien eher verwirren als Klarheit stiften und was es mit den fünf Kernprinzipien: Gemeinwohl, Verhinderung von Bösem, Autonomie, Gerechtigkeit und Erklärbarkeit konkret auf sich hat. \nAnschließend stelle ich die jüngst veröffentlichte Bewertungsliste der Europäischen Kommission vor, die bei der Beurteilung, ob eine KI-Applikation den ethischen Prinzipien für Künstlicher Intelligenz entspricht, helfen soll. Und zeige auf wie die Kernprinzipien sich in den Bewertungsfragen wiederfinden.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":13,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"1","typeId":"3","locationId":"9","speakerIds":["382429"],"languageId":"1"},{"id":"607345","start":"2021-03-16T18:00:00","end":"2021-03-16T21:00:00","title":"Community Aktivität: Architektur Dojo","abstractText":"Als Architekten oder Entwickler bauen wir Systemarchitekturen und bekommen meist erst am Ende des Projekts Feedback, ob es so funktionierte oder nicht. In diesem Architektur Dojo ist das anders: Bereits nach einer halben Stunde präsentierst du deinen Entwurf, bekommst Feedback und kannst die Lösung anschließend verbessern! Bearbeite jenseits von eingetretenen Pfaden des Projektalltags gemeinsam mit anderen eine Architekturaufgabe. Übe es, Architekturen und Architekturentscheidungen zu präsentieren und zu begründen! &#8203; \n\nVoraussetzungen:&#8239;Für die Teilnahme ist ein Laptop mit Internetzugang erforderlich. Um Gedanken und Ideen bezüglich der Architektur zu teilen, ist ein Mal- oder Modellierungsprogramm hilfreich.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":19,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"3","locationId":"2","speakerIds":["368442","370142"],"languageId":"1"},{"id":"606416","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Infinitely scalable microservices with Loom and Helidon","abstractText":"Project Loom introduces VirtualThreads to OpenJDK. VirtualThreads are so lightweight that they are practically an unbounded resource. You can use as many as you like! Blocking I/O? No problem. Forget reactive and return to those simpler, joyful times of synchronous programing. In this talk you will learn about VirtualThreads and see our experimental result with Helidon, an open source microservices framework, to build a highly scalable microservice.\n\n(Project Loom is to intended to explore, incubate and deliver Java VM features and APIs built on top of them for the purpose of supporting easy-to-use, high-throughput lightweight concurrency and new programming models on the Java platform. - https://wiki.openjdk.java.net/display/loom/Main)","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":13,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"2","locationId":"13","speakerIds":["386820"],"languageId":"2"},{"id":"606476","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"Wir müssen reden - Depression, Suizid und was man tun kann","abstractText":"\"Suizid war 2016 die zweithäufigste Todesursache der 15- bis 29-Jährigen.\" (Wikipedia)\n\nWir reden über Verkehrstote, über Krebstote, über Drogentote. \nDabei ist Suizid die einzige relevante Todesursache, bei der das \"darüber reden\"\ntatsächlich den Tod verhindern kann.\n\nAlso lasst uns darüber reden.\n\nIm August 2020 habe ich mich mit einer schweren Depression und detaillierten Plänen zum Suizid in stationäre psychiatrische Behandlung begeben.\nIch bin in die Klapse gegangen.\n\nIn diesem Vortrag werde ich berichten wie es dazu kam.\nWarum ich diesen Schritt erst so spät gemacht habe.\nWas in der Behandlung passiert ist. \nWie mir und anderen geholfen wurde.\n\nUnd vielleicht am wichtigstens: Was ihr tun könnt um euch selbst oder anderen zu helfen.\n\nDazu gehört natürlich, was Depression ist, und was sie nicht ist und unterschiedliche Formen, wie sie entstehen kann.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":50,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"4","locationId":"8","speakerIds":["354836"],"languageId":"1"},{"id":"606740","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"Java After Eleven","abstractText":"Most projects that updated past Java 8 decided to stick to the LTS release 11. The new cadence created the illusion of not much happening after that, but nothing could be further from the truth - with new language features like switch expressions, text blocks, records, and sealed classes, Java is moving faster than ever.\n\nIn this talk, we'll take a simple Java 11 code base, update it to 15, and refactor it to use the new language features and APIs. You'll be surprised how much the code changes!","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":63,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"2","locationId":"1","speakerIds":["374910"],"languageId":"2"},{"id":"606484","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"Legacy-Software und Monolithen tragfähige Architektur geben","abstractText":"Wie man ein neues Projekt auf der grünen Wiese beginnt und dabei eine saubere Architektur baut, das wissen wir heute ganz gut. Aber die meisten von uns arbeiten ja in Projekten, die schon lange da sind und deren Architektur (vorsichtig gesagt) nicht mehr ganz so schön ist. »Monolith« und »Big Ball of Mud« sind die wenig schmeichelhaften Titel, die solchen Systemen verpasst werden.\n\nIn diesem Talk zeige ich, wie wir hier (wieder) Struktur einführen können. Dabei setzen wir eine Kombination von Clean Architecture, Domain-Driven Design und der Betrachtung von Software als soziotechnisches System ein.\n\nAls Zuhörer*in hat man nach 45 Minuten eine Vorstellung davon, mit welchen Schritten eine Microservices-Architektur oder ein strukturierter Monolith (ein sogenannter Modulith) erreicht werden kann. Und welche Variante im eigenen Projekt die richtige ist.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":61,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"3","typeId":"1","locationId":"1","speakerIds":["370942"],"languageId":"1"},{"id":"607426","start":"2021-03-16T16:00:00","end":"2021-03-16T19:00:00","title":"Community Aktivität: Android-Programmiercrashkurs","abstractText":"Ihr möchtet Android-Apps selbst entwickeln, habt aber keine Lust, Tutorials allein durchzuarbeiten? Dann nehmt am Android-Programmiercrashkurs der JavaLand teil! Wir bieten Euch einen Einsteigerkurs, der Euch so weit bringen soll, Eure eigenen kleinen Apps zu schreiben. Wir erklären Euch die Grundlagen der App-Entwicklung und erarbeiten diese praktisch mit Euch. Aus dem Crashkurs geht Ihr mit Eurer ersten selbst entwickelten Android-App auf dem Smartphone – und hoffentlich nicht der letzten.\n\nVoraussetzungen:\nEine Teilnahme am Workshop ist nur möglich, wenn zuvor die folgenden beiden Schritte bereits durchgeführt wurden.\n\n- Download Android Studio and SDK tools: https://developer.android.com/studio\n- Build your first app: https://developer.android.com/training/basics/firstapp\n\nSolltet Ihr beim zweiten Schritt die \"Build your first app\"-Aufgabe vollständig abgeschlossen haben, so seid Ihr bereit für die Teilnahme ab 16 Uhr.  Wenn es dabei noch Probleme gab, stehen wir ab 15:00 Uhr im Workshop-Raum zur Verfügung. Wir werden die Probleme dann reihum besprechen und versuchen, diese noch bis 16 Uhr zu lösen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":15,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"6","speakerIds":["386019"],"languageId":"1"},{"id":"606331","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"A Supersonic Subatomic Guide to Chaos Engineering","abstractText":"“Die Produktion ist mal wieder down, aber keine Ahnung was los ist” - Wäre doch super, wenn wir jetzt einfach die Feuerwehr anrufen könnten und alles wird gut, oder? Meist sind wir leider selbst verantwortlich.\nIn der Produktion ist die Frage nicht ob es brennen wird, sondern wann! Genau das wollen wir beim Chaos Engineering üben, um im Ernstfall gewappnet zu sein um so die Time to Recovery und die Produktionsstabilität zu verbessern. Denn obwohl wir immer mehr testen und die Code-Coverage teilweise religiös verteidigt wird, die stabile Produktion ist für viele von uns noch immer ein lang ersehnter Traum. \nNeben einer Erklärung, warum Chaos Engineering den komplexen Problemen in der IT gerechter wird als andere Verfahren und wann Chaos Engineering keinen Sinn macht, gehen wir in diesem Vortrag auch darauf ein, was Chaos Engineering ist und wie Chaos Engineering in den Alltag unseres Tuns integriert werden kann. Im praktischen Teil werden wir, mit Hilfe von Quarkus, gemeinsam ein Experiment gestalten, durchführen und die gefundenen Probleme mitigieren.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":34,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"3","typeId":"1","locationId":"13","speakerIds":["386792"],"languageId":"1"},{"id":"606444","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Continuous Deployment Roadmap","abstractText":"In größeren Unternehmen existiert häufig eine umfangreiche Anwendungslandschaft. Dennoch besteht der Wunsch oder der Bedarf, regelmäßig neue Versionen der Produkte produktiv zu setzen, um entweder neue Features auszuliefern oder Sicherheitslücken zu schließen. Welche Voraussetzungen für Continuous Deployment erfüllt sein müssen, wird anhand einer Roadmap in diesem Vortrag vorgestellt. Dabei werden Herausforderung wie Verfügbarkeits-, Sicherheits- und Qualitätsanforderungen angesprochen. Spezielles Augenmerk gilt dem Aspekt verteilter Verantwortlichkeiten, unabhängig von einer erfolgreichen Etablierung einer DevOps Kultur.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":47,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"3","typeId":"5","locationId":"8","speakerIds":["365736"],"languageId":"1"},{"id":"606890","start":"2021-03-16T09:30:00","end":"2021-03-16T10:10:00","title":"Keynote: The value of learning and sharing","abstractText":"As a developer, two of the best ways for me to progress in my career have been learning from others and sharing with others. In this talk, I’ll talk about my journey of learning and sharing. I’ll explain how I became active in software communities; first by joining and consuming, later by organizing and presenting. I’ll share my journey from an aspiring speaker at in-company events to taking the stages of big international conferences. I’ll end with explaining why I believe that deliberate learning and sharing is important and I’ll give you a couple of practical tips to get started.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":127,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"audienceId":"1","locationId":"1","speakerIds":["371530"],"languageId":"2"},{"id":"606744","start":"2021-03-17T15:00:00","end":"2021-03-17T15:40:00","title":"Self-contained Systems Advanced","abstractText":"Mit Self-contained Systems (https://scs-architecture.org/) wird komplexe Software gemäß Domain-driven Design-Prinzipien in unabhängigen Systemen entwickelt.\n\nIn diesem Vortrag werden weiterführende Themen rund um die praxisnahe Umsetzung von Self-contained Systems besprochen:\n\n- Organisation: Welche Teams bauen welche Systeme? Wie koordinieren sich die Teams?\n- Feeds: Asynchroner Datenaustausch mittels REST-Feeds\n- Pattern-Library: Einheitliches Look & Feel über alle Seiten hinweg\n- Security: Wie wird eine übergreifende Authentifizierung sichergestellt?","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":49,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"3","typeId":"1","locationId":"1","speakerIds":["382173"],"languageId":"1"},{"id":"607467","start":"2021-03-17T15:00:00","end":"2021-03-17T18:00:00","title":"Community Aktivität: Property Based Resilience Testing Workshop","abstractText":"Property Based Resilience Testing beschreibt die Kombination von Resilience Testing mit Property Based Testing. Resilienz ist die Fähigkeit eines Systems, bei Störungen bzw. Teil-Ausfällen nicht vollständig zu versagen. Bei Resilienztests wird bestimmt, wie groß der Umfang dieser Fähigkeit ist. Es wird zum Beispiel untersucht, wie sich zwei Applikationen verhalten, wenn die Verbindung zwischen Ihnen unterbrochen wurde. Solch ein Test wird als Testplan festgehalten, welcher zusätzlich beschreibt, welche Ergebnisse akzeptabel sind. Je mehr Abhängigkeiten ein System hat desto größer wird die Menge an zusätzlichen Testplänen und potenziert sich sobald noch andere Fehler, wie bspw. hohe Latenzen, hinzukommen. Alle Testfälle zu finden und festzuhalten, ist unmöglich. Property Based Testing hilft bei der Erstellung einer beliebigen Anzahl an zufälligen Testplänen. Bei der Ausführung dieser Pläne wird darauf geachtet, dass bestimmte Verhaltenseigenschaften bestehen bleiben. In diesem Workshop möchte ich euch zeigen wie container-basierte Systeme in dieser Weise mit jqwik.net und testcontainers.org getestet werden können. Weiterhin gehen wir kurz auf mögliche Alternativen ein. Der Workshop richtet sich an Anfänger und Fortgeschrittene. Kenntnisse über Property Based Testing sind hilfreich aber nicht unbedingt notwendig. \n\nVoraussetzungen \nFür die Teilnahme ist ein PC mit Docker, Git und Java IDE erforderlich. Die Docker-Version muss dabei mindestens der unter https://www.testcontainers.org/supported_docker_environment ausgelisteten Version entsprechen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":7,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"6","speakerIds":["371318"],"languageId":"1"},{"id":"607236","start":"2021-03-17T10:00:00","end":"2021-03-17T10:45:00","title":"Einstieg in die Absicherung von Cloud-Native Java Microservices Anwendungen an einem Beispiel","abstractText":"Vielleicht haben Sie sich als Entwickler, der mit einer Cloud Native Microservices Java Anwendung beginnt, schon die Frage gestellt: \"Wie beginne ich mit der Implementierung der Authentifizierung und Autorisierung und wie setzte ich mTLS und TLS für meine Anwendung auf?\".\n\nIn dieser Session konzentrieren wir uns auf den Einstieg in die Anwendungssicherheit aus zwei Perspektiven anhand des Beispiels einer Cloud-Native Java-Anwendung:\n- Implementierung von Authentifizierung und Autorisierung \n- Plattformsicherheit \n\nEs werden die genannten Themen anhand einer Beispielanwendung veranschaulicht:\n- Implementieren der Autorisierung und Authentifizierung mit dem Open Source-Identitäts- und Zugriffsverwaltungssystem Keycloak und JSON Web Tokens (JWT) \n- Absicherndes externen Zugriffsauf einem Kubernetes-Cluster mit TLS\n- Absichernder Kommunikation zwischen derMicroservices mit Istio und mTLS\nDer Inhalt basiert auf der Beispielanwendung des OpenSource Github-Projekts #CloudNativeStarter, die mit Quarkus und Microprofile implementiert wurde.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":13,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"1","locationId":"14","speakerIds":["384997"],"languageId":"1"},{"id":"606591","start":"2021-03-17T15:00:00","end":"2021-03-17T15:40:00","title":"Infrastructure as Code with Terraform","abstractText":"Being able to script my infrastructure is an awesome feature I don’t want to miss anymore. Over three years ago I started with Terraform and I’m still in love, but run through some pain points, as well. \n\nIn this session I want to give you an introduction to scripting your infrastructure with Terraform, talking about best practices as well as tips and tricks and what I like & don’t like. I’ll mainly focus on deploying infrastructure to AWS, but Terraform can be used for multiple providers. So let’s explore together how far we can go with IaC - Infrastructure as Code. There will be a live coding part, too, where we deploy a simple website using AWS S3.\n\nThis session requires at least basic understanding of Cloud Computing.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":35,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"1","typeId":"1","locationId":"8","speakerIds":["389383"],"languageId":"2"},{"id":"606679","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Kubernetes-Architektur und Infrastrukturtests","abstractText":"Letztes Jahr habe ich gezeigt wie wir be Instana mit Hilfe von tiefgreifenden Refactorings, der Einführung von Integration Tests und vielen Stunden Arbeit mehrere Datenbanken aus Instana entfernt haben.  Das Ergebnis erlaubte es uns deutlich häufiger neue On–Premise-Versionen in höherer Qualität an unsere Kunden zu liefern.\nParallel zu diesem Umbau migrierten wir unsere gesammte SaaS auf Kubernetes. Mit dem neu erworbene Wissen ergaben sich neue Optionen für On-Premise-Kunden mit deutlich höheren Lastanforderungen als was bisher möglich war.\nIn diesem Talk werde ich unseren steinigen Weg in die Kubernetes-Welt beschreiben, die Hindernisse auf die wir trafen, der Operator der daraus entstand und wie man Integrations Tests für komplette Infrastrukturen aufbaut.\nEs wird einiges über Kubernetes-Eigenarten, über Eigenarten von selbst-gehosteten Kubernetes-Clustern, die Schwierigkeiten ein großes verteiltes System ohne menschliche Operator zu deployen und die unangenehmen Kompromisse die man eingehen muß geben.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":69,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"3","typeId":"4","locationId":"1","speakerIds":["364537"],"languageId":"1"},{"id":"607353","start":"2021-03-16T12:00:00","end":"2021-03-16T13:00:00","title":"Community Aktivität: Panel Diskussion Jakarta EE","abstractText":"After the change from Jakarta EE to the Eclipse Foundation, the community has shown that it can deliver with Jakarta EE 8, 9 and soon 9.1. Now it is interesting to discuss what the future will bring, what involved developers and spec authors have experienced, and how good the tool coverage is. In this expert panel, we will take a look at all aspects of Jakarta EE from different points of view.\n\nPanel with experts on the topic of Jakarta EE:\n    Emily Jiang (IBM; Jakarta Committer)\n    Markus Karg (Individual; JAX-RS Committer)\n    Ivar Grimstad (Eclipse Foundation)\n    Ondrej Mihályi (Payara; Jakarta Committer)\n    Jean-Louis Monteiro (Tomitribe; TCK Committer)\n    Jürgen Höller (VMware, Spring Framework project lead)\n    Moderation: Jan Westerkamp (delegate for the iJUG Eclipse Foundation membership)","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":8,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"3","speakerIds":["365399","366617"],"languageId":"2"},{"id":"606456","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"Open Source Application Performance Monitoring (APM) Tools","abstractText":"Die Anzahl der frei verfügbaren Application Performance Monitoring (APM) Tools für Java-basierte Enterprise-Anwendungen (EA) hat in den letzten Jahren stark zugenommen. Das Tracing von Transaktionen in verteilten EA wird daher immer mehr zur „Commodity“, für die man nicht mehr zahlen muss. Selbst große kommerzielle APM-Hersteller unterstützen mittlerweile Standards wie OpenTracing, OpenCensus oder OpenTelemetry um die Integration von eigenen Messpunkten zu vereinfachen. In diesem Vortrag stelle ich die wichtigsten Open Source APM Tools (u.A. Zipkin, Jaeger, PinPoint, Apache Skywalking) und Standards (OpenTracing, OpenCensus, OpenTelemetry) für EA vor und gebe einen Überblick über die jeweiligen Stärken und Schwächen. Am Ende des Vortrags werde ich darauf eingehen, wie sich die kommerziellen APM Tools von diesen frei verfügbaren Tools abgrenzen.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":41,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"10","audienceId":"1","typeId":"1","locationId":"10","speakerIds":["389335"],"languageId":"1"},{"id":"606536","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"Ein Kind der Cloud. Das wichtigste zu Go aus Java-Sicht","abstractText":"Ich bin Anfang der 90er mit C groß geworden und habe Jahre professionell in Java entwickelt. Software zu bauen wandelte sich mit der Zeit, sie zu betreiben noch viel mehr. Trendthemen rückten andere Programmiersprachen ins Licht. So befeuerte Machine Learning das große Interesse an Python, es entstehen beeindruckende Browser-UIs in JavaScript. Das Cloud-Kind Go behauptet von sich effizient zu sein wie C und sich gleichzeitig anzufühlen wie eine Skript-Sprache.\n\nIn dieser Session zeige ich Go ganz unaufgeregt aus Sicht eines Java-Entwicklers. Zur Sprache kommen etwa Modularisierung und Unit-Tests aber auch webbasierte Services und ihr Bereitstellen als Docker-Image. Ihr könnt danach direkt loslegen. Oder informiert entscheiden, dass Ihr vielleicht doch nichts verpasst habt.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":35,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"1","typeId":"5","locationId":"8","speakerIds":["386370"],"languageId":"1"},{"id":"607405","start":"2021-03-16T17:00:00","end":"2021-03-16T18:00:00","title":"Community Aktivität: JavaLand KungFu","abstractText":"Wie das alte Sprichwort \"Mens sana in corpore sano\" bereits andeutet: Mit Kreuzschmerz ist es schwer sich zu konzentrieren! Erstaunlich daher, wie viele Geeks, Nerds und Hacker sich trotzdem jahrelang mit Berufskrankheiten wie Kopf- und Rückenschmerzen, Stress und Verspannungen herumplagen. Dabei kennt die chinesische Kultur seit Jahrhunderten ein erstaunlich einfaches, wirksames und von jedem, selbst im Büro, anwendbares Gegenmittel: Shaolin Qigong – gymnastische Übungen des Kung-Fu. Aber keine Angst, hier wird nicht gekämpft – wir zeigen dir, wie du mit einfachen Dehnübungen Kopfschmerzen sofort ausschaltest und mit nur 20 Minuten Sport am Tag Rückenschmerzen dauerhaft beseitigst. Als Nebeneffekt winkt dank besserer Konzentration sogar besserer Code!","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":13,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"3","speakerIds":["365399"],"languageId":"1"},{"id":"606500","start":"2021-03-17T15:00:00","end":"2021-03-17T15:40:00","title":"JSON:API für Spring HATEOAS","abstractText":"JSON:API ist ein beliebter Standard zum Erstellen von Hypermedia basierten RESTful APIs. Spring HATEOAS bietet ein abstraktes Repräsentations-Modell für Hypermedia, das verschiedene konkrete Hypermedia-Formate wie HAL, HAL-Forms, Uber, Collection+JSON (und weitere) direkt unterstützt. Kai hat ein Open Source Projekt für die Integration von JSON:API mit Spring HATEOAS gestartet, über das er ausführlich in dieser Session berichtet. Nach einer Einführung in die JSON:API-Spezifikation wird Kai an konkreten Code-Beispielen zeigen, wie man mit den generischen Spring HATEOAS Klassen Repräsentations-Modelle erzeugen kann, die man in beliebige unterstütze Hypermedia-Formate (natürlich auch JSON:API) serialisieren kann. Darüber hinaus wird Kai im Detail zeigen, wie man JSON:API spezifische Features, wie Relationships und „included“ Ressourcen erzeugen kann.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":26,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"1","typeId":"2","locationId":"11","speakerIds":["364385"],"languageId":"1"},{"id":"606699","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"Apache Groovy's Metaprogramming Options and You ","abstractText":"Apache Groovy provides several ways to modify and update programs and classes by means of metaprogramming. Some of this options are available at runtime, some others at compile time, and some are even reachable to other JVM languages. These options allow library and framework authors to design better integrations, prototype new language constructs without grammar changes, deliver powerful and and gratifying DSLs, and more. Come to this talk to discover these options and learn how you can put them to work on your projects.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":17,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"2","audienceId":"3","typeId":"1","locationId":"1","speakerIds":["365313"],"languageId":"2"},{"id":"606703","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"Hitchhiker's Guide To Performance - Reloaded for JDK 16","abstractText":"Wie verschafft man sich in den ersten Stunden, nachdem ein Performance- oder Stabilitätsproblem in der Server-Anwendung erkannt wurde, einen systematischen Überblick. Ohne dabei zulange im Nebel zu stochern und möglichst schnell gezielt in die Detailanalyse und der Optimierung gehen zu können. Wie werden GC-Logs erstellt und analysiert? Wie finde ich Memory Leaks in Heap Dumps, bevor dem Server die Puste ausgeht? Wie werden Thread Dumps interpretiert und existieren eventuell Dead Locks oder Thread-Contention-Probleme? Bremsen eventuell SQL-Hotspots oder Transaktionssperren die Anwendung aus? Die einzelnen Schritte werden anhand von Live-Demos gezeigt und zugleich wird ein Blick auf die Neuerungen in der JVM 16 zum Thema Performance geworfen.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":42,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"5","locationId":"10","speakerIds":["364381"],"languageId":"1"},{"id":"606768","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"Reactive DDD with Message Streaming","abstractText":"Everyone is talking about Event-Driven Architectures and Streaming Data. How many are actually using these successfully? If you haven't started yet, how can you leverage the power of this approach? Even if you have already achieved a measure of success, what can to do to ensure business viability and long-term flexibility in design that responds well to the inevitable on-going change? Also, why stop at Event-Driven when your entire system can be Reactive through Message-Driven architectures, both inside single services and across many collaborating services? \n\nLearn about DDD Context Mapping with Open Host Service and Published Language, and how to integrate using Reactive implementations that transform streaming to well-designed solutions. Employing the right tools will help a lot.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":38,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"11","audienceId":"3","typeId":"1","locationId":"12","speakerIds":["386301"],"languageId":"2"},{"id":"607440","start":"2021-03-17T16:00:00","end":"2021-03-17T17:00:00","title":"Community Aktivität: 4 Kids - wie wir Kindern programmieren näherbringen","abstractText":"Erfahre aus der Insider-Perspektive mehr über verschiedene Formate und Initiativen im Bereich der Nachwuchsförderung. Du findest die Idee spannend, Kindern und Jugendlichen spielerisch die Programmierung näher zu bringen, weißt aber nicht wie, wo oder was benötigt wird? Du suchst Gleichgesinnte zum Erfahrungsaustausch? Dann bist du hier genau richtig! Wir berichten von unseren eigenen Erfahrungen und greifen zudem auf Erfahrungsberichte zum Thema Remote-Workshops aus unserem Netzwerk von Lehrern, Eltern und aktiven Personen zurück.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":12,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"3","speakerIds":["369728","377915"],"languageId":"1"},{"id":"606390","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"AI on Quarkus: I love it when an OptaPlan comes together","abstractText":"Forget about Machine Learning. Planning optimization is the most profitable AI technology on this planet.\n\nThe world is full of planning challenges, such as vehicle routing problems, maintenance scheduling and employee rostering. Find the quickest routes to visit n locations with k vehicles. Or assign shifts to employees, taking into account skills and availability. Few people realize how much AI algorithms improve those solutions. For example, when telco’s started using OptaPlanner to plan their fleet of technicians, many expected a driving time reduction of 1-2%. It was 25%. In some cases, that saves hundreds of millions of dollars and millions of kilograms of CO² emissions, every year.\n\nIn this session I’ll show you how to code a highschool timetabling application, with Quarkus and OptaPlanner. It ‘ll generate the perfect lesson schedule, for both students and teachers, taking into account hard and soft constraints.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":18,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"3","typeId":"2","locationId":"10","speakerIds":["368607"],"languageId":"2"},{"id":"606623","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"Dream-Team Jakarta EE + MicroProfile","abstractText":"Enterprise-Anwendungen müssen kleiner werden. Die Zeit großer Monolithen ist für viele vobei - Microservices versprechen kürzere Releasezyklen und leichtere Innovation. Wer nun der Meinung ist, dass das mit Jakarta EE nicht geht, liegt falsch. MicroProfile ergänzt das Serverangebot um Dinge, die im verteilten Cloud-ready-Umfeld benötigt werden. Konfiguration und Überwachung werden damit ebenso zur Kleinigkeit wie fehlertolerante Kommunikation zwischen Services. Mit MP 4.0 kommen u. a. Reactive Messaging und GraphQL hinzu. Cool ist zudem, dass das Ganze sowohl mit klassischen Servern wie WildFly oder Open Liberty funktioniert, aber auch mit Frameworks wie Quarkus implementiert werden kann.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":19,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"3","typeId":"2","locationId":"7","speakerIds":["355102"],"languageId":"1"},{"id":"606323","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"SSL/TLS for Mortals","abstractText":"Using SSL/TLS the right way is often a big hurdle for developers. We prefer to have that one colleague perform \"something with certificates\" because he/she knows how that works. But what if \"that one colleague\" is enjoying their vacation and something goes wrong with the certificates?\n\nIn this session, we'll take a close look at secure communication at the transport level. Starting with what exactly SSL and TLS is, we'll dive into public/private keys, and signing. We'll also learn what all this has to do with an unfortunate Dutch notary. Of course, there'll be plenty of practical tips & tricks, as well as demos. \n\nAttend this session to become \"that one colleague\"! A PhD in math is not required; experience with assembling furniture can come in handy.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":41,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"5","audienceId":"3","typeId":"1","locationId":"7","speakerIds":["382169"],"languageId":"2"},{"id":"606488","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Todesursache: Hibernate","abstractText":"Hibernate wurde seit Jahren auf die größtenteils automatische Speicherung von Daten und das Laden ganzer Objektgraphen optimiert. Man sollte also annehmen, dass man die meisten Persistenzprobleme alleine durch die Verwendung von Hibernate vermeidet.\n\nDabei ist es gar nicht so schwer seinem Projekt mit ... oder sollte ich besser sagen \"Dank Hibernate\" ... den Todesstoß zu versetzen.\n\nAus praktischer Erfahrung zeige ich in diesem Vortrag, wie man:\n- mit nur einer Annotation die halbe Datenbank löschen kann,\n- die Persistenzlogik so implementiert, dass sie garantiert keiner der Kollegen versteht,\n- die Verwendung der Entitäten in Clientanwendungen zuverlässig verhindert und\n- ganz ohne eigenen Code und Annotationen die Datenbank durch tausende Abfragen in die Knie zwingt.\n\nWer schon immer mal ein Projekt mit der Hilfe von Java's beliebtestem OR-Mapper zum Scheitern bringen wollte, sollte sich diesen Vortrag nicht entgehen lassen!","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":68,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"3","typeId":"1","locationId":"12","speakerIds":["369887"],"languageId":"1"},{"id":"606615","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"Aus der Rubrik \"Spaß mit Microservices\": Transaktionen","abstractText":"Spendiert man jedem Microservice seine eigene Datenbank (Database-per-Service-Pattern), hat man irgendwann unweigerlich das Problem verteilter Businesstransaktionen. Die gute alte DB-Transaktion fällt per Definition aus dem Rennen. Lässt sich also aus fachlicher Sicht ganz auf Transaktionen verzichten? In vielen Fällen ist das durchaus möglich. Als Alternative zur Sicherstellung Service-übergreifender Datenkonsistenz bietet sich u. a. eine Realisierung auf Basis mehrerer lokaler technischer Transaktionen an, auch Saga-Pattern genannt. Die Session führt in die Theorie des Saga-Patterns ein und zeigt seine praktische Verwendung an verschiedenen Beispielen.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":72,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"3","typeId":"1","locationId":"1","speakerIds":["371813"],"languageId":"1"},{"id":"606667","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"AOT or JIT: Faster Startup or Faster Code?","abstractText":"Microservices have become a prevalent architectural approach to developing applications.  Moving from a monolithic application to multiple container-based services has many advantages.  One of the largest is dynamic scalability; spinning up and shutting down instances of services to adapt to dynamic loads is very cost-effective in a public cloud environment.\n\nFor JVM-based applications, running in a managed environment using JIT compilation, this provides additional challenges.  Primarily, this is around the time required for a service to warm up and reach the optimum level of performance.  To address this, we have seen various approaches such as the Graal VM and Quarkus that use an AOT approach rather than JIT compilation.\n\nIn this session, we will explore the pros and cons of both approaches to help in understanding the tradeoff between initial performance and overall performance.  At the end of the session, you will have a clear idea of how to approach your Java microservice design from the AOT and JIT perspective.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":11,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"1","locationId":"13","speakerIds":["357053"],"languageId":"2"},{"id":"606777","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"Newcomer: Quest: \"G1 Full GCs\" aus den Tagebüchern eines DevOps","abstractText":"Ein Abenteurer wird gesucht! In der Stadt Eventim sucht die Stadtverwaltung eine Lösung für ein Phänomen: Antworten an Händler kommen in der Regel innerhalb von Millisekunden an, manchmal dauert dies jedoch mehrere Sekunden. Erste Hinweise weisen darauf hin, dass die Java Garbage Collection der Auslöser ist.\n\nGarbage Collector in Java ist für viele Entwickler ein Punkt, der einfach nur stattfindet und worüber man sich keine weiteren Gedanken macht. Er räumt alte Objekte aus dem Speicher, ohne dass man davon viel mitbekommt.\n\nSeit Java 9 gibt es jedoch den Standard G1. Der G1 Garbage Collector ist darauf ausgelegt, nach Möglichkeit die Arbeit der JVM nicht lange anzuhalten. Im dem Normalfall sollten keine \"Full Garbage Collections\" stattfinden. Wenn sie doch stattfinden, beginnt die Suche nach der Ursache.\n\nIn dieser Session erzähle ich euch von einer epischen Quest in der EVENTIM-Plattform: \"Finde die Auslöser der Full GCs und hindere den Bösewicht daran, dass einzelne Händlern auf ihrer Reise angehalten werden. Belohnung: 400 Erfahrungspunkte und die Händler werden dir wohlgesonnen sein.\"\n\nDabei berichte ich, wie die Anzahl der Full GCs auf null reduziert werden konnte, welche Punkte für die Erfüllung dieser Aufgabe Beachtung fanden, welche Techniken verwendet wurden und welche Fallstricke es gab. Abschließend werde ich auf die Konfigurationsoptionen des G1 eingehen.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":25,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"3","locationId":"9","speakerIds":["386266"],"languageId":"1"},{"id":"606912","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Newcomer: Der Hase und der Igel: Technische Gründe für schlechte Entwicklungsperformance","abstractText":"Der Startup-Prozess klassischer Java Enterprise Applikationen verhält sich wie der Hase. Er läuft und läuft und läuft und braucht trotzdem sehr lange um das Ziel zu erreichen. Egal ob Spring oder JEE. Der Grund dafür ist eine spezielle Art der Metaprogrammierung, die von den meisten Frameworks verwendet wird. Aber warum eigentlich? Was können wir da besser machen? Was ist eigentlich Metaprogrammierung? Was hat Quarkus damit zu tun? Und wäre es nicht möglich, wie der Igel, den Hasen am Ziel mit einem „Ich bin schon da“ zu begrüßen?  In diesem Talk möchte bei \"null\" anfangen, grundlegend erläutern was Metaprogrammierung eigentlich ist und den aktuellen Stand der Industrie in Bezug auf Metaprogrammierung in Java erläutern, alternativen aufzeigen und vergleichen.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":70,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"1","typeId":"3","locationId":"9","speakerIds":["387954"],"languageId":"1"},{"id":"606394","start":"2021-03-17T15:00:00","end":"2021-03-17T15:40:00","title":"Pattern Matching: From Small Enhancement To Major Feature","abstractText":"At first it seemed to be just a small enhancement: the addition of \"Pattern Matching for instanceof\" (JEP 305) in Java 14. No more unnecessary casting after an `instanceof`, that ought to save us a few seconds a day! However, upon further investigation you'll quickly discover that pattern matching is not just an enhancement, but rather a vital puzzle piece in the grander scheme of things.\n\nWhy were switch expressions added to Java, for example? To make them support pattern matching in a later release! And why did Java 14 bring us records and will Java 15 contain sealed types? Because they could work really well with pattern matching in a later release! These new concepts are the foundation upon which advanced pattern matching features will be built.\n\nSo attend this session to get all caught up! You'll hear about type patterns, deconstruction patterns, nested patterns and even how pattern matching could improve serialization in the future. Live coding included, of course!","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":31,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"2","locationId":"10","speakerIds":["371568"],"languageId":"2"},{"id":"606448","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"Es muss nicht immer Kubernetes sein","abstractText":"In vielen größeren Institutionen gibt es noch jede Menge Software, die eher monolithisch aufgebaut ist, die häufig in Applikation-Servern auf dedizierten virtuellen Maschinen von einem eher klassisch aufgestellten und organisatorisch separierten IT-Betrieb betrieben wird. In Fachzeitschriften, Online-Artikeln und Konferenzen wird vorgeführt, wie einfach es doch ist, einen Hello-World Spring Boot Microservice mit mehreren Instanzen auf Kubernetes zu deployen. Doch zurück im Unternehmen wird klar: sollte man es tatsächlich schaffen, alle notwendigen Personen davon zu überzeugen, ab sofort Kubernetes einzuführen, wird das für einen meist auch personell am Limit arbeitenden IT-Betrieb schnell zu einem Projekt mit vermutlich 1-2 Jahren Laufzeit (je nach Erfahrung), mit möglichen Seiteneffekten wie reduzierter Handlungsfähigkeit für das laufende Geschäft und dem Zurückstellen anderer Modernisierungsmaßnahmen. In diesem Vortrag werden wir die sich kontinuierlich entwickelnde (evolving) Architektur einer Anwendungslandschaft hin zu Cloud Native betrachten und dabei (OpenSource) Werkzeuge kennen lernen für die schrittweise Anpassung der on-premise Infrastruktur, ohne Kubernetes.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":49,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"3","typeId":"4","locationId":"7","speakerIds":["365736"],"languageId":"1"},{"id":"606639","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"Modernes Frontend-Tooling für Java-Entwickler","abstractText":"Die meisten Java-Entwickler kennen sich in ihrer gewohnten Welt bestens aus. Da gibt es die JVM, den Compiler, Maven oder auch Gradle und vielleicht noch Spring Boot, Tomcat oder Wildfly als Ausführungsumgebung. Im JavaScript-Universum ist allerdings alles anders. Da gibt es Node.js, NPM oder Yarn, Webpack mit einem Transpiler wie Babel, einen Linter, Prettier und vieles mehr. Eine fremde Welt, von der man als Neuling schnell überfordert sein kann. Dabei ist modernes Frontend-Tooling kein Hexenwerk. Es gibt viele Parallelen zur Java-Welt, aber auch einige wichtige Unterschiede. Und wenn man sich erst einmal darauf einlässt, kann man sich in den Development-Workflow schnell verlieben. Dieser Talk gibt einen Einblick in die wichtigsten Tools der JavaScript-Community, zieht Vergleich mit der Java-Welt und demonstriert anhand eines konkreten Beispiels, wie einfach sich die Toolchain in ein klassisches Maven-Projekt integrieren lässt.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":68,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"13","audienceId":"1","typeId":"5","locationId":"8","speakerIds":["368392"],"languageId":"1"},{"id":"606428","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"Ich packe meinen Testtoolkoffer und nehme mit...","abstractText":"Tests sind das Hauptkommunikationsmittel von Entwicklern über den Code. Mit Tests kommuniziert man auch noch mit dem nächsten Entwickler, nachdem man das Projekt verlassen hat. Tests sind eine lebende Spezifikation des Codes, den sie testen. Man sollte sie mindestens so sauber halten, wie den Produktionscode - wenn nicht sauberer. \n\nDoch wer hat die Aussage \"Das kann man nicht testen\" oder \"Den Test kann man nicht schöner schreiben\" noch nicht gehört? Oft basieren diese Aussagen darauf, dass man den Großteil des Arsenals der Testwerkzeuge, die uns Java-Entwicklern inzwischen zur Verfügung stehen, noch nicht kennt.\n\nNeben JUnit, gibt es viele weitere Testwerkzeuge, die den Entwickleralltag beim Testschreiben vereinfachen können. Dieser Vortrag gibt einen Überblick über nicht so bekannte Features von JUnit 5 und stellt nicht so bekannte Testwerkzeuge vor, mit denen das Schreiben von Tests wieder Spaß macht.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":62,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"5","locationId":"1","speakerIds":["389305"],"languageId":"1"},{"id":"606760","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"Help Keep the Internet Safe with WebAuthn","abstractText":"Account takeovers continue to be part of major cyber security incidents. Decades of password education haven't helped, and probably made things worse. Email and password lists numbering into the billions have shown up on the dark web. Phishing campaigns have become more targeted and more effective than ever. Sometimes it seems like we're losing the battle.\n\nThere is hope, though! The WebAuthn protocol provides a stronger, easier way for users to authenticate themselves. It uses secure hardware and asymmetric cryptography to provide a strong addition to passwords, or a complete replacement. Best of all, it's easy to implement, and already supported by services you're using today.\n\nCome to this talk to learn how WebAuthn works, how you can use it to protect yourself, and how to add support to your software. WebAuthn is a powerful tool to help keep the Internet safe, but it's up to us to use it.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":35,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"5","audienceId":"1","typeId":"1","locationId":"12","speakerIds":["382495"],"languageId":"2"},{"id":"606315","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Jakarta EE 9 and Beyond","abstractText":"Jakarta EE 9 is out! This is the second release of Jakarta EE since the transition from the Java Community Process (JCP) to the Eclipse Foundation. In this session, we will go through every aspect of Jakarta EE 9 and how this release lowers the barriers of entry, eases the migration, and lays the foundation for a platform for future innovation.\n\nWe will also look ahead towards what future releases may bring. The session includes a demo including converting from the javax. to jakarta. namespace as well as looking at available implementations.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":24,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"1","typeId":"2","locationId":"13","speakerIds":["364707"],"languageId":"2"},{"id":"606412","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"Was die GraalVM nativ schon so alles kann","abstractText":"Die GraalVM ist der neue Stern am Java-Himmel. Nach eigenem Bekunden\n\"a universal virtual machine for running applications written in\nJavaScript, Python, Ruby, R, JVM-based languages like Java, Scala,\nKotlin, Clojure, and LLVM-based languages such as C and C++.\"\n\nGraalVM kann aber noch mehr, nämlich native Executables erzeugen.\nDa Java aber eine hochdynamische Sprache ist, können viele\nSpracheigenschaften (Reflection, Klassen zur Laufzeit nachladen,\nDynamic Proxy, Invoke Dynamic, ...) nicht so einfach zur Compile-Zeit\numgesetzt werden, zumindest nicht Out of the Box.\nDamit ist die GraalVM mit ihren nativen Images KEINE Java-VM!\n\nDass man trotzdem tolle Dinge mit der GraalVM machen kann, beweist\nQuarkus, ein relativ neues Projekt von Red Hat, das aber schon\nviel Aufmerksamkeit erregt hat. Es kann neben einer Standard-VM\nalternativ auch die GraalVM verwenden, um damit dann native\nExecutables zu erzeugen.\n\nIm Talk schauen wir uns hautpsächlich an, was die GraalVM in Bezug\nauf das Erzeugen nativer Executables schon so alles kann, aber auch,\nwas sie (wahrscheinlich) nie können wird.\n\nNach dem Talk kann der Teilnehmer bewerten, ob er sich die GraalVM\nim Detail anschauen sollte oder doch lieber bei seinem geliebten\nOpen-JDK (o.ä.) bleibt.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":63,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"1","typeId":"5","locationId":"1","speakerIds":["356530"],"languageId":"1"},{"id":"606524","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Backlog Refinement: Motor für Change Management","abstractText":"Für Jeff Sutherland, Mitbegründer von SCRUM, ist das Backlog Refinement das Rückgrat eines funktionierenden Scrum Teams. Doch wie kann dieses wichtige Events erfolgreich etabliert werden? Der Scrum Guide widmet den Event lediglich einen kurzen und knappen Absatz.\n\nBei der Entwicklung einer disruptiven Lösung, einer automatisierten Dispositionssoftware für Bodenverkehrsdiensten an einem großen Flughafen, bestätigte sich Sutherlands Theorie. Das Event wurde eines der wesentlichen Erfolgsfaktoren für die Umsetzung des agilen Projekts. Und das obwohl die Voraussetzungen für das Projekt sehr herausfordernd waren:  \n\n•\tein komplexes Produktportfolio mit vielen Abhängigkeiten zwischen den unterschiedlichen Lösungen\n•\teinem Geschäftsführer als Product Owner, der dem Team nur Teilzeit zur Verfügung stand\n•\tkeine Möglichkeit Business Analysten einzubinden\n•\tExpertenwissen, welches nur in den jeweiligen Silos vorhanden war\n•\teiner knappen Vision und keine ausformulierten Anforderungen an das Produkt\n•\tdie Gefahr am Flughafen durch Kettenreaktionen bei Verspätungen den Transport von Passagieren am gleichen Tag zu gefährden oder wichtige Slotzeiten für den Luftraum zu verlieren\n•\teine große Anzahl von kritischen Stakeholdern \n\nNils Hyoma wird im seinen Vortrag zeigen wie sein Team dank des Refinements mit den komplexen Aufgaben zurechtgekommen ist. Hierbei wurden etwa nach und nach kritische Stakeholder gezielt integriert, die Software-Entwickler in die Verantwortung für Anforderungsermittlung genommen sowie durch Kollaboration mit anderen Teams Abhängigkeiten aufgelöst und Releases koordiniert. \n\nDas geplante und strukturierte Event wurde neben der Entwicklung der Software auch zum Antrieb des Change-Managements sowie der agilen und digitalen Transformation genutzt.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":31,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"3","typeId":"4","locationId":"7","speakerIds":["389310"],"languageId":"1"},{"id":"606675","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"Microservices dokumentieren mit Antora","abstractText":"Lasst uns mit einer gewagten These starten: eigentlich möchte jeder in einem IT-Projekt dokumentieren, und alle sehen fehlende Dokumentation als Problem. Trotzdem scheint es so, als ob mit wachsendem Projekt die Dokumentation immer weniger, älter und einfach unpassender wird. Warum tun wir uns damit so schwer, wo es doch fast jedes Projekt auf Github schafft, ein brauchbares Readme zu haben?\n\nIst ja klar, Enterprise-Grade-Doku passt nunmal in kein Readme! Stimmt das wirklich?\n\nIn dieser Session möchte ich euch Antora vorstellen. Dieses Tool hilft euch dabei, Doku entspannt in euerer Lieblings-IDE mit Asciidoc zu schreiben, statt fluchend vor Word zu sitzen. Und das auch, wenn das Projekt mal komplexer wird: Antora stellt dabei aus vielen verschiedenen Repositories wieder eine zusammenhängende und bestens verknüpfte Dokumentation zusammen.\n\nNach einer kurzen Einführung von Asciidoc und Antora zeige ich, wie sich ein Konzept nach Arc42 für ein komplexeres System mit mehreren Microservices und Frontends, aufgeteilt auf verschiedene Repos generieren lässt. Dazu gibt's Tipps, wie ihr im Team am besten vorgeht. Außerdem werfen wir einen Blick auf das Extension-Ökosystem um zu sehen, was noch so alles machbar ist.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":41,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"10","audienceId":"3","typeId":"1","locationId":"11","speakerIds":["370059"],"languageId":"1"},{"id":"607417","start":"2021-03-16T13:00:00","end":"2021-03-16T15:00:00","title":"Community Aktivität: WomenInTech Panel","abstractText":"It's an understatement how 2020 and even 2021 have changed our lives, and sadly some of our colleagues specially women had to face increase challenges. Java Champions, Ground Breakers Ambassadors and Luminaries of our Industry shared some of their career stories, concerns, ideas, suggestions in how to improve this industry and our approach to Women In Tech.\n\nThis is not only a space for Women In Tech but for all of us, because we all contribute to the Industry actively!\n\nThere will be videos a panel and a space to network! Don't miss it.\nTech needs your participation!!","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":3,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"6","speakerIds":["381314"],"languageId":"1"},{"id":"606520","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Umzug in der Serverless-Welt","abstractText":"Java war immer ein Hort der Portierbarkeit, aber dieser Status ist in Gefahr. In der serverlosen Welt versuchen ruchlose Betreiber alles um den Kunden durchproprietäre APIs und Tools in der eigenen Plattform gefangen zu halten. In diesem Vortrag werden Strategien, Patterns und Tools gezeigt, die helfen die eigenen Anwendungen portierbar zu halten, vom Quellcode bis zum Deployment. Zum Beweis der Machbarkeit coden wir live eine serverless Demoanwendung und deployen diese in zwei verschiedenen Clouds.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":47,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"3","typeId":"1","locationId":"13","speakerIds":["375163"],"languageId":"1"},{"id":"606587","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"Hey Google, bake me a new Java GitHub repository!","abstractText":"In this session, I will create a [voice-controlled bot](https://assistant.google.com/) that will allow Google or Alexa to create new Github repositories automatically! We will be using the Github API as an example of use case to demonstrate how voice controlled assistants can be useful for us developers.\n\nAfter a short introduction to the GitHub API and how voice assistants work, we will dive head-first into my IDE and create a bot together.\n\nWe will live code our bot using Java code together, explaining each step of the way.\nWe will also see the limitations, and how to further improve our bot.\n\nAt the end of this talk you will:\n\n- Be able to create a simple voice assistant application.\n- Understand how to improve it in the future\n- Have your fingers itching to try more at home :).","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":12,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"1","typeId":"4","locationId":"10","speakerIds":["389373"],"languageId":"2"},{"id":"606643","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"Microservices sind komplex? Monolithen erst recht!","abstractText":"Microservices stehen mittlerweile in dem Ruf, eine übermäßig komplexe Architektur zu sein. Darüber vergessen viele, dass Monolithen nun auch nicht immer einfach sind und dass Architekturen von den Zielen abhängen. Dieser Vortrag zeigt, worauf es bei Architektur-Arbeit wirklich ankommt und dass Microservices durchaus eine einfache Lösung sein können. So erläutert die Präsentation, wie die Architektur für das nächste Projekt sinnvollerweise aussehen kann - oder wo die eine bestehende Architektur vielleicht noch verbessert werden kann.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":59,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"1","typeId":"1","locationId":"12","speakerIds":["368565"],"languageId":"1"},{"id":"606752","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"Newcomer: Build Your Own Self Driving Vehicle with Java","abstractText":"Selbst fahrende Autos werden wohl bald eine Selbstverständlichkeit sein. Zum Thema \"self driving vehicle\" finden sich auf GitHub aktuell etwa 1000 Projekte. Für die nötige Abstimmung von Software, Elektronik und Mechanik investiert die Industrie Milliarden. Falls du nicht an einem der großen Projekte beteiligt bist, bleibt deine Neugier jedoch auf der Strecke.\n\nMit dem Java-Projekt rc-dukes auf GitHub kannst du dir den Traum vom selbstprogrammierten vollautonomen Fahrzeug bereits heute erfüllen. Ein Raspberry Pi liefert hier Kamerabilder und ermöglicht die Fernsteuerung. OpenCV (Open Source Computer Vision Library) wertet die Bilder aus, damit Starten, Stoppen und Spurtreue erfolgen. Und mit Vert.x kommunizieren Auto, Steuerrechner und Fernbedienungs-App miteinander. Teilnehmer unserer Softwarearchitektur-Trainings haben seit einigen Monaten Spaß daran, Architekturthemen anhand dieses Beispiels zu beleuchten.\n\nIn diesem Vortrag erfährst du von den spannenden Entscheidungen, die in diesem Projekt den Unterschied machen.\nAm Anfang stand beispielsweise eine schlimme Verletzung der \"konzeptionellen Durchgängigkeit\". Die \"Zugänglichkeit\"\nist für die weitere Planung relevant. Und auch die in Industrieprojekten wichtigen Themen Sicherheit, \"Open-World\nProblem\" und Ethik werden erläutert und in Bezug zum \"Modellprojekt\" gesetzt.\n\nWolfgang zeigt dir, wie du mit geringem Aufwand in das Thema einsteigen kannst. Du erfährst, wie Java den Raspberry PI,\nVert.x und OpenCV zusammenbringt. Und du kannst Wolfgangs mitgebrachte Fahrzeuge live erleben. Selbst ausprobieren\nist das Ziel – auf der Konferenz oder danach.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":23,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"1","typeId":"4","locationId":"9","speakerIds":["358673"],"languageId":"1"},{"id":"606904","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"Newcomer: Micronaut und Spring - Konkurrenz oder Koexistenz?","abstractText":"Die Faszination um neue Java-Frameworks wie Micronaut ist ungebrochen. Der Einstieg ist leicht und mit wenigen Handgriffen hat man eine lauffähige Anwendung, vom Rest-Endpunkt bis zum Datenbankzugriff. Auch zum ersten GraalVM Native Image ist der Weg nicht mehr weit: Schnell hat man das Gefühl auf der Java-Überholspur zu sein.  Im Alltag bekommt man nur leider viel zu selten die Gelegenheit eine Anwendung ganz neu ohne Altlasten aufzubauen. Die Vision von einer reinen Cloud orientierten Anwendungslandschaft ist zwar reizvoll, aber für die meisten Unternehmen noch in weiter Ferne.  Und genau deshalb möchten ich unter die Lupe nehmen, wie gut sich Micronaut in bestehende technische und organisatorische Strukturen integrieren lässt. Ausgehend von typischen Spring-Anwendungen möchte ich die Aspekte Wissenstransfer (Wie kann ich vorhandenes Wissen transferieren?), Infrastruktur (Wie gut kann kann ich vorhandene Infrastruktur verwenden?) und Migrationspfade (Wie kann ich aus einer Spring-Boot-Anwendung eine Micronaut-Anwendung machen?) beleuchten.  Wie gut funktionieren Micronaut und Spring im Zusammenspiel und welche Hürden gibt es in dieser Konstellation? Ich möchte einen Weg finden diesem Framework eine Chance zu geben, ohne auf bewährte Dinge verzichten zu müssen und der Cloud-optimierten Anwendungslandschaft Schritt für Schritt näher zu kommen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":33,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"3","locationId":"12","speakerIds":["389617"],"languageId":"1"},{"id":"606432","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"Der effektive Entwickler","abstractText":"Wir sind agil, wir arbeiten in cross-funktionalen Teams und nutzen modernste Entwicklungstools. All diesen Methoden und Technologien sollten uns doch eigentlich effektiver machen, oder? Arbeitest du wirklich an den wichtigen Dingen? Ist die Balance zwischen Entwicklungsgeschwindigkeit und Codequalität optimal? Hast du manchmal ein schlechtes Gewissen, dass du mehr über die neuste Technologie wissen müsstest?\n\nEffektive Entwickler schreiben nicht nur sauberen, einfachen und robusten Code. Sie identifizieren die Dinge, die das Produkt wirklich voranbringen und nehmen sich Zeit zum Lernen und Ausprobieren. Erfahre wie solche Entwickler Ihren Arbeitsalltag optimieren, Automatisierung sinnvoll einsetzen, mehr Zeit für konzentriertes Arbeiten haben, Meetings effektiver gestallten und vieles mehr.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":87,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"3","typeId":"1","locationId":"1","speakerIds":["382192"],"languageId":"1"},{"id":"607502","start":"2021-03-16T15:00:00","end":"2021-03-16T16:00:00","title":"Community Aktivität: Setup Troubleshooting für Android-Workshop","abstractText":"Wir bereiten unser System gemeinsam auf den Workshop vor. Für vorbereitete und fertig eingerichtete Teilnehmer beginnt die Veranstaltung um 16 Uhr. Ab 15 Uhr sind alle willkommen um Schwierigkeiten bei der Einrichtung zu lösen. \n\nVoraussetzungen:\nEine Teilnahme am Workshop ist nur möglich, wenn zuvor die folgenden beiden Schritte bereits durchgeführt wurden.\n\n- Download Android Studio and SDK tools: https://developer.android.com/studio\n- Build your first app: https://developer.android.com/training/basics/firstapp\n\nSolltet Ihr beim zweiten Schritt die \"Build your first app\"-Aufgabe vollständig abgeschlossen haben, so seid Ihr bereit für die Teilnahme ab 16 Uhr.  Wenn es dabei noch Probleme gab, stehen wir ab 15:00 Uhr im Workshop-Raum zur Verfügung. Wir werden die Probelme dann reihum besprechen und versuchen, diese noch bis 16 Uhr zu lösen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":0,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"6","speakerIds":["386019"],"languageId":"1"},{"id":"606736","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Projekt Fugu (PWAs weitergedacht)","abstractText":"Mit der Definition von Progressive Web Apps (PWA) wurde Web-Applikationen die Möglichkeit gegeben installiert zu werden, offline-fähig zu sein und Push-Nachrichten an den Nutzer zu senden. Projekt Fugu möchte weitere Möglichkeiten hinzufügen und die Lücke zwischen nativen Anwendungen und Web-Applikationen weiter zu schließen.\n\nIn diesem Vortrag schauen wir uns die Inhalte von Projekt Fugu an. Welche Funktionen ( sollen hinzukommen, welche sind bereits jetzt, und vor allem wo nutzbar?\n\nZum Beispiel:\n* Contact Picker API\n* Native File System API\n* User Idle Detection API\n* Web NFC\nusw.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":28,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"13","audienceId":"1","typeId":"2","locationId":"11","speakerIds":["378902"],"languageId":"1"},{"id":"606452","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"Controlling your race with Micrometer and Spring Boot (live coding!)","abstractText":"Imagine that you’re part of a (car) race team. You’re the one behind the screens to control the race and make some tough decisions (like changing the team's strategy).\n\nBut you don’t have the insights (or metrics) about your car, opponents or even the weather. Sounds painful right? But why are we making this mistake when building our software? Why don’t we implement metrics by default?\n\nThese metrics are exposed by REST endpoints (JSON) together with Spring Boot actuator, which can be saved into a database like Prometheus or Graphite. And to visualize the data you can use a tool like Grafana. Pretty interesting right?\n\nIn the demo (live coding!) Ko Turk will show you how to create such applications using Micrometer, Spring Boot and Cloud Foundry as our platform. Ready to win this race with him? Jump in!","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":21,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"1","locationId":"11","speakerIds":["389334"],"languageId":"2"},{"id":"606711","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Live Coding mit Quarkus und MicroProfile","abstractText":"Mit Quarkus buhlt ein ungeheuer spannendes Framework um die Gunst der Entwickler. Es glänzt mit guter Unterstützung von Containern und Kubernetes, sowie einer hohen Produktivität bei der Implementierung neuer Anwendungen. Inbesondere aber unterstützt Quarkus weit verbreitete APIs und Frameworks, wie etwa JAX-RS, CDI oder JPA / Hibernate, so dass Entwickler direkt einsteigen können, ohne sich zunächst neue (proprietäre) APIs aneignen zu müssen. Gleichzeitig wird auch das MicroProfile von Quarkus unterstützt. Es bietet eine ganze Reihe nützlicher APIs für cloudbasierte Anwendungen. Hierzu zählen die Unterstützung von Fault Tolerance, Open API, Health Checks, Metrics oder OpenTracing. Auf Basis von Quarkus implementierte Anwendungen können schließlich mit Hilfe der GraalVM in native Anwendungen übersetzt werden, die innerhalb weniger Millisekunden starten und einen extrem kleinen Speicherverbrauch haben. Die Kombination von wohl bekannten APIs aus Java/Jakarta EE mit den neuen Möglichkeiten des MicroProfile auf einem modernen technischen Fundament macht Quarkus zu einem potentiellen Kandidaten für künftige Projekte. Dies gilt insbesondere auch für solche Teams, die in der Vergangenheit große Investitionen in die Java EE-Plattform getätigt haben und dieses Know-How nun weiterhin nutzen können, um sowohl Bestandsanwendungen zu modernisieren, als auch neue Anwendungen auf Basis zeitgemäßer Technologie zu erstellen. Dieser praxisnahe Talk beleuchtet, wie Quarkus und MicroProfile miteinander kombiniert werden können. Eine Beispielanwendung wird während des Talks live erstellt.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":49,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"3","typeId":"2","locationId":"7","speakerIds":["366601"],"languageId":"1"},{"id":"607434","start":"2021-03-17T17:00:00","end":"2021-03-17T19:00:00","title":"Community Aktivität: Mob-Programming Dojo","abstractText":"Mob-Programming ist eine Methode der agilen Softwareentwicklung, bei der ein ganzes Team zur gleichen Zeit und am gleichen (virtuellen) Ort an der gleichen Aufgabe arbeitet. Lass dir das Mob-Programming-Dojo nicht entgehen und probiere es anhand unserer vorbereiteten Aufgaben selbst einmal aus! Der Workshop richtet sich an Menschen in Software-Entwicklungsteams, die die Form der virtuellen Zusammenarbeit mit Mob-Programming ausprobieren wollen. Es sind dabei keine besonderen Vorkenntnisse nötig. \n\n\nFür vorbereitete und fertig eingerichtete Teilnehmer beginnt die Veranstaltung um 17 Uhr. Ab 16:30 Uhr sind alle willkommen, um sich gemeinsam vorzubereiten. \n\nIhr benötigt für die Teilnahme: \n- Stabile Internetverbindung \n- Kamera und Mikro/Lautsprecher/Headset (hohe Qualität bevorzugt, ggf. durch Feedback bestätigt, ohne Hall und Störgeräusche) \n- git (ca. version 2.25) ausführbar auf der Kommandozeile \n- mob.sh tool installiert und auf der Kommandozeile ausführbar (https://mob.sh/) \n- Java Version min. 11 \n- github-account und folgendes git-repo zum testen ausgecheckt: https://github.com/thmuch/javaland-2021-mob-programming-setup-check\n- In github eingelogged sein und Zugriff auf die Emails des Account erforderlich für Kollaboration \n- IDE deiner Wahl mit dem git-repo eingebunden und lauffähig (Main, Tests, siehe README im Repo) \n- Webbrowser (Empfehlung: chromium basiert) \n- Für die eigentliche Mob-Programming-Session: Zoom-Client in der neusten Version (&gt; version 5.5.x). \n- Bei der Teilnahme über den Browser macht das Teilen des eigenen Bildschirms manchmal Probleme; Für den verwendeten Zoom-Account ist eine DSGVO Zusatznote Vertragsbestandteil.\n- Optional: 2. Bildschirm oder 2. Gerät (Tablet o.ä.) für Miro-Board, Timer, etc.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":3,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"2","speakerIds":["370142","368551"],"languageId":"1"},{"id":"606380","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"Ein Jahr serverless - The good, the bad and the ugly","abstractText":"Ein Jahr Serverlessentwicklung mit der AWS. Da erlebt man viel Neues was Spaß macht, interessant ist und was einen in den Wahnsinn treibt. Alte Überzeugungen über Architektur und Testautomatisierung greifen plötzlich nicht mehr und es entsteht Komplexität wo man sie nicht erwartet hätte. \n\nDieser Talk zeigt, wo und wie wir serverless eingesetzt haben, wo die Erwartungen sich erfüllt haben, aber auch wo es nicht so gut lief und serverless nicht die beste Wahl war. Daraus hervorgegangen sind Schwerpunkte und Best Practises über Staging, Testautomatisierung, Architektur und Komplexitätsbewältigung die vorgestellt und gerne diskutiert werden können.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":43,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"1","typeId":"4","locationId":"8","speakerIds":["386596"],"languageId":"1"},{"id":"606571","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Go Serverless with Azure Functions","abstractText":"Let’s dive into the world of Serverless and give you real world examples of how to get started. We will focus on Azure Functions in Java with its various flavors vanilla java, Spring Boot or Micronaut. We will discuss how to provision, deploy and test them.\n\nIn my demos we will see the ease of local development leveraging from the great integration in Visual Studio Code.\n\nFinally, let’s ship our samples and scale them in Azure.\n\nIf you are tired of server maintenance and want to achieve more with your java functions , don’t miss this session.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":14,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"1","typeId":"2","locationId":"12","speakerIds":["389379"],"languageId":"1"},{"id":"607359","start":"2021-03-16T16:00:00","end":"2021-03-16T17:00:00","title":"Community Aktivität: Podcasting How-To & Q&A am Beispiel vom Developer‘s Journey Podcast","abstractText":"Mit dem Aufkommen von Podcasts ist das Lernen zu einem To-Go-Erlebnis geworden. Seit 2016 beleuchtet der Developer's Journey Podcast die Vielfalt unserer Software-Entwicklerkollegen anhand der faszinierenden Geschichten ihrer Reisen (siehe devjourney.info). Im ersten Teil dieser Community-Aktivität laden wir dich ein, einer Live-Aufnahme des Podcasts beizuwohnen und Fragen zu stellen. Im zweiten Teil werfen wir einen Blick hinter die Kulissen des Developer’s Journey Podcasts: von der Suche nach Gästen und der frühen Kommunikation bis hin zu Audiobearbeitung, Veröffentlichung und Social Media Marketing.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":6,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"3","speakerIds":["386134"],"languageId":"1"},{"id":"606603","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"E2E-Testing von Microservices: eine Hass-Liebe","abstractText":"Microservices sind noch immer in aller Munde. Sie sollen autark entwickelt, ausgeliefert und deployed werden. In der Realität können sie aber fast immer nur in Kombination sinnvoll benutzt werden.\n\nAus der Perspektive des Softwaretesters ist die Sache daher klar: wir wissen aus Erfahrung, dass Softwarekomponenten, die miteinander interagieren, auch integriert getestet werden müssen. Jeder musste sicher einmal die schmerzliche Erfahrung machen, dass es an dieser Stelle nicht genügt, eine einzelne Komponente in Isolation zu testen, um sicherzustellen, dass die Komponenten auch im Zusammenspiel sauber funktionieren.\n\nEin weiterer Vorteil von Microservices besteht in der hervorragenden Tauglichkeit für CI und insbesondere CD. Hier werden sämtliche Teststufen vollständig automatisiert in einer CI/CD-Pipeline durchlaufen. Wenn nun aber die E2E-Teststufe fehlschlägt, dann ist die Auslieferung von allen(!) beteiligten Microservices blockiert, bis die Ursache identifiziert und behoben ist!\n\nAn dieser Stelle zeigt sich der Widerspruch zwischen dem Ziel, über E2E-Tests die Qualität der Software sicherzustellen und dem Ziel, schnell und unabhängig einzelne Komponenten ausliefern zu können.\n\nIn diesem Vortrag teilen wir unsere Erfahrungen im Umgang mit diesem Dilemma aus einem Projekt mit über 200 Entwicklern und einer Microservices-Landschaft mit über 60 Services.\n\nDabei diskutieren wir die Vor- und Nachteile von E2E-Tests für Microservices, die wesentlichen Probleme und Hindernisse, denen wir begegnet sind, welche Lösungsstrategien wir entwickelt haben, und was es für alternative Ansätze gibt, die man bedenken sollte.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":40,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"4","locationId":"11","speakerIds":["389364"],"languageId":"1"},{"id":"606655","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"Tracking Pigeons with OpenCV and DeepLearning","abstractText":"Observing animal behaviour and movement have been fruitful for scientists from different areas. Evolotuinory ecologists are interested in animals’ adaptive evolution of behavioural strategies. Neuroscientists focus on brain-behaviour relationships to investigate how the brain learns new movements or how the brain tells the body to move.\n\nAnciently, in order to quantify animal movement and behaviour, direct observations were made in the field. However direct observations bear several problems. They are not only time-consuming and labour intensive but also tendentious which often leads to difficulty in reproducing the experiments. These issues may be overcome by using a video recording system. Unlike the direct observation which cannot be reanalyzed in the case that the fatigue of the observer, video recording ensures complete and permanent registration of behavioural patterns which happened during the observation time. However, analyzing the video recordings from a traditional point of view with a pencil, paper and stopwatch induced problems like time consumption and human labor.\n\nThe recent technological development in the field of computer vision has allowed researchers to track the animals automatically. With the help of the automated tracking techniques, less time and effort is needed to generate a precise dataset of animal movement and behaviour.\n\nIn this talk I want to show how to easily integrate existing Open Source technologies, such as Python, OpenCV, Seaborn and Jupyter in order to track the movement of pigeons in a labyrinth. As an additional outlook I will showcase the state-of-the-art and Open Source deep learning toolbox DeepLabCut that can be used for markerless pose estimation of animals performing various tasks.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":20,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"1","typeId":"4","locationId":"9","speakerIds":["386376"],"languageId":"2"},{"id":"606715","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"Mastering your Eclipse IDE - Java tooling, Tips & Tricks!","abstractText":"Eclipse IDE provides a lot of powerful features and capabilities. With so much functionality at disposal, many users don't use the full potential of the IDE. To be productive, mastering your IDE is as important as mastering your source code.\n\nIn this session, I will unleash many tips and tricks that will allow you to better use the Eclipse IDE and be more productive in your routine development tasks. I will cover various topics from efficiently organizing your workspace content to navigating, coding and debugging. This will include a glimpse of the cool new features added in the recent releases of Eclipse IDE.\n\nWith faster Java releases, it is an exciting time to be a Java developer. I will show you how the new tooling features in Eclipse IDE help you in making your experience more convenient and pleasant while working with the new Java versions.\n\nDuring this talk, you will have many \"Ah, I didn't know Eclipse can do that!\" moments. Some of the examples include:\n\n- Determining who last modified a line of code and when\n- Plug-in spies\n- Bookmarks\n- Grouping, sorting and sharing breakpoints\n- Trigger points and trace points\n- Finding the functional method from lambda expressions and method references\n- Quickly enabling preview features and working with latest Java constructs like records\n\nCome and learn about the best Eclipse IDE capabilities that you might not be knowing yet. There will be something new for everybody.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":29,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"10","audienceId":"1","typeId":"5","locationId":"13","speakerIds":["386390"],"languageId":"2"},{"id":"607392","start":"2021-03-16T18:00:00","end":"2021-03-16T19:00:00","title":"Community Aktivität: Meet the Libs","abstractText":"Tauscht euch über Bibliotheken und Open-Source-Software aus. Welche Bibliothek verwendet ihr gerade im Projekt? Habt ihr besondere Open-Source-Software zu empfehlen? Im Meet-the-Lib könnt ihr mit Gleichgesinnten über diese Themen fachsimpeln. Natürlich kann im Anschluss auch gemeinsam programmiert werden.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":10,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"5","speakerIds":["366617"],"languageId":"1"},{"id":"606343","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"The Path Towards Spring Boot Native Applications","abstractText":"In this talk, Martin will share the latest status of the ongoing work performed by the Spring team to allow running Spring Boot applications as GraalVM native images for instant startup and low memory consumption. He will talk about how to run various types of Spring Boot applications as native executables, what that means for real-world applications, and the impact that this powerful combination of Spring Boot and GraalVM technology could have from several different perspectives (including running Spring Boot apps in the cloud, in scale-to-zero environments, and the environment). He will finish the presentation by sharing a glimpse of the roadmap for 2021.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":55,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"3","typeId":"2","locationId":"1","speakerIds":["382598"],"languageId":"2"},{"id":"606440","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"Mutants to the rescue: How effective are your unit tests?","abstractText":"We write tests to tackle bugs, verify functionality and to ease maintenance.\nUsing code coverage as our metric we might deem ourselves safe and our tests flawless.\nBut how can we be sure that our tests are okay? The fact that tests cover the code doesn't imply the code is working correctly.\nA missing assertion can be an opening for a plethora of bugs!\n\nIn this talk we will enter the world of mutation testing.\nBy generating mutants, i.e., faulty versions of your code, we measure how tests perform in detecting bugs.\nWe will cover mutation tools, how they work, how to get started and how to integrate it in your builds.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":44,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"1","locationId":"13","speakerIds":["386312"],"languageId":"2"},{"id":"606607","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"Es kommt drauf an!","abstractText":"Unser Job als Entwickler oder Entwicklerin ist schon schwierig: Ständig hören wir von neuen Hypes mit all ihren Vorteilen. Oft haben wir diese direkt in unseren Projekten eingesetzt und wunderten uns dann, dass es an allen Ecken und Enden knarzt. Wenn wir das doch nur schon vorher gewusst hätten! Dabei ist die Frage, ob ein Hype auch zu unserer Art des Entwickelns passt, eigentlich ganz einfach zu beantworten: Es kommt drauf an!\n\nIn diesem Vortrag durchleuchten wir das „Es kommt drauf an!“ etwas genauer. Dazu nutzen wir das Denk- und Kommunikationswerkzeug „Wardley Maps“. Wardley Maps sind evolvierende Strategielandkarten, welche ein kontextspezifisches Situationsbewusstsein für die eigenen Softwaresysteme schaffen. Sie bieten uns einen Ort zum Diskutieren: Welches Entwicklungspraktiken wollen wir einsetzen? Welches Vorgehensmodell ist das Richtige? Auf welche Technologie sollen wir umstellen? Was bauen wir selbst und was holen wir uns woanders?\n\nMit Wardley Maps erstellen wir für diese Art von Fragen Landkarten, um unsere eigene Situation besser verstehen zu können. Somit lernen wir unser eigenes „Es kommt drauf an!“ besser kennen, um in Zukunft weniger oft den letzten Hypes zu verfallen.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":46,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"1","locationId":"7","speakerIds":["376291"],"languageId":"1"},{"id":"606347","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"Java Modules in practice with Spring Boot","abstractText":"Java Modules have been around for a little while now and most of us know deep inside that we need to start doing something with them. Yet most developers are waiting for the momentum to take off. You've probably heard the theory a couple of times already, but putting it into practice sounds like mummy forcing you to eat your veggies. Actually I love my veggies, so I’ll gladly help you out here. \nIn this session I will demonstrate how you can start using the power of modules in your own application. A Spring Boot application. Because despite the adoption in libraries is not yet great, you can already perfectly make your own application modular.\nI will guide you through a step-by-step approach to making your application modular. No magic or module-fu is required to achieve this result. Just everyday technologies we have at our disposal in the Java ecosystem. And as a bonus, it even works with Kotlin....","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":47,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"3","typeId":"5","locationId":"10","speakerIds":["382191"],"languageId":"2"},{"id":"606756","start":"2021-03-16T12:00:00","end":"2021-03-16T12:40:00","title":"Newcomer: Real-World Event-Sourcing mit Java und Axon","abstractText":"Ereignisse beschreiben sehr exakt, welche Fachlichkeit passiert ist. Im Rahmen von Domain Driven Design spielen sie\ndaher eine grundlegende Rolle. Umso wichtiger wäre es, dass die Programmiersprache diese möglichst elegant abbilden kann.\nLeider bietet Java out of the box wenig Sprachmittel.\n\nHier kommt das Open Source Framework Axon ins Spiel. Am Beispiel eines konkreten Projekts bei der LVM Versicherung wird der Einsatz in einem Self-contained System beschrieben. Im Rahmen des Vortrags stellen wir das auf Basis von Java und Axon entwickelte System vor.\n\nTheoretisch kann man viel zu DDD und Event-Sourcing lesen. Wir erklären die echten Herausforderungen beim konkreten Einsatz in großen Projekten.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":27,"keywords":{"de":[],"en":[]},"documents":{"slides":"https://www.doag.org/formes/pubfiles/12885962/2021-nn-dirk_hermanns-newcomer_real-world_event-sourcing_mit_java_und_axon-praesentation.pdf","manuscript":null,"other":null},"trackId":"4","audienceId":"3","typeId":"4","locationId":"12","speakerIds":["382350"],"languageId":"1"},{"id":"606567","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Effective and Usable Fuzzing of Java Applications","abstractText":"The complexity of modern software is constantly growing and, as a result, the overhead of effective testing is constantly increasing. Testing is key to guaranteeing the stability and security of software. Also, test automation is essential to the effectiveness, efficiency and coverage of testing efforts. \n\nIn the last few years, modern fuzzing has gained a lot of attention in both the industry and academia. Fuzzing is a testing automation method that continuously executes the application under test with unexpected inputs with the goal to trigger malicious behavior or to crash. It monitors the application at runtime and uses advanced techniques to automatically generate inputs exploring deep program states and trigger bugs. Currently, it’s by far the most effective testing method to uncover bugs automatically. For example, Google has found 30,000+ bugs in Chrome and 200+ open source projects using fuzzing making it the main testing method used by big players such as Google and Microsoft. \n\nHowever, outside the tech leaders, fuzzing has not seen a wide adoption in the industry yet. The reason is that it requires a high level of expertise and still needs a lot of manual effort to set up and integrate. In this talk, we give an overview about fuzzing and show how to overcome the challenges using our fuzzing platform CI Fuzz in a live demonstration. \n\nMore specifically, we’ll cover the following topics:\n- Overview about fuzzing\n- Instrumenting JVM code for fuzzing\n- Automatic fuzzing for web applications\n- Integration in the development process\n- Web application fuzzing and integration into the CI/CD","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":24,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"2","locationId":"9","speakerIds":["389894"],"languageId":"2"},{"id":"606402","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"System.out.println(\"USE A LOGGER\")","abstractText":"Egal ob man eine kleine Library, ein komplexes Framework oder eine Anwendung für Endanwender entwickelt - Irgendwann kommt man an den Punkt dass man Information loggen möchte. Hier bietet die Java Community eine ganze Fülle an Lösungen: Neben dem java.util.Logging gibt es Libraries wie commons-logging, Log4J oder Logback. Wo liegen hier eigentlich die Unterschiede und Alleinstellungsmerkmale? Dazu kommt, dass ja eigentlich alle sagen, dass nur die Nutzung von slf4J “Best Practice” sei. Aber warum soll ich eine Abstraktion bei der Entwicklung einer konkreten Anwendung nutzen? Oder bietet slf4j vielleicht noch ganz andere Vorteile? Und als wenn das nicht schon genug Fragen wären wurde mit Java 9 einfach mal still und heimlich mit dem System.Logger ein neuer Logger ins OpenJDK integriert. \nDieser Talk gibt einen verständlichen Leitpfaden durch den Logging Dschungel und zeigt ein paar Praktiken, die helfen das Logging von Libraries und Anwendungen in den Griff zu bekommen. Wenn du kurz davor bist aus Frust doch wieder System.out zu nutzen ist diese Session genau richtig für dich.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":68,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"1","typeId":"1","locationId":"1","speakerIds":["364422","371796"],"languageId":"1"},{"id":"606508","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"Wie finde ich das richtige Parallel-API für mein Projekt?","abstractText":"Die unzähligen APIs für die parallele und reaktive Programmierung im JDK machen uns deutlich, dass Parallelität der entscheidende Schlüssel für Performance im Multi-Core Zeitalter ist, eine notwendige Voraussetzung für eine erfolgreiche Digitalisierungsstrategie. \n\nWie aber finde ich mich zurecht in diesem Dschungel aus Technologien? Welches der Paradigmen erlaubt mir eine Parallelisierung, die einfach zu programmieren ist, die sich implizit optimiert und die mit meinen Anforderungen und mit der Hardware skaliert?\n\nDieser Vortrag liefert einen Wegweiser durch das Javaland der Parallelität. Sie lernen die nichtfunktionalen Eigenschaften der heute wichtigen Parallel-APIs in Java hinsichtlich Performance, Skalierbarkeit und Usability einzuschätzen. \n\nDabei werden Fragen der folgenden Art theoretisch fundiert und anhand praktischer Beispiele beantwortet:\n\n-\tWarum sind Fork-Join Task Parallelisierungen stabiler als solche mit Threads?\n\n-\tWann ist ein Parallel-Stream performanter als ein Fork-Join Task-Baum?\n\n-\tSind Reactive Streams und das Flow API heute das allgemeingültige Parallelitätsparadigma?\n\nEin tiefer Blick in die Realisierungsstrategien des Technologiestacks für die Parallelität im JDK hilft uns, das Verhalten der verschiedenen APIs sowie ihre Risiken und Grenzen zu verstehen. \nAm Ende des Vortrages haben Sie Kriterien erworben, anhand derer Sie fundierte Technologie-Entscheidungen für die Performance und Parallelität in Ihrem Projekt treffen können.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":31,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"1","locationId":"12","speakerIds":["386186"],"languageId":"1"},{"id":"606611","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"Enterprise Java on Steroids","abstractText":"Enterprise Java scheint mit seinem Memory- und Runtime-Overhead in Zeiten von Cloud-native und Serverless nicht wirklich gut für eine Zukunft gerüstet. Erschwerend kommt hinzu, dass viele Enterprise Frameworks mit Annotation Scanning, Aufbau von Proxies und Caches das Start- und Speicherverhalten weiter negativ beeinflussen. Bedeutet dies das Aus für Java in der Wunderwelt der Cloud? Mitnichten! Projekte wie GraalVM, Micronaut und Quarkus versuchen, Java in der Cloud zur Numero Uno werden zu lassen. Und das auf beeindruckende Art und Weise. Die Session zeigt anhand praktischer Beispiele, was heute bereits möglich ist","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":37,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"1","typeId":"1","locationId":"8","speakerIds":["371813"],"languageId":"1"},{"id":"607410","start":"2021-03-16T14:00:00","end":"2021-03-16T16:00:00","title":"Community Aktivität: Lambda Lambada","abstractText":"Die Funktionen map, filter und collect sind noch Fremdwörter für dich? Du verwendest immer noch for-Schleifen, um über Datensammlungen zu iterieren? Dann ist es höchste Zeit einmal in die funktionale Programmierwelt einzutauchen!\n\nSeit Java 8 haben wir endlich Lambda Ausdrücke und die Stream API. Wir wollen in unserer Session mit euch an einigen Beispielen arbeiten, die wir schrittweise in eine elegante funktionale Implementierung überführen. In diesem interaktiven Workshop bekommt Ihr von uns eine Einführung in die Thematik und anschließend werden wir zusammen Code entwickeln.\n\n\nVoraussetzungen:\n\nUm mitzumachen, wird eine beliebige Java Entwicklungsumgebung benötigt und Ihr solltet mindestens Java 8 auf eurem Rechner installiert haben. Grundlegende Java-Kenntnisse werden vorausgesetzt. Kenntnisse aus der funktionalen Programmierung sind nicht notwendig. Bitte schaut Euch als Vorbereitung auf den Workshop unbedingt diese vier kurzen Videos vollständig an:\n\nLambda Ausdrücke: https://youtu.be/9QFsAI90o6I\nHigher Order Functions: https://youtu.be/lKzJkiSvgpc\nSequentielle Streams: https://youtu.be/LbYAilJahDE\nParallele Streams: https://youtu.be/yBWVvm5VANU","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":13,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"3","speakerIds":["385567","384320"],"languageId":"1"},{"id":"606355","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"Live hacking: Breaking into your Java web app","abstractText":"In this session, we will demonstrate how common vulnerabilities in the Java eco-system are exploited on a daily base by live hacking real-world application libraries. All the examples used are commonly known exploits, some more famous than others, such as Apache Struts and Spring break remote code execution vulnerabilities. By exploiting them and showing you how you can be attacked, before showing you how to protect yourself, you will have a better understanding of why and how security focus and DevSecOps is essential for every developer.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":48,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"5","audienceId":"3","typeId":"5","locationId":"8","speakerIds":["386373"],"languageId":"2"},{"id":"606583","start":"2021-03-17T14:00:00","end":"2021-03-17T14:40:00","title":"How Class Data Sharing can Speed up your Application Startup","abstractText":"Java Byte code is OS independent, which means that your application's startup takes more time than a native image. Using the Class Data Sharing functionality introduced in more recent versions of the JVM, you can prepare your application so that it will load very fast.\n\nIn this presentation, I'll go into more detail what Class Data Sharing is and the differences between the OpenJDK and OpenJ9 versions. With some Jakarta EE demo applications, you will see gains that you can achieve and reduce memory footprint a lot in Docker containers by sharing memory.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":12,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"3","typeId":"1","locationId":"9","speakerIds":["382440"],"languageId":"2"},{"id":"606635","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"Neo4j 4 Java Developers","abstractText":"In einer Welt, in der immer mehr Daten anfallen, muss sich über geeignete Datenbanken Gedanken gemacht werden. Ist die richtige Wahl für eine Graph-Datenbank gefallen, stellt sich konsequenterweise die Frage, wie auf die gespeicherten Daten zugegriffen werden kann.\nBeim daraus folgenden Einsatz von Neo4j gibt es verschiedene Zugriffsmöglichkeiten, um mit Javakenntnissen gespeicherte Daten zu analysieren und zu modifizieren. Dabei kann mit Stored Procedures sehr nah an beziehungsweise in der Datenbank oder remote per Treiberzugriff und direkten Abfragen gearbeitet werden oder es wird eine höhere Abstraktionsebene gewählt und die Daten werden in ein Javamodell abgebildet.\nIn dem Vortrag soll vorgestellt werden, wo die Vorteile und Anwendungsgebiete der jeweiligen Ansätze liegen. Am Ende wird diskutiert inwiefern sich die Kriterien und Entscheidungen auf andere Datenbanken übertragen lassen.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":17,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"11","audienceId":"1","typeId":"1","locationId":"7","speakerIds":["367632"],"languageId":"1"},{"id":"606748","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"Newcomer: Secrets of Java","abstractText":"Die Sprache Java hat mit inzwischen 25 Jahren sehr viel Zeit gehabt, gotchas, unerwartete Features und nur historisch zu verstehende Entwicklungen anzusammeln. \n\nIn diesem Vortrag stelle ich einige der überraschenden Fußangeln vor, die ansonsten erst nach langem Debuggen sichtbar werden. So werden ich unter anderem aufzeigen, das throws-Deklarationen eigentlich optional sind, das Objekte scheinbar aus dem nichts entstehen können, und das die Zugriffsregeln der Sprache an überraschenden Stellen Öffnungen bieten. \n\nIch werde jedes dieser Beispiele mit einem \"unmöglichen\" oder zumindest verwundernden Beispiel illustrieren, und die implikationen der \"Lücke\" kurz besprechen.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":65,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"1","locationId":"9","speakerIds":["386308"],"languageId":"1"},{"id":"606886","start":"2021-03-16T09:00:00","end":"2021-03-16T09:30:00","title":"Welcome","abstractText":"Wir heißen die Javaland-Community auf der diesjährigen Veranstaltung willkommen! Informiert euch über Ablauf und Besonderheiten der JavaLand 2021 und genießt das besondere JavaLand-Feeling - auch online! \n\n--\nWe welcome the Javaland community to this year's event! Find out about the schedule and special features of JavaLand 2021 and enjoy that special JavaLand feeling - also online!","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":128,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"audienceId":"1","locationId":"1","speakerIds":["136700"],"languageId":"1"},{"id":"606319","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"Scala 3 - Gefühl und Härte","abstractText":"Scala3 erscheint voraussichtlich Ende 2020. Dieses Release ist ein weiterer Schritt in Richtung Vereinigung von objektorientierten und funktionaler Programmierung. Mit diesem Update werden einige Unzulänglichkeiten der Sprache beseitigt und bisherige Features durch neue, einfachere und klarere Konstrukte ersetzt. Alles mit dem Ziel die Sprache besser zugäglich zu machen. In diesem Vortrag wollen wir uns die Top 10 Features anschauen, die Scala3 für die Praxis bietet und durch Programmierbeispiele deren Anwendungsmöglichkeiten beurteilen.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":14,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"2","audienceId":"1","typeId":"2","locationId":"11","speakerIds":["386360"],"languageId":"1"},{"id":"606496","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"AI & Machine Learning mit 8. Klasse Mathematik","abstractText":"Bestimmt jeder hat sich in seiner Schulzeit wahrscheinlich mehr als einmal bei Mathe Hausaufgaben die Frage gestellt „Wofür werde ich das jemals brauchen?“\n\nEine Antwort darauf gibt es in diesem Vortrag.\n\nEvolutionäre & trainierende Algorithmen, selbst lernende Computer und Neuronen dem Gehirn nachgebildet. Das und viel mehr hört man wenn man beginnt sich mit dem Thema Künstliche Intelligenz und Machine Learning auseinanderzusetzen.\nDiese „Magie“ ist aber nichts anderes als Schulmathematik und mit dieser werden wir die Begrifflichkeiten entzaubern.\n\nEingeladen ist jeder, der einen fundierten Einstig in das Thema finden möchte, es sind keine Vorkenntnisse erforderlich.\n\nWir werden viel Rechnen, und einen ersten „trainierenden, selbstlernenden Algorithmus“ schreiben, sodass auch Fortgeschrittene Techniker etwas mitnehmen können.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":32,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"12","audienceId":"3","typeId":"5","locationId":"11","speakerIds":["378795"],"languageId":"1"},{"id":"606728","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"How to grow an amazing community","abstractText":"Nowadays, one of the most common tips Java Champions advise us in order to grow our career is to get involved in a developer community or even to create our own one.\n But wait, how easy is it to actually create your own community? In this session Thodoris will share his experiences on growing Utrecht Java User Group and reaching a point where after 3 years, Utrecht JUG has 2500 registered members, has hosted more than 40 events and exceptional speakers (where among others, Uncle Bob and James Gosling), and running 3 programmes: Devoxx4kids, Speaker Incubator and uJCP. How did we make it to transform a local community to one of the most active JUGs in the world? What were the challenges and how did we approach them? Whether you are a developer, a manager or a tester, come attend this talk to find out how you can kickstart your own community and make it fly.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":10,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"1","locationId":"8","speakerIds":["386339"],"languageId":"2"},{"id":"607319","start":"2021-03-16T10:10:00","end":"2021-03-16T11:00:00","title":"Frühstücksfernsehen (Tag 1)","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":71,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"audienceId":"1","locationId":"1","speakerIds":["371826","364422"],"languageId":"1"},{"id":"606707","start":"2021-03-17T16:00:00","end":"2021-03-17T16:40:00","title":"Let's get FUNQY! Das Quarkus-Serverless-API #slideless","abstractText":"Quarkus ist (zwar) ein \"Container First\" Framework, bietet jedoch auch viele Extensions und Unterstützung für den Betrieb auf unterschiedlichen Serverless-Plattformen an.\n\nDas Funqy-API vereinfach das Schreiben von Java-basierten HTTP-Services noch weiter als bisher und kapselt die Implementierung von Plattform-spezifischem Deployment-Wissen vollständig vom Entwickler weg. Dabei ist es egal, ob die Applikation später in einer JVM oder als natives Artefakt (mittels GraalVM) deployt und betrieben wird. Je nach Zielumgebung (AWS, Google, Azure, Knative, etc.) werden die notwendigen Deployment-Artefakte während des Builds generiert und stehen dann als Template zur Verfügung.\n\nIn meinem Vortrag zeige ich ganz ohne Folien und mit viel Code, wie schnell und einfach Ihr einen HTTP-basierten Service schreiben in unterschiedlichste Cloud-Plattformen deployen könnt. Als Java- und Native-Service.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":16,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"1","typeId":"2","locationId":"1","speakerIds":["359390"],"languageId":"1"},{"id":"607363","start":"2021-03-16T18:00:00","end":"2021-03-16T19:00:00","title":"Community Aktivität: LIVE RECORDING of Bert Jan Schrijver’s Story for the Developer‘s Journey Podcast","abstractText":"LIVE RECORDING of Bert Jan Schrijver’s Developer’s Journey. Junior developers are taken by the hand and guided through their first [1;n] steps. Graduating out of \"juniordom\" often means finding and making your way. There, future-ex-junior-developers have to face their \"unknown-unknowns.\" They have to find ways to uncover what they don't know. Here enters the Developer's Journey show. In this episode, we will listen to Bert's story and highlight how he became the person he is today.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":4,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"3","speakerIds":["386134"],"languageId":"2"},{"id":"606376","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Bin ich eine Pfeife, wenn ich kein Experte bin?","abstractText":"\"Ich muss nicht freundlich zu den Leuten sein\", erklärte mir neulich ein Kollege. \"Ich bin der einzige Experte zu dem Thema hier. Die kommen trotzdem immer wieder, wenn sie was brauchen.\" Zuvor hatte jemand unser Gespräch mit einer Frage unterbrochen und wurde von ihm ziemlich abgekanzelt.\n\nDer Hang zum Expertentum ist in Deutschland sehr verbreitet, stellt auch Justin Vaughan-Brown in seinem auf heise Developer erschienenen Artikel \"Verträgt sich DevOps mit der deutschen Arbeitskultur?\" fest. Doch macht das Expertentum überhaupt Sinn in der sich so schnell wandelnden digitalen Welt? Und ist unser Arbeitsalltag nicht zu stressig, um auch noch die Bürde auf uns zu nehmen, alles über ein Thema zu wissen und keine Fehler zu machen, damit unser Experten-Image nicht beschädigt wird?\n\nDie Wirtschafts-Profilerin Suzanne Grieger-Langer erzählt uns andererseits von sogenannten \"Pfeifen\", die keine Ahnung von der Materie haben, jedoch ziemlich erfolgreich sind. Sie managen ihr Auftreten und nicht ihr Wissen und werfen mit Schlagworten um sich.\n \nDoch bin ich eine Pfeife, wenn ich kein Experte sein möchte? Oder gibt es etwas dazwischen?","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":53,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"1","locationId":"10","speakerIds":["382455"],"languageId":"1"},{"id":"606563","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"DevSecOps Live: Security Checks als Teil der CI/CD-Pipeline","abstractText":"In diesem slideless Talk sehen Sie anhand einer Live-Demo, wie mit Hilfe von Open-Source-Werkzeugen eine CI/CD-Pipeline um automatisierte Security-Checks angereichert wird. Schwerpunkt bilden hierbei tiefgreifende Security-Checks auf dem Application-Layer, da dort bei individuellen Entwicklungsprojekten das größte Risiko liegt. Hierbei werden die Ergebnisse automatisch ausgewertet und in agilen Projekten Builds mit kritischen Findings rechtzeitig vor einem Go-Live erkannt. Darüber hinaus wird gezeigt, wie ein False-Positive Handling der Findings im Rahmen der Build-Kette möglich ist und wie je nach Projekt unterschiedliche Quality-Gates eingeführt werden.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":42,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"5","audienceId":"3","typeId":"1","locationId":"10","speakerIds":["378752"],"languageId":"1"},{"id":"607197","start":"2021-03-16T11:00:00","end":"2021-03-16T11:45:00","title":"Sponsored Session: Real-world Continuous Delivery with Tekton & ArgoCD","abstractText":"In the past years, enterprise workloads have been moved to cloud-native, containerized environments, powered by Kubernetes. Yet, many organizations are struggling with updating their Continuous Delivery stack. While many new, cloud-native CI/CD technologies have emerged, not all of them are ready for prime time yet. What is a reasonable approach and choice of technology for real-world, cloud-native projects?\n\nIn this session we’ll see how to achieve modern and flexible Continuous Delivery for cloud-native projects that can be used for production, as of today. We’ll specifically look at Tekton, ArgoCD on top of Kubernetes. If you know Sebastian, you’ll assume correctly that most of the session will be live-coding and live-demoing.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":4,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","locationId":"14","speakerIds":["364863"],"languageId":"2"},{"id":"606468","start":"2021-03-16T15:00:00","end":"2021-03-16T15:40:00","title":"Lessons Learned: arc42 in einem DevOps Team","abstractText":"In diesem Vortrag berichtet der Sprecher von seinen Erfahrungen, Erfolgen und Fehlern mit dem arc42-Architekturtemplate in einem DevOps-Team im Konzernumfeld mit Produktentwicklungsfokus.\n\nProduktentwicklung ist geprägt von kurzen Iterationszyklen und wird darum gerne agil betrieben, wie im Team des Sprechers. Dort wurde die vorhandenene unstrukturierte Dokumentation in das arc42-Template überführt und in einem Wiki abgelegt. Im Laufe der Zeit stellte sich heraus, dass das Tooling eine entscheidende Rolle für die Qualität der Dokumentation bedeutet und deswegen auf Docs-as-Code umgestellt. \n\nIm Laufe des Vortrags wird auf die wichtigsten Entscheidungspunkte für die aktuelle Iteration der technischen Softwarearchitektur eingegangen. Darunter unter anderem der Umgang mit \"Entwicklerprosa\", veralteter Dokumentation und der für ein DevOps-Team besonders wichtigen Architekturentscheidungen. Die Einbindung in das methodische Vorgehen Kanban wurde mit arc42 und einer Microsite basierend auf AsciiDoc möglich. \n\nNicht ausgespart werden die gemachten Fehler, wie zum Beispiel fehlende Qualitätssicherung erstellter Dokumentation oder die Vermischung von fachlichen und technischen Themen.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":32,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"1","typeId":"1","locationId":"8","speakerIds":["371819"],"languageId":"1"},{"id":"606579","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"Integrating systems in the age of Quarkus, Knative and Kafka","abstractText":"Apache Camel has been the Swiss knife of integrating heterogeneous systems for more than a decade. Let's check how the humpy ungulate adapts to the newest changes in the environment!\n\nApache Camel integrations written on top of Quarkus start in a matter of milliseconds and consume just a few tens of megabytes of RAM. We will explain the technology and show a live demo including the famous Quarkus dev mode.\n\nThen you will learn how the outstanding integration capabilities of Apache Camel enrich the serverless architectures based on Knative. We will touch topics like auto-scaling and scaling to zero as well as content based routing of cloud events.\n\nFinally, we will introduce the youngest member of the Camel family: the Camel Kafka Connector. It brings the possibility to scalably and reliably stream data between Apache Kafka and the 300+ kinds of systems supported by Apache Camel. We will clarify the underlying concepts and show how to use it.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":15,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"1","typeId":"4","locationId":"7","speakerIds":["386099"],"languageId":"2"},{"id":"606651","start":"2021-03-16T13:00:00","end":"2021-03-16T13:40:00","title":"Blockchain 101 for Java Developers","abstractText":"We all know the effects of the Gartner hype cycle and with regards to Blockchain technology we might wonder: Are we still on the “Peak of Inflated Expectations” or did we crash into the “Trough of Disillusionment”? No matter the current state, let’s hope we are at one point heading to the “Plateu of Productivity”, however this might look.\n\nAside from the hype and the buzzword bingo, blockchain as a technology contains a lot of interesting concepts and building blocks from a diverse range of computer science domains, such as cryptography, distributed computing, fault tolerant computer systems or formal verification. \n\nIn this talk we want to take a closer look at those basic building blocks. Without regard to which cryptocurrencies or blockchain frameworks rise in the next years, knowing about those fundamentals will be a worthwhile endeavor with a stable return on investment. It will also provide ammunition in the next big discussion with a manager requesting to “3-D print a blockhain and HTML into a bitcoin”. \n\nI will go through the history of computer science and cryptography with regards to blockchain and distrubted ledger technology, starting as early as the 70s, and we will end up in the present day and see how we can interact with Ethereum Smart Contracts using Java and web3j.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":36,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"11","audienceId":"1","typeId":"5","locationId":"7","speakerIds":["374853"],"languageId":"2"},{"id":"606691","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"Microservices are the cause of Dependency Hell 2.0","abstractText":"At the moment the programming community finally figured out how to do proper dependency management using Maven, Gradle or NPM, they found a new way to shoot themselves in the foot: microservices. You are correct in thinking that smaller applications typically have less dependency conflicts. But we now have a new, higher level of dependencies: those between microservices. How can you keep track of these dependencies? And more importantly, how can you stay in control?\n\nAnd this is not the only new challenge. The carefully crafted tooling to ensure for example dependency convergence in your monolith has to be ported to your microservices build pipelines. And what to think about vulnerability scanning or license compliancy? A Docker image has more dependencies than it seems at first glance.\n\nIn this talk I'll discuss Dependency Management Best Practices and show how the lessons we have learned from ye ol' monolith days apply to microservices. Join me if you don't want to end up in Dependency Hell 2.0!","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":60,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"1","typeId":"1","locationId":"1","speakerIds":["378544"],"languageId":"2"},{"id":"606504","start":"2021-03-16T17:00:00","end":"2021-03-16T17:40:00","title":"Debugging JVM performance issues","abstractText":"With heavy advancements in Java, the number and scale of deployments are ever increasing. With such growth, understanding how to debug memory and CPU performance issues related to the java application and JVM are critical to ensure smooth operation. This presentation will talk about performance issue scenarios and provide an overview of tools/scripts/processes to triage and eventually understand the problem to a level where the next step would be to fix it. \nWe will go through heap dumps, thread dumps, process crash logs etc","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":40,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"3","typeId":"1","locationId":"11","speakerIds":["389351","389659"],"languageId":"2"},{"id":"606327","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"GraphQL: Außenseiter oder Mainstream?","abstractText":"Mit der Sprache GraphQL können Clients flexibel Daten von einem Server abfragen und schreiben, die sie selbst auswählen können. Für Java gibt es gleich mehrere Bibliotheken, die den Einsatz von GraphQL in eigenen Anwendungen ermöglichen unnd mittlerweile ist GraphQL sogar in die Microprofile Spezifikation aufgenommen werden. Ist GraphQL damit im Mainstream angekommen oder fristet es - verglichen mit der Alternative \"REST\" - immer noch ein Außenseiterdarsein? \nIn diesem Vortrag sehen wir uns an, was GraphQL ausmacht, welche Implementierungen es für Java gibt und wo sich GraphQL besonders eignet.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":52,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"1","typeId":"2","locationId":"11","speakerIds":["378753"],"languageId":"1"},{"id":"606424","start":"2021-03-17T12:00:00","end":"2021-03-17T12:40:00","title":"Opportunities and Pitfalls of Event-Driven Utopia","abstractText":"Event-driven architectures are on the rise. They promise both better decoupling of components by using an event bus and improved scalability in terms of throughput. Decoupled modules help to scale your software development efforts itself. Event streaming promises to handle ever-growing amounts of \"data in motion\" in real-time, event sourcing allows us to time travel, and domain events have turned out to be powerful building blocks that lead to a better understanding of underlying business requirements.\n\nBut there are also pitfalls that you’d better be aware of. For example event-notifications used inappropriately can lead to tighter coupling or cyclic dependencies between components. It is also easy to lose sight of flows across service boundaries, making it hard to understand how core business logic is actually implemented. This can get even worse if you lack tooling to get insights into your event flows. Last but not least, the event-driven approach is not well-understood by most developers or business analysts, making it hard for companies to adopt. In this talk, I will quickly go over the concepts, the advantages, and the pitfalls of event-driven utopia. Whenever possible, I will share real-life stories or point to source code examples.","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":36,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"4","audienceId":"1","typeId":"1","locationId":"1","speakerIds":["386408"],"languageId":"1"},{"id":"606544","start":"2021-03-17T17:00:00","end":"2021-03-17T17:40:00","title":"Was macht SRE eigentlich bei Neo4j Aura","abstractText":"Bei Aura handelt es sich um das Cloud-Angebot von Neo4j, ein vollständig automatisiertes Graphdatenbank-as-a-Service-Angebot. Dem Kunden ist es hier möglich, über eine Weboberfläche ein Datenbankcluster zu konfigurieren und zu starten. Dieses Cluster wird dann von unserem Code in einem Kubernetes-Cluster in einer Public-Cloud für den Kunden betrieben.\nIch arbeite in einem der Teams, die für dieses Selfserviceprodukt verantwortlich sind, und ich möchte euch mit auf die Reise nehmen und zeigen, welche Aspekte wir in Bezug auf Site Reliability Engineering (SRE) eingeführt haben, um dieses Produkt am Laufen zu halten. Dabei werden wir speziell auf Monitoring, Alerting, Chaos Engineering, Rufbereitschaft und das Training dafür eingehen. Let's go!","demo":false,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":3,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"3","typeId":"4","locationId":"9","speakerIds":["389368"],"languageId":"1"},{"id":"606683","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"A Hitchhiker's Guide to Cloud native API Gateways","abstractText":"Good APIs are the center piece of any successful digital product and cloud native application architecture. But for complex systems with many API consumers the proper management of these APIs is of utmost importance. The API gateway pattern is well established to handle and enforce concerns like routing, versioning, rate limiting, access control, diagnosability or service catalogs in a microservice architecture.\n\nSo this session will have a closer look at the cloud native API gateway ecosystem: Ambassador, Gloo, KrakenD, Envoy, et.al. But which one of these is the right one to use in your next project? Let's find out. We will start off by briefly explaining the API gateway pattern and some basic criteria. We then continue by showcasing the most promising ones.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":17,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"9","audienceId":"3","typeId":"1","locationId":"13","speakerIds":["374893"],"languageId":"2"},{"id":"606695","start":"2021-03-16T16:00:00","end":"2021-03-16T16:40:00","title":"Wie sollten Java-Entwickler heute Front-Ends für Web, Mobile & Desktop bauen?","abstractText":"Smartphones sind die populärste Art, auf Anwendungen zuzugreifen. iOS und Android stellen dafür ausgereifte Plattformen zur nativen App-Entwicklung bereit. Es ist aber teuer und aufwändig, zwei separate Apps für iOS und Android zu entwickeln. Web-Anwendungen laufen zwar auf beiden Plattformen. Leider hinken sie aber gerade auf iOS hinter den Fähigkeiten nativer Apps hinterher und bieten eine eher ärmliche \"Developer Experience\".\n\nDeswegen werden Plattformen wichtiger, die aus einer Code-Basis native Apps für iOS und Android erzeugen. Facebooks React Native und Googles Flutter führen dieses Feld an. Beide nutzen, genau wie Apples Swift UI und Googles Jetpack Compose, deklarative Programmierung und bieten eine exzellente \"Developer Experience\". Flutter ist jedoch als \"UI Toolkit für jeden Ort, wo Pixel gemalt\", ehrgeiziger: Web-Anwendungen mit Flutter sind im Beta-Stadium, Desktop-Anwendungen im Alpha-Stadium (Stand September 2020). Flutter ist darüberhinaus für Java-Entwickler interessanter, weil die verwendete Programmiersprache Dart als \"Zwei Teile Java, ein Teil JavaScript\" beschrieben werden kann.\n\nDer Autor hat im Sommer 2019 einen Flutter-Prototyp entwickelt (https://youtu.be/dxqA6RhEwdQ) und im Winter 2019/2020 eine PWA (https://youtu.be/Nx9vPgdeYQQ). Danach entschied er sich, für eine Software as a Service (SASS) die nativen iOS- und Android-Apps mit Flutter umzusetzen. Das Back-End war eine Spring-Boot-Anwendung, das Web-Front-End lief mit Angular. Im Vortrag demonstriert der Autor die iOS- und Android-Apps und berichtet über seine Erfahrungen mit Flutter. Anhand von Code- und Werkzeug-Beispielen zeigt er Vorteile auf und geht auf typische Probleme und deren Lösung ein.\n\nFolien, Videos, weiterführende Information und Links zum Start mit den Frameworks gibt es hier: https://bpf.li/jaw","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":61,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"13","audienceId":"1","typeId":"4","locationId":"12","speakerIds":["389387"],"languageId":"1"},{"id":"607376","start":"2021-03-16T15:00:00","end":"2021-03-16T16:00:00","title":"Community Aktivität: WomenInTech Coffee Break - Bring your own Coffee","abstractText":"Meet and greet. A good possibility to meet and talk about all kinds of topics. BYOC (Bring your own coffee!)","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":2,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","typeId":"5","locationId":"4","speakerIds":["381314"],"languageId":"1"},{"id":"606631","start":"2021-03-16T11:00:00","end":"2021-03-16T11:40:00","title":"Generierung strukturierter Testdaten via einer PBT-Library","abstractText":"End-to-End Tests komplexer Systeme benötigen strukturierte Testdaten, um z.B. Plausibilitätsprüfungen auszulösen bzw. erfolgreich durchlaufen zu können.\nGerade im Bankenumfeld stellt sich auf Grund der höchst vertraulichen Natur der Echtdaten das Problem, wie man an fachlich sinnvoll strukturierte Testdaten herankommt.\nEinfache Anonymisierung etwa von Adress- und Kontodaten erlauben oft keine technisch aussagekräftigen Plausibilitätsprüfungen dieser Daten (Prüfsummen; Telefonvorwahl passt zur Stadt; ...).\nWie wir im Laufe des Vortrags sehen werden, lässt sich genau dieses Problem mit überschaubarem Aufwand mit Hilfe von ScalaCheck lösen.\n\nScalaCheck ist eine auf den Ideen von QuickCheck aufbauende Bibliothek zum Property-based Testen von Scala und Java Anwendungen.\nUm dies zu ermöglichen, bietet ScalaCheck einfache Möglichkeiten zur Erzeugung von strukturierten Testdaten, die ggf. auch voneinander abhängig sein können.\n\nMittlerweile gibt es Implementierungen dieses Ansatzes in vielen Sprachen, so etwa auch JUnit QuickCheck für Java, mittels derer die Ideen des Vortrags ebenfalls implementiert werden können.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":21,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"1","typeId":"5","locationId":"11","speakerIds":["386412"],"languageId":"1"},{"id":"607453","start":"2021-03-16T16:00:00","end":"2021-03-16T18:00:00","title":"Community Aktivität: JUG Café - Meet the JUGs","abstractText":"Auch in diesem Jahr soll das JUG Café ein zentraler Treffpunkt im Javaland sein. Natürlich gibt es wieder Möglichkeiten mit Vertretern diverser Java User Groups in Kontakt zu treten und wir bieten euch wie gewohnt den gemütlichen Rückzugsraum für ein ruhiges Gespräch oder eine kurze Pause vom Konferenzgetümmel. Nur für eure Kaffeespezialitäten müsst ihr ausnahmsweise selber sorgen.","demo":false,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":0,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"14","audienceId":"1","locationId":"4","speakerIds":["359611","353141"],"languageId":"1"},{"id":"606398","start":"2021-03-17T13:00:00","end":"2021-03-17T13:40:00","title":"Grüne Inseln im Brownfield-Schlamm","abstractText":"\"Key lesson is, you can always (read: most of the time) do greenfield in a legacy code base.\"\n-- Michael Feathers\n\nLegacy Code ist eine der größten Herausforderungen für Entwickler überhaupt. Er kostet Nerven und fordert oft all unsere Kräfte, um auch nur ein kleines Feature in Produktion zu bringen. Aktuelle IDEs bringen viele Refactoring-Werkzeuge mit, die uns das Leben und Arbeiten im Brownfield erleichtern. Weniger bekannt sind aber Refactorings, die nicht vollautomatisch von unserer IDE übernommen werden können.\n\nMotiviert von Michael Feathers' Zitat möchte ich einige Refactorings und Legacy-Code-Techniken live vorführen, die die IDE nicht automatisch für uns ablaufen lassen kann, die man dafür auch tief im Schlamm des Brownfields einsetzen kann. So pflanzt man testgetriebene, grüne Inseln, die sich Schritt für Schritt vergrößern und so das ganze Projekt verbessern.\n\nAls Beispielprojekt nehme ich die Gilded Rose Kata von Emily Bache und zeige damit systematisch, wie die Techniken in der Praxis eingesetzt werden können. Die Tests bleiben dabei immer grün und die Techniken werden so kleinschrittig wie möglich ausgeführt.\n\nVorkenntnisse: Etwas Java- und Refactoring-Erfahrung sind von Vorteil. Man muss aber kein Experte darin sein, um dem Vortrag folgen zu können.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":50,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"6","audienceId":"3","typeId":"1","locationId":"10","speakerIds":["382491"],"languageId":"1"},{"id":"606492","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"Mit 3 Patterns zum skalierbaren Datenaustausch","abstractText":"Wenn Microservices skalierbar und unabhängig sein sollen, wird der Datenaustausch zwischen ihnen schnell zur Herausforderung. Verteilte Transaktionen schaffen eine enge Kopplung und sind nicht länger eine Option. Das gleiche gilt für synchrone Serviceaufrufe.\n\nWir benötigen neue Ansätze, mit denen wir asynchron Daten austauschen und deren Konsistenz sichern können.\n\nIn vielen Architekturen werden dafür 3 Patterns eingesetzt: Das Outbox Pattern, das View Database Pattern und das SAGA Pattern.\nMit Hilfe des Outbox Patterns werden Events in Kafka und Daten in der serviceeigenen Datenbank gespeichert. Darauf aufbauend können andere Services entweder die Daten in ihrer eigenen View Datenbank speichern oder an einer komplexen SAGA zur Absicherung einer verteilten Schreiboperationen teilnehmen.\n\nWie das alles genau funktioniert und worauf dabei zu achten ist, zeige ich in diesem Vortrag.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":54,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"8","audienceId":"3","typeId":"1","locationId":"12","speakerIds":["369887"],"languageId":"1"},{"id":"606540","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"Sketchnotes im Techie-Alltag","abstractText":"Jeder von uns macht in seinem Berufsalltag unzählige Notizen - von Vorträgen, Meetings, komplexen Aufgaben, …\nDie meisten dieser Notizen leiden unter dem “Lang-und-unleserlich”-Syndrom, weswegen sie schnell im Altpapier landen. Oft helfen diese Notizen nicht dabei, sich an die wichtigen Dinge zu erinnern. Dabei haben wir sie doch genau dafür erstellt!\n\nIn meinem Vortrag siehst du, wie du Sketchnotes in deinen Arbeitsalltag als Techie integrierst und welche Vorteile sie für dich haben. Du erfährst, was Sketchnotes sind, wie du sie für deine Zwecke einsetzt und wie sie dafür sorgen, dass du dich endlich an die wichtigen Dinge erinnern kannst. \n\nDamit du mit allem wichtigen Handwerkszeug nach Hause gehst, zeichnen wir gemeinsam Schritt für Schritt einige in der Softwareentwicklung und -architektur häufig nutzbare Symbole.\n\nDu bist hier richtig, wenn du deine Notizen endlich hilfreicher gestalten möchtest. Dafür brauchst du keine 1 in Kunst, sondern einfach nur Lust, mal etwas Neues auszuprobieren.\n\nAn die Stifte, fertig, los!","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":61,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"3","audienceId":"1","typeId":"5","locationId":"11","speakerIds":["389361"],"languageId":"1"},{"id":"607328","start":"2021-03-17T10:40:00","end":"2021-03-17T11:40:00","title":"Frühstücksfernsehen mit Sandra Parsick und Hendrik Ebbers (Tag 2)","abstractText":"WE ARE BACK! Es ist wieder soweit: Auch am zweiten Tag gibt es das JavaLand Frühstücksfernsehen mit Sandra Parsick und Hendrik Ebbers. Spoiler: Diesmal sind wir seriös [Zwinker-Smiley]. Bei leckeren Croissants und Java-Kaffee wagen wir eine Zeitreise in die Vergangenheit der JavaLand. Dabei werden wir aber nicht die gegenwärtige Community  vergessen. Nebenbei schmieren wir euch Kriegsgeschichten (WAR-Stories) aus dem Java-Alltag aufs Brötchen.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":51,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"audienceId":"1","locationId":"1","speakerIds":["371826","364422"],"languageId":"1"},{"id":"606351","start":"2021-03-17T10:00:00","end":"2021-03-17T10:40:00","title":"Knowledge Graphs: Wer kennt wen & andere Beziehungsprobleme","abstractText":"Wie wertet man einen Berg von Daten wie die Paradise Papers aus? Wie findet man Personen oder Dinge, die in einer bestimmten Relation zu anderen stehen? Wie erkennt man Zusammenhänge in großen Mengen von Entitäten, seien es Firmen, Personen, Orte oder alles zusammen? Wie vernetzt man Daten, auch über technische und Organisationsgrenzen hinaus? Mit einem Knowledge Graph!\nDieser Vortrag zeigt anhand einiger Beispiele, wie man einen Knowledge Graph mit Linked Data aufbaut, aus Java-Programmen anspricht und erfolgreich für Datenanalyse und verwandte Anwendungsfälle einsetzt.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":24,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"11","audienceId":"3","typeId":"2","locationId":"9","speakerIds":["371317"],"languageId":"1"},{"id":"606575","start":"2021-03-17T09:00:00","end":"2021-03-17T09:40:00","title":"Will my library or framework work on Quarkus (and GraalVM)?","abstractText":"Let's unveil the magic behind Quarkus! Quarkus makes fast boot times and low memory consumption of Java applications possible thanks to a technique called Compile time boot. Quarkus extensions are its main building blocks. They optimize applications by doing as much work as possible at compile time instead of repeating it on each boot. This may include tasks like parsing configuration files, annotation lookups, building framework metamodel, etc. We will explain how Quarkus extensions work by writing one from scratch. You will be guided through several typical problems and their solutions that occur when porting libraries and frameworks to Quarkus and GraalVM. The talk is aimed at potential authors and contributors of Quarkus extensions as well as everybody curious about Quarkus internals.","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":10,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"1","audienceId":"3","typeId":"5","locationId":"12","speakerIds":["386099"],"languageId":"2"},{"id":"606599","start":"2021-03-16T14:00:00","end":"2021-03-16T14:40:00","title":"Effective Cloud-Ready Apps with MicroProfile and Jakarta EE","abstractText":"Learn how to evolve your applications according to changing requirements in agile fashion, focusing on what matters, using the most modern features of MicroProfile and Jakarta EE. Start with simple concepts with the vision of building a cloud-ready application. Without wasting time and resources, we’ll start with a simple application. Focusing on business logic, keeping things simple and pragmatic, we’ll be able to deliver functionality fast and make customers happy. MicroProfile, one of the most flexible Java frameworks, will get us started quickly and allow gradual improvements later.\n\nMicroProfile and Jakarta EE allow separating business logic from common concerns like configuration, failure-recovery, REST service calls, distributed tracing and securing services. With careful design and a good set of tools, I’ll explain and show how to build your apps so that you can flexibly introduce new microservices and adopt cloud technologies at the time when you needed it. It will allow you to develop fast in the beginning and also be productive and optimize performance in later stages.","demo":true,"simultan":false,"veryPopular":false,"fullyBooked":false,"numberOfFavorites":16,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"7","audienceId":"1","typeId":"5","locationId":"13","speakerIds":["374933"],"languageId":"2"},{"id":"606732","start":"2021-03-17T15:00:00","end":"2021-03-17T15:40:00","title":"Kotlin Compiler Plugins: Keine Scheu vor Experimenten!","abstractText":"Mit Jetpack Compose, dem Toolkit zur Entwicklung deklarativer Android-Oberflächen, hat Google gezeigt, dass mit Kotlin Compiler Plugin  mächtige Metaprogrammierung Konzepte mit Kotlin möglich sind. \nMichal Harakals Vortrag zeigt Ihnen die Struktur des Kotlin-Compilers und stellt Ihnen die verschiedenen Kompilierungsphasen vor.  Unterschiedliche Ansätze, wie man ein eigenes Compiler Plugin baut werden evaluiert und dargestellt. Angefangen mit einem einfachen \"Hello world\" bis zum Ensatz von Helfern wie Googles Bibliothek „Kotlin Symbol Processing“ oder Arrow-Meta. Wichtige Vorgehensweisen und Konzepte werden im Vortrag direkt live am Code-Beispiel illustriert. Nach dem Vortrag wissen Sie, wie Sie anfangen können, um ein eigenes Kotlin Compiler Plugin zu entwickeln.\n \n\nHier lernen Sie:\n\n    So funktioniert der Kotlin-Compiler\n\n    Grundlagen und Praxiswissen, um ein eigenes Plugin zu schreiben\n\n    Beispielprojekt zum Kotlin Compiler Plugin","demo":true,"simultan":false,"veryPopular":true,"fullyBooked":false,"numberOfFavorites":16,"keywords":{"de":[],"en":[]},"documents":{"slides":null,"manuscript":null,"other":null},"trackId":"2","audienceId":"2","typeId":"2","locationId":"9","speakerIds":["374971"],"languageId":"1"}],"speakers":[{"id":"353141","name":"Frank Schwichtenberg","firstname":"Frank","lastname":"Schwichtenberg","company":"FIZ Karlsruhe","twitter":"@fschwic","linkedin":"https://de.linkedin.com/in/frank-schwichtenberg-a4333418","bio":"Frank Schwichtenberg ist technischer Leiter e-Science bei FIZ Karlsruhe und beschäftigt sich dort vorwiegend mit der Entwicklung von wissenschaftliche Infrastruktur, Digital Repositories und Forschungsdatenmanagement. Er ist Vorstandsvorsitzender der Java User Group Deutschland e.V. und Gründungsmitglied des iJUG Interessenverbund der Java User Groups e.V.. Neben seinen beruflichen Aktivitäten beschäftigt er sich zur Zeit hauptsächlich mit Webtechnologien und App Entwicklung.","photoId":"a049153ba4228fd657719a53dfa8dfb1","eventIds":["607386","607368","607453"]},{"id":"365313","name":"Andres Almiray","firstname":"Andres","lastname":"Almiray","company":"Gradle GmbH","website":"http://andresalmiray.com","twitter":"https://twitter.com/aalmiray","xing":"https://www.xing.com/profile/Andres_Almiray/","linkedin":"https://www.linkedin.com/in/aalmiray/","bio":"Andres is a Java/Groovy developer and a Java Champion with more than 20 years of experience in software design and development. He has been involved in web and desktop application development since the early days of Java. Andres is a true believer in open source and has participated on popular projects like Groovy, Griffon, and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member of the Griffon framework and Hackergarten community event.\r\n\r\n * JCP EC Associate Seat (Nov 2017 ? Nov 2019)\r\n * Apache Committer\r\n * Eclipse Committer\r\n * JSR-377 Spec lead\r\n","photoId":"1110f202ee8fdaddf8f9f7459052740e","eventIds":["607461","606699"]},{"id":"386357","name":"Christian Seifert","firstname":"Christian","lastname":"Seifert","eventIds":["606472"]},{"id":"386229","name":"Michel Schudel","firstname":"Michel","lastname":"Schudel","company":"Craftsmen","website":"craftsmen.nl","twitter":"https://twitter.com/michelschudel","linkedin":"https://www.linkedin.com/in/michelschudel/","bio":"Michel Schudel has been a passionate Java developer since 1998, building various Java solutions for banks, insurance companies and telecom providers. Since then he has seen the good, the bad and the ugly in Java land. He loves agile development and coding with frameworks like SpringBoot to get up-and-running as fast as possible. Futhermore, he likes to coach junior developers in Core Java. Michel is currently working for Rabobank in the Netherlands.","photoId":"7e53d89c46de5c55ee5031cad3bb6273","eventIds":["606663"]},{"id":"361841","name":"Richard Fichtner","firstname":"Richard","lastname":"Fichtner","company":"XDEV Software GmbH","website":"https://www.rapidclipse.com/","bio":"Richard Fichtner ist ein passionierter Java Entwickler mit mehr als 15 Jahren Erfahrung in der Softwarebranche. Er engagiert sich in der Open Source Community, um das Wissen über Java-Technologien zu verbreiten. Er spricht auf Konferenzen wie Oracle Code / JavaOne / JCON/ Clean Code Days und vielen anderen und leistet einen Beitrag zu verschiedenen Open Source Projekten wie https://www.rapidclipse.com/. Als Oracle Groundbreaker Ambassador und AWS Certified Solution Architect unterstützt er Teams beim Einsatz von Cloud Lösungen. Seine Interessenschwerpunkte sind Clean-Code, Cloud, neue Technologien und alles was agil ist. In seiner Freizeit organisiert er die Java User Group Oberpfalz.","photoId":"a8d58e33f7843cd74f9aaaa73f4f6fdb","eventIds":["606359"]},{"id":"364571","name":"Thorsten Maier","firstname":"Thorsten","lastname":"Maier","company":"Trivadis Germany GmbH","website":"http://www.oio.de","twitter":"https://twitter.com/ThorstenMaier","bio":"Thorsten Maier arbeitet bei Trivadis Germany GmbH in Mannheim. Er erschließt kontinuierlich bessere Wege, Software zu entwickeln, indem er selbst als leidenschaftlicher Software-Entwickler mit Java und JavaScript unterwegs ist und anderen als Berater, Trainer, Autor sowie Speaker dabei hilft. Trotz seiner Begeisterung für Neues sind ihm Menschen stets wichtiger als Technologien. Sein Hauptaugenmerk liegt daher auf der Frage, wie sich modernste Technologien in gewachsene Umgebungen einbinden lassen und wann man besser auf Bestehendes zurückgreifen sollte.","photoId":"f4783e1a11ecbe6b4616a64bbeec1630","eventIds":["606619"]},{"id":"389618","name":"Jamila Mahler","firstname":"Jamila","lastname":"Mahler","company":"Karakun AG","eventIds":["606917"]},{"id":"389253","name":"Stephanie Wang","firstname":"Stephanie","lastname":"Wang","company":"Google","website":"http://stephaniewang526.github.io/ ","twitter":"https://twitter.com/StephWangBuilds","linkedin":"https://www.linkedin.com/in/stephaniewang526/ ","bio":"Stephanie is a Java engineer in Developer Relations at Google Cloud Platform. Stephanie primarily focuses on building and maintaining the BigQuery Java Client Libraries which help developers interact with BigQuery APIs more easily. She also works on managing Java dependencies across the 70+ Google Cloud Java Client Libraries to ensure that they work with each other and troubleshoot any dependency problems. Prior to Google, Stephanie worked as a software engineer at Morgan Stanley and led a team of 10 to build sales and trading applications. Outside work, Stephanie is passionate about animals -- she has an insta-famous dog, @sasha_the_shibapoo and a new semi-aquatic @bombshell_the_turtle.","eventIds":["606363"]},{"id":"368442","name":"Alexander Schwartz","firstname":"Alexander","lastname":"Schwartz","company":"msg systems ag","website":"https://www.ahus1.de","twitter":"https://twitter.com/ahus1de","xing":"https://www.xing.com/profile/Alexander_Schwartz","linkedin":"https://www.linkedin.com/in/alexander-schwartz-86b84520/","bio":"Alexander Schwartz arbeitet als Principal IT Consultant bei msg. Im Laufe der Zeit arbeitete er mit verschiedensten Server- und Web-Technologien. Er schätzt produktive Arbeitsumgebungen, agile Projekte und automatisierte Tests. Auf Konferenzen und bei User Groups spricht er über seine Erfahrungen. ","photoId":"2938a008664775ad0f3bc5389f16f8c9","eventIds":["606512","607345"]},{"id":"386382","name":"Gerrit Grunwald","firstname":"Gerrit","lastname":"Grunwald","company":"Karakun AG","website":"harmonic-code.org","twitter":"@hansolo_","bio":"Gerrit Grunwald is a software engineer with more fifteen years of experience in software development. He is a true believer in open source and has participated in popular projects like JFXtras.org as well as his own projects (TilesFX, Medusa, Enzo, SteelSeries Swing, SteelSeries Canvas). \r\nGerrit blogs regularly at http://harmonic-code.org, he is an active member of the Java community, where he founded and leads the Java User Group Münster (Germany), he is a JavaOne rockstar and a Java Champion. He is a speaker at conferences and user groups internationally and writes for several magazines. ","photoId":"d36c2a212a029e6500b9158e62a93588","eventIds":["606966"]},{"id":"371592","name":"Martin Förtsch","firstname":"Martin","lastname":"Förtsch","company":"TNG Technology Consulting GmbH","website":"http://tngtech.com/","twitter":"https://twitter.com/MartinFoertsch","xing":"https://www.xing.com/profile/Martin_Foertsch2","linkedin":"https://www.linkedin.com/in/martinfoertsch","bio":"Martin Förtsch ist ein IT-Berater der TNG Technology Consulting GmbH mit Sitz in Unterföhring bei München und studierte Informatik. Seine Arbeitsschwerpunkte sind Agile Development (hauptsächlich) in Java, Suchmaschinentechnologien, Information Retrieval und Datenbanken. Als Intel Software Innovator und Intel Black Belt Software Developer ist er darüber hinaus intensiv in der Entwicklung von Open-Source Software im Bereich der 3D-Kameratechnologien und dem Internet of Things involviert.\r\nDarüber hinaus hält er zahlreiche Vorträge auf nationalen und internationalen Konferenzen zu den Themen Künstliche Intelligenz, Internet der Dinge, Augmented Reality und Test Driven Development. Er wurde u.a. mit dem Oracle JavaOne Rockstar ausgezeichnet.","photoId":"e93376ef48c648ab465e3d76fccd644e","eventIds":["606384"]},{"id":"364760","name":"Werner Keil","firstname":"Werner","lastname":"Keil","company":"CATMedia UG & Co. KG","website":"http://www.catmedia.site/","twitter":"https://twitter.com/wernerkeil","facebook":"https://www.facebook.com/werner.keil","xing":"https://www.xing.com/profile/Werner_Keil","linkedin":"https://www.linkedin.com/in/catmedia/","bio":"Werner Keil does BDD, Java, Java EE / Jakarta EE, IoT, Security and Microservices. Helping Global 500 clients across industries and IT vendors. He worked for over 30 years as PM, Coach, SW architect and consultant for Finance, Mobile, Media, Transport and Public sector. Werner is Eclipse and Apache Committer, JCP member in JSRs like 354 (Money, also Maintenance Lead), 366 (Java EE 8), 375 (Security), 385 (Units 2.0, also Spec Lead) and Committer member in the Jakarta EE Specification Committee.","photoId":"1379732bde92416b0db8adcfa3270509","eventIds":["606548"]},{"id":"378841","name":"Katherine Stanley","firstname":"Katherine","lastname":"Stanley","company":"IBM UK Limited","twitter":"https://twitter.com/KateStanley91","bio":"Katherine Stanley is a Software Engineer in the IBM Event Streams team based in the UK. Through her work on IBM Event Streams she has gained experience running Apache Kafka on Kubernetes and running enterprise Kafka applications. In her previous role she specialised in cloud native Java applications and microservices architectures. Katherine has co-authored an IBM Redbook on Java microservices and has contributed to the open source microservice project Game On. She enjoys sharing her experiences and has presented at various European conferences, including DevoxxUK and Kafka Summit in London and JFokus in Sweden.","photoId":"1399c59be16d12aceb2012bd6d3686f1","eventIds":["606647"]},{"id":"382456","name":"Arne Limburg","firstname":"Arne","lastname":"Limburg","company":"open knowledge GmbH","eventIds":["606687"]},{"id":"386503","name":"Carsten Hoffmann","firstname":"Carsten","lastname":"Hoffmann","company":"DB Systel GmbH","twitter":"https://twitter.com/morl99","xing":"https://www.xing.com/profile/Carsten_Hoffmann45","bio":"Seitdem Carsten Hoffmann 2010 als Java Entwickler in seine professionelle Karriere gestartet ist, hat er sich unentwegt mit dem Thema Softwarequalität beschäftigt. Er ist dabei zu dem Schluss gekommen, dass Teams vor allem dann hohe Qualität liefern können, wenn eine gute „Developer Experience“ in den zur Verfügung stehenden Tools dies einfach macht. Seit 2017 ist Carsten als \"programmierender Software Architekt\" mit der DB Systel auf die Reise in eine DevOps-Transformation gestartet, und arbeitet dort in einem Plattformteam daran, die Developer Experience für andere DevOps-Teams zu verbessern.","photoId":"dfb291ac7339be51830879308b14493e","eventIds":["606785"]},{"id":"370142","name":"Sebastian Rose","firstname":"Sebastian","lastname":"Rose","twitter":"@srose204","bio":"Sebastian Rose ist Software-Entwickler bei der AOE GmbH. Er interessiert sich für Themen rund um Integration in Unternehmensanwendungen und Handelsplattformen. Dabei ist ein Schwerpunkt die Nutzung von Keycloak als SSO-Komponente. Außerdem interessiert er sich für Scala und aktorbasierte Systeme.","photoId":"47696b2d0e8325647e868048d5bd0f5c","eventIds":["607472","607434","607345"]},{"id":"382436","name":"Johannes Schnatterer","firstname":"Johannes","lastname":"Schnatterer","company":"Cloudogu GmbH","website":"https://www.cloudogu.com/","bio":"-","photoId":"ad65d22ec0420f26fdba62feca0fb498","eventIds":["606420"]},{"id":"354836","name":"Jens Schauder","firstname":"Jens","lastname":"Schauder","company":"Pivotal Software, Inc.","website":"http://blog.schauderhaft.de","twitter":"https://twitter.com/jensschauder","xing":"https://www.xing.com/profile/Jens_Schauder","linkedin":"https://www.linkedin.com/in/jens-schauder","bio":"Jens Schauder hat vor unglaublich langer Zeit auf einem in Assembler programmierbaren Tischrechner angefangen zu programmieren. Nach fast 20 Jahren als Consultant für meist große Konzerne, hat er es 2017 geschafft sich beim Spring Data Team ein zu schleichen. Dort arbeitet er meist an den Modulen Commons, JPA und JDBC, erzählt davon auf Konferenzen oder hilft anderen Entwicklern auf Stackoverflow. ","photoId":"414a71ad5fca408e6565441450b96ef3","eventIds":["606480","606476"]},{"id":"389391","name":"Dr. Alexander Schneider","firstname":"Alexander","lastname":"Schneider","twitter":"https://twitter.com/TheWegi","bio":"Alexander Schneider arbeitet zur Zeit am Aufbau des Startups schnaq.com. Zuvor war er wissenschaftlicher Mitarbeiter an der HHU Düsseldorf. Wenn nicht gerade Pandemien einen Strich durch die Rechnung machen, ist er auch Co-Organisator  der Clojure Usergroup Düsseldorf.","photoId":"feed67cc9877a5007d8844464d8713e8","eventIds":["606789"]},{"id":"389354","name":"Katrin Rabow","firstname":"Katrin","lastname":"Rabow","bio":"Katrin Rabow hat fünfzehn Jahre lang als selbständige Beraterin kleine Unternehmen in ihrem kaufmännischen Alltag unterstützt. Seit 2015 studiert sie Wirtschaftsinformatik an der TU Darmstadt und untersucht gerade im Rahmen ihrer Masterthesis die Auswirkungen von COVID-19 auf die Arbeitsweise agiler Teams.","photoId":"2c0624a5032283e51338aaa1df2ea205","eventIds":["606516"]},{"id":"383362","name":"Dr. Tobias Schröder","firstname":"Tobias","lastname":"Schröder","company":"METRO Digital GmbH","twitter":"https://twitter.com/TbsSchroeder","xing":"https://www.xing.com/profile/Tobias_Schroeder121","linkedin":"https://www.linkedin.com/in/dr-tobias-schr%C3%B6der-8882a382/","bio":"After finishing my academic career with a PhD in dialog-based online argumentation, I decided to join METRO.digital in the mid of 2018. Since then, my colleagues and I are continuously improving METRO's customer wholesale experience. My daily obsession is: Simplify everything while pushing our cultural artifacts further. In my spare time I love to write Clojure, standing in front of my barbecue or lifting dumbbells.","photoId":"ce677692449368b5574010bf992a260f","eventIds":["606372"]},{"id":"364378","name":"Stefan Schlott","firstname":"Stefan","lastname":"Schlott","company":"BeOne Stuttgart GmbH","website":"https://beone-stuttgart.de/","twitter":"https://twitter.com/_skyr","bio":"Dr. Stefan Schlott ist Advisory Consultant bei der Firma BeOne Stuttgart GmbH und dort als Entwickler, Architekt und Trainer im Java-Umfeld tätig. Security und Privacy gehören ebenso zu seinen Schwerpunkten wie skalierbare Architekturen und das breite Feld der verschiedenen Webtechnologien. In seiner Freizeit ist er als Dozent an der Dualen Hochschule Baden-Württemberg aktiv. Er begeistert sich für funktionale Programmierung, moderne Sprachen wie Scala und Rust und ist überzeugter Open-Source'ler.","photoId":"45a0831835c4ba4c0a773dfe1dda866d","eventIds":["606460"]},{"id":"374919","name":"Matt Raible","firstname":"Matt","lastname":"Raible","company":"Okta","twitter":"https://twitter.com/mraible","linkedin":"https://linkedin.com/in/mraible","bio":"Matt Raible is a well-known figure in the Java community and has been building web applications for most of his adult life. For over 20 years, he has helped developers learn and adopt open source frameworks and use them effectively. He's a web developer, Java Champion, and Developer Advocate at Okta. Matt is a frequent contributor to open source and a big fan of Java, IntelliJ, TypeScript, Angular, and Spring Boot. \r\n\r\nHe?s a member of the bad-ass JHipster development team and loves classic VWs. You can find him online at @mraible and https://raibledesigns.com. ","photoId":"9beaf5b2eb9972bdbb959861653d1a8c","eventIds":["606764"]},{"id":"353747","name":"Adam Bien","firstname":"Adam","lastname":"Bien","eventIds":["606335"]},{"id":"376291","name":"Markus Harrer","firstname":"Markus","lastname":"Harrer","company":"innoQ Deutschland GmbH","website":"https://www.markusharrer.de","twitter":"https://twitter.com/feststelltaste","facebook":"http://","xing":"https://www.xing.com/profile/Markus_Harrer6","linkedin":"https://www.linkedin.com/in/markus-harrer/","bio":"Markus Harrer arbeitet seit über elf Jahren in der Softwareentwicklung innerhalb konservativer Branchen. Seine Spezialgebiete sind Software Analytics, Softwaresanierung und Clean Code. Als Berater bei INNOQ zeigt er, wie mit Hilfe von datenzentrierten, nachvollziehbaren Analysen Softwareprodukte nachhaltig und strategisch sinnvoll verbessert werden können.","photoId":"5fdeef9041e3d45bb89b5dbc43903ec3","eventIds":["606528","606607"]},{"id":"386430","name":"Emily Jiang","firstname":"Emily","lastname":"Jiang","company":"IBM","twitter":"@emilyfhjiang","linkedin":"https://www.linkedin.com/in/emilyfhjiang/","bio":"Emily Jiang is a Java Champion. She is Liberty Microservices Architect and Advocate, Senior Technical Staff Member (STSM) @IBM, based at Hursley Lab in the UK. Emily is MicroProfile guru and has been working on MicroProfile since 2016 and leads the specifications of MicroProfile Config, Fault Tolerance and Service Mesh. She is a CDI Expert Group member. \r\n \r\nShe is passionate about Java, MicroProfile, and Jakarta EE. She regularly speaks at conferences, such as QCon, Code One, Devoxx, DevNexus, JAX, Voxxed, EclipseCon, GeeCon, JFokus, etc. You can find her on Twitter @emilyfhjiang and LinkedIn (https://www.linkedin.com/in/emilyfhjiang/).","eventIds":["606595","606558"]},{"id":"388985","name":"Sandra Gerberding","firstname":"Sandra","lastname":"Gerberding","twitter":"https://twitter.com/stgerberding","xing":"https://www.xing.com/profile/Sandra_Gerberding/cv","bio":"Sandra Gerberding ist ein Software Developer aus Leidenschaft. Ihre Reise begann in der 8. Klasse im Informatikunterricht, bis jetzt hat sie viele Station auf ihrer Reise mitgenommen, die ihre Fähigkeiten als Software Developer geprägt haben: Diplom in der Informatik, Spieleentwicklung, Java-Webentwicklung, Themen wie DevOps, CI, CD.\r\nSandra arbeitet als Senior DevOps Engineer bei der smartsteuer GmbH.","eventIds":["606724"]},{"id":"374971","name":"Michal Harakal","firstname":"Michal","lastname":"Harakal","website":"https://harakal.de/","bio":"Michal Harakal arbeitet seit 2010 als Android Entwickler bei der Deutschen Telekom AG. In die spannende Welt der mobilen Geräte ist er nach einer langjährigen Berufserfahrung als Entwickler von Mess- und Datenauswertung Systemen und später auch Steuerungen für industriellen Maschinen gewechselt. Sein Werkzeugkasten, in dem Java und Kotlin einen besonderen Platz haben, ist vielseitig gefüllt. Bei Android ist er von der ersten Stunde dabei. Michal teilt gerne seine Erfahrung und ist im Open Source Projekten aktiv.","photoId":"742d1c96551f2a5ed8c2386aff9b9b22","eventIds":["607447","606732"]},{"id":"378753","name":"Nils Hartmann","firstname":"Nils","lastname":"Hartmann","company":" ","website":"https://nilshartmann.net","twitter":"https://twitter.com/nilshartmann","xing":"https://www.xing.com/profile/Nils_Hartmann2","bio":"Nils Hartmann ist freiberuflicher Softwareentwickler, -architekt und Trainer aus Hamburg. Er programmiert in Java und JavaScript/TypeScript mit dem Schwerpunkt auf server- und clientseitiger Entwicklung von Enterprise Anwendungen. Nils spricht auf Konferenzen und bietet Workshops und Schulungen an. Nils ist Koautor des Buchs ?React ? Die praktische Einführung in React, React Router und Redux? (dpunkt.Verlag).","photoId":"ccf8b926940d8f57837c1aad50f3df02","eventIds":["606464","606327"]},{"id":"364065","name":"Ralf Müller","firstname":"Ralf","lastname":"Müller","company":"DB Systel GmbH","website":"https://docs-as-co.de","twitter":"https://twitter.com/RalfDMueller","xing":"https://www.xing.com/profile/RalfD_Mueller","linkedin":"https://www.linkedin.com/in/rdmueller","bio":"Ralf D. Müller ist ambitionierter Groovy & Grails-Entwickler und versucht stetig, seine Arbeit weiter zu vereinfachen. Zurzeit beschäftigt er sich insbesondere mit der Verbesserung der ganzheitlichen Dokumentation von Systemen, vor allem mit Hilfe des arc42-Templates und AsciiDoc.\r\n\r\nEr arbeitet als Software Engineering Advocate bei der DB Systel, der IT-Tochter und Digitalpartner der Deutschen Bahn.","photoId":"0846cdc3ff3649cf07b2013213e0f975","eventIds":["606554"]},{"id":"389877","name":"Grace Jansen","firstname":"Grace","lastname":"Jansen","company":"IBM UK","twitter":"https://twitter.com/gracejansen27","linkedin":"https://www.linkedin.com/in/grace-jansen/","bio":"Grace is a Developer Advocate at IBM, working with Open Liberty and Reactive Technologies. She has been with IBM since graduating from Exeter University with a Degree in Biology. Grace enjoys bringing a varied perspective to her projects and using her knowledge of biological systems to simplify complex software patterns and architectures. As a developer advocate, Grace builds POC’s, demos and sample applications, and writes guides and tutorials. She is a regular presenter at international technology conferences and has recently authored a book on reactive systems. Grace also has a keen passion for encouraging more women into STEM and especially Technology careers.","eventIds":["607192"]},{"id":"353543","name":"Ed Burns","firstname":"Ed","lastname":"Burns","company":"Microsoft","website":"http://ridingthecrest.com/","twitter":"http://twitter.com/edburns","xing":"https://www.xing.com/profile/Edward_Burns","linkedin":"https://www.linkedin.com/in/edburns/","bio":"Ed Burns is currently Principal Architect on the Java Tooling and Experiences team at Microsoft. In this role, Ed will help make Azure the best place for Enterprise Java. Prior to joining Microsoft, Ed was a Consulting Member of the Technical Staff At Oracle. Ed has worked on a wide variety of client and server side web technologies since 1994, including NCSA Mosaic, Mozilla, the Sun Java Plugin, Jakarta Tomcat and, most extensively, JavaServer Faces, on which he is the co-spec lead. Ed is also the co-spec lead for the Servlet specification. Ed is an experienced international conference speaker, with consistently high attendance numbers and ratings at JavaOne (Rockstar award winner 2016), Devoxx, DevNexus, JAOO, JAX, W-JAX, No Fluff Just Stuff, JA-SIG, The Ajax Experience, and Java and Linux User Groups. He has published four books with McGraw-Hill, JavaServerFaces: The Complete Reference (2006), Secrets of the Rockstar Programmers: Riding the IT crest (2008) JavaServer Faces 2.0: The Complete Reference (2010) and Hudson Continuous Integration In Practice (2013).","photoId":"1137210b4a9f037e30caa5ba0a193106","eventIds":["606558"]},{"id":"369502","name":"Anna Maier","firstname":"Anna","lastname":"Maier","company":"TOPdesk Deutschland GmbH","bio":"Anna Maier (@a_n_n_a_m) is a software developer at TOPdesk and co-founder of the JUG Kaiserslautern. She is programming backend and frontend code and advocates for accessibility.","eventIds":["606772"]},{"id":"382598","name":"Martin Lippert","firstname":"Martin","lastname":"Lippert","company":"VMware","twitter":"http://twitter.com/martinlippert","bio":"Martin arbeitet bei VMware an Entwicklungswerkzeugen und IDEs für Spring und Spring Boot. Er ist langjähriges aktives Mitglied der Eclipse Community, diente im Program Committee für zahlreiche internationale Konferenzen und blickt auf eine lange Historie von Konferenzvorträgen zurück. Er liebt es besonders, Vorträge hauptsächlich aus Livedemos zusammenzusetzen, über eigene Projekte zu sprechen und das Publikum für Neues zu begeistern. Das Thema Sustainability liegt ihm dabei besonders am Herzen.","photoId":"1e0271991b2d8366cfa62966192e3724","eventIds":["606339","606343"]},{"id":"380385","name":"Holger Fähnrich","firstname":"Holger","lastname":"Fähnrich","company":"Finanz-DATA GmbH","twitter":"https://twitter.com/faehne","xing":"https://www.xing.com/profile/Holger_Faehnrich2","linkedin":"https://www.linkedin.com/in/holger-f%C3%A4hnrich-7aa30ab/","bio":"Hier könnte Ihr Javacode stehen...","photoId":"32b2c381a56ed4f04fec4ee22f437f71","eventIds":["606436"]},{"id":"380030","name":"Birgit Kratz","firstname":"Birgit","lastname":"Kratz","company":" ","eventIds":["606719"]},{"id":"386287","name":"Georg Haupt","firstname":"Georg","lastname":"Haupt","company":"oose Innovative Informatik eG","website":"http://oose.de","xing":"https://www.xing.com/profile/Georg_Haupt3","linkedin":"https://www.linkedin.com/in/georg-haupt-8603a460/","bio":"Ich lege besonderen Wert auf eine ausgewogene Mischung zwischen manuellen/explorativen und automatisierten Tests. Das Entwickeln und Etablieren von Testmethoden und Prozessen ist für mich langjährige Praxis. Darüber hinaus biete ich Ihnen praktische Erfahrung in der Einführung von Test- und Testmanagementwerkzeuge.\r\n\r\nPrivat bin ich ein experimentell verspielter Technikfreak, über 20 Jahre DJ, Webradiomoderator und Cineast. Aber nichts ist schöner als ein anständiger Wein mit der Familie, entweder bei einem guten Film im Heimkino oder beim Brettspiel.","photoId":"7633acf3dc8a341f88723c03be2704ac","eventIds":["606368"]},{"id":"389367","name":"Björn Stahl","firstname":"Björn","lastname":"Stahl","website":"https://www.lucanet.de/","twitter":"https://twitter.com/Mr__Steel","bio":"Björn Stahl ist Senior Java Developer bei der LucaNet AG und arbeitet im Team Performance. Dort kümmert er sich um die Analyse von Performance-Problemen und testet und entwickelt Tools, die die Analysen vereinfachen. Nebenbei beschäftigt er sich weiter mit Microservices, High Traffic Low Latency Applications und Garbage Collection sowie Performance Tuning.","photoId":"813f92ce9c54657a1517f91c822ae317","eventIds":["606532"]},{"id":"379082","name":"Stephan Pirnbaum","firstname":"Stephan","lastname":"Pirnbaum","company":"buschmais GbR","website":"http://www.buschmais.de/","twitter":"https://twitter.com/spirnbaum","facebook":"https://www.facebook.com/buschmais","xing":"https://www.xing.com/profile/Stephan_Pirnbaum","linkedin":"https://www.linkedin.com/in/stephan-pirnbaum/","bio":"Stephan Pirnbaum ist Consultant bei der BUSCHMAIS GbR. Er beschäftigt sich leidenschaftlich gern mit der Analyse und strukturellen Verbesserung von Softwaresystemen im Java-Umfeld. In Vorträgen und Workshops präsentiert er seine gesammelten Erfahrungen und genutzten Methodiken.","photoId":"a5682cfd6e67d6df3b78716a17f0565d","eventIds":["606627"]},{"id":"381737","name":"Tim Zöller","firstname":"Tim","lastname":"Zöller","company":"lambdaschmiede GmbH","website":"https://www.tim-zoeller.de/","twitter":"https://twitter.com/javahippie","xing":"https://www.xing.com/profile/Tim_Zoeller2","linkedin":"https://www.linkedin.com/in/timzoeller/","bio":"Tim arbeitet seit über 12 Jahren als Java-Entwickler. Er ist Mitgründer der JUG Mainz und der Firma lambdaschmiede GmbH.","photoId":"75e0448121cc8df9d3fe3179cef3ad42","eventIds":["606671"]},{"id":"382429","name":"Corinna Wiedenmann","firstname":"Corinna","lastname":"Wiedenmann","company":"Freshfields","eventIds":["606781"]},{"id":"386820","name":"Peter Nagy","firstname":"Peter","lastname":"Nagy","company":"Oracle Hungary kft.","eventIds":["606416"]},{"id":"374910","name":"Nicolai Parlog","firstname":"Nicolai","lastname":"Parlog","website":"https://nipafx.dev","twitter":"https://twitter.com/nipafx","bio":"Nicolai (aka nipafx) is a Java enthusiast focused on language features and core APIs with a passion for learning and sharing. He does that in blog posts, articles, newsletters, and books; in tweets, repos, videos, and streams; at conferences and in-house trainings - more on all of that on https://nipafx.dev. That aside, he's best known for his haircut.\r\n","photoId":"b594449a5179efe77bd128a85c5f68a5","eventIds":["606740"]},{"id":"370942","name":"Henning Schwentner","firstname":"Henning","lastname":"Schwentner","company":"WPS - Workplace Solutions GmbH","website":"www.wps.de/hs","twitter":"https://twitter.com/hschwentner","bio":"Henning liebt Programmieren in hoher Qualität. Diese Leidenschaft lebt er als Software-Architekt, Berater und Entwickler bei der WPS ? Workplace Solutions aus. Seine Projekte sind Domain-Driven, agil und in Programmiersprachen wie Java und C# aber auch ABAP. Ihn interessieren Menschen, langlebige Softwarearchitekturen, große Refactorings und die Evolution von Programmiersprachen. Gerade hat er »Domain-Driven Design kompakt« von Vaughn Vernon ins Deutsche übersetzt.","photoId":"712cec1957c0190ba0fd603bbe3d3b28","eventIds":["606484"]},{"id":"386019","name":"Andre Ippisch","firstname":"Andre","lastname":"Ippisch","bio":"Andre ist seit über acht Jahren leidenschaftlicher Android-Entwickler.\r\nEr hat für seine Promotion eine Android-App zur Kommunikation in Krisen- und Zensurgebieten entwickelt und arbeitet zurzeit als Tech Lead der Mobile Commerce-Abteilung bei der METRO.digital in Düsseldorf.","eventIds":["607426","607502"]},{"id":"386792","name":"Maik Figura","firstname":"Maik","lastname":"Figura","company":"codecentric AG","eventIds":["606331"]},{"id":"365736","name":"Stephan Kaps","firstname":"Stephan","lastname":"Kaps","company":"KITENCO","website":"http://www.kitenco.de","twitter":"https://twitter.com/kitenco1","bio":"Stephan Kaps leitet die Softwareentwicklung im Bundesamt für Soziale Sicherung und ist Gründer der Java User Group Bonn. Als Software-Architekt und Entwickler hat er seit 2002 mit Java zu tun. Weitere Schwerpunkte liegen in der Konzipierung und Optimierung von Software-Entwicklungsprozessen, DevOps & OpenSource Werkzeugen. Darüber hinaus ist er als Speaker und Autor aktiv.","photoId":"60f9a1e4784e459acf6c89e6c8e67582","eventIds":["606444","606448"]},{"id":"371530","name":"Bert Jan Schrijver","firstname":"Bert Jan","lastname":"Schrijver","company":"OpenValue","website":"https://www.openvalue.de","twitter":"https://twitter.com/bjschrijver","bio":"Bert Jan is CTO at OpenValue and focuses on Java, Continuous Delivery and DevOps. Bert Jan is a Java Champion, JavaOne Rock Star speaker, Duke's Choice Award winner and leads NLJUG, the Dutch Java User Group. He loves to share his experience by speaking at conferences, writing for the Dutch Java magazine and helping out Devoxx4Kids with teaching kids how to code. Bert Jan is easily reachable on Twitter at @bjschrijver.","photoId":"d8c9a6153ace67b15377e4f6b68416df","eventIds":["606890"]},{"id":"382173","name":"Jochen Christ","firstname":"Jochen","lastname":"Christ","company":"INNOQ","bio":"Jochen Christ ist Senior Consultant bei INNOQ. Er ist Spezialist für Software-Architekturen mit Fokus auf Self-Contained Systems, modernen Java-Technologien und Cloud-Computing. Als Technical Lead fördert und fordert er Teams bei der Umsetzung komplexer Transformationen. Jochen ist Maintainer von rest-feeds.org und Co-Autor von remotemobprogramming.org.","photoId":"a24f0d7dc6b9984a018660d35fef3d34","eventIds":["606744"]},{"id":"371318","name":"Gregor Trefs","firstname":"Gregor","lastname":"Trefs","twitter":"https://twitter.com/gtrefs","bio":"Gregor ist einer der Organisatoren der Java User Group in Mannheim und Software Development Manager. Sein erstes Programm war ein in BASIC geschriebenes Text Adventure. Inzwischen schreibt er ab und zu ein paar Artikel in seinem Blog, hÃ¤lt VortrÃ¤ge und Workshops.","photoId":"feb8267ce4475b529da568d5f74d4d11","eventIds":["607467"]},{"id":"384997","name":"Thomas Südbröcker","firstname":"Thomas","lastname":"Südbröcker","company":"IBM Deutschland","twitter":"https://twitter.com/tsuedbroecker","linkedin":"https://www.linkedin.com/in/thomassuedbroecker/","bio":"Thomas is Developer Advocate and aims to provide help and guidance for developers to become familiar with cloud development topics and how to use relevant CICD in IBM Cloud. He is currently focusing on Microservices, containers running on Kubernetes or RedHat OpenShift. He follows the guideline: “You may fall down, but you have to get up again!\"\r\n\r\n-------\r\nThomas ist Developer Advocate und hat das Ziel, Entwicklern Hilfe und Anleitungen zur Verfügung zu stellen, um sich mit Cloud-Entwicklungsthemen und der Verwendung relevanter CICD in IBM Cloud vertraut zu machen. Derzeit konzentriert er sich auf Microservices, Container, die auf Kubernetes oder RedHat OpenShift ausgeführt werden. Er folgt der Richtlinie: \"Man darf hinfallen, aber man muss immer wieder aufstehen!\"\r\n","eventIds":["607236"]},{"id":"389383","name":"Nora Schöner","firstname":"Nora","lastname":"Schöner","bio":"Nora Schöner, a German based Cloud Engineer, has been working in the tech industry since 2012. Among other things, she focuses on Cloud Computing and DevOps. You can find her mainly working with Amazon Web Services. Currently Nora works at CodeCamp:N, a Startup based in Nuremberg, providing and maintaining the infrastructure of one of the projects challenging digital personal provision. Since this year she shares her knowledge and experiences through her German tech blog https://wolkencode.de","photoId":"3ac90cf2486a0bb46d64b6264b793c7d","eventIds":["606591"]},{"id":"364537","name":"Jochen Mader","firstname":"Jochen","lastname":"Mader","company":"Instana GmbH","website":"http://codepitbull.de","twitter":"https://twitter.com/codepitbull","bio":"Als C64-Nerd aufgewachsen, nach einer Wanderschaft von Basic über C bis Assembly irgendwie auf der JVM gelandet. Hab mich verliebt und bin seither viel (aber nicht ausschließlich) mit Projekten rund um Selbige beschäftigt. Die letzten Jahre habe ich mich ausgiebig mit reaktiven Anwendungsframeworks (Akka und Vert.x), Fast Data Infrastrukturen und verteilten Systemen beschäftigt. Neben meiner Haupttätigkeit bei codecentric bin ich auf Konferenzen als Speaker anzutreffen, schreibe für diverse Fachmagazine und bin Maintainer im Vert.x-Projekt.\r\n","photoId":"3503bcbaf1c05ebc6c18fed5aa71bb2e","eventIds":["606679"]},{"id":"365399","name":"Markus Karg","firstname":"Markus","lastname":"Karg","company":"Markus Karg, Staatlich geprüfter Informatiker","website":"http://www.headcrashing.eu","twitter":"https://twitter.com/mkarg","xing":"https://www.xing.com/profile/Markus_Karg","bio":"Markus Karg hat den JAX-RS-Standard mitentwickelt und gibt seine über 30jährige Programmiererfahrung als Fachautor, Consultant und Conference Speaker weiter. Zudem ist er an zahlreichen Open Source Projekten beteiligt und verantwortet einen Produktbereich bei einem mittelständischen deutschen ISV (independent software vendor). Er ist Gründer und Sprecher der Java User Group Goldstadt (JUG PF) sowie Committer Member der Eclipse Foundation.","photoId":"68bbec4b4e863f7356d7018d29788608","eventIds":["607353","607405"]},{"id":"389335","name":"Dr. Andreas Brunnert","firstname":"Andreas","lastname":"Brunnert","company":"RETIT GmbH","website":"https://www.retit.de","twitter":"https://twitter.com/a_brunnert","xing":"https://www.xing.com/profile/Andreas_Brunnert","linkedin":"https://www.linkedin.com/in/andreasbrunnert/","bio":"Andreas ist Gründer der RETIT GmbH. Mit seinem Team arbeitet er kontinuierlich daran, die Performance komplexer Enterprise-Anwendungen zu optimieren. Hierzu nutzen sie eine Kombination von mess- und modellbasierten Performance-Evaluationsansätzen, um im gesamten Anwendungslebenszyklus optimale Lösungen zu finden. ","photoId":"5d0b16aebbb4b91c1be495d7b30c62ff","eventIds":["606456"]},{"id":"386370","name":"Stefan Zörner","firstname":"Stefan","lastname":"Zörner","company":"embarc Software Consulting GmbH","eventIds":["606536"]},{"id":"364385","name":"Kai Tödter","firstname":"Kai","lastname":"Tödter","company":"Siemens AG","twitter":"https://twitter.com/kaitoedter","eventIds":["606500"]},{"id":"364381","name":"Ingo Düppe","firstname":"Ingo","lastname":"Düppe","company":"CROWDCODE GmbH & Co. KG","website":"http://www.crowdcode.io","twitter":"https://twitter.com/javacoding","xing":"https://www.xing.com/profile/Ingo_Dueppe","linkedin":"https://www.linkedin.com/in/ingodueppe/","bio":"Ingo Düppe ist IT-Berater und Gründer von CROWDCODE. Er berät Unternehmen auf dem Gebiet des agilen Architekturmanagements und ist für die Realisierung und Konzeption von Web-, Mobile- und Cloud-Anwendungen verantwortlich. Das evolutionäre Ziel: die kontinuierliche Steigerung der Automatisierung von Unternehmensprozessen. Seine langjährige Erfahrung bringt er bei der Konzeption und Entwicklung von Anwendungen ein. Herausforderung ist die effektive und effiziente Kombination von Technologien, Methoden und Werkzeugen ? jeweils passend zum individuellen Kontext.  Als Coach und Trainer berät er Teams beim Einsatz von Java EE- und Spring-Technologien sowie deren effiziente Einbindung in den individuellen Softwareentwicklungsprozess.","photoId":"745286ece5fbd1a6acb1845a75c8c351","eventIds":["606703"]},{"id":"386301","name":"Vaughn Vernon","firstname":"Vaughn","lastname":"Vernon","company":"Kalele Inc.","website":"https://vlingo.io","twitter":"https://twitter.com/VaughnVernon","linkedin":"https://www.linkedin.com/in/vaughnvernon/","bio":"Vaughn Vernon is the founder and chief architect of the vlingo/PLATFORM. A software developer and architect with more than 35 years of experience in a broad range of business domains, Vaughn is a leading expert in domain-driven design (DDD), champion of simplicity and reactive systems. The open source, DDD-friendly, reactive vlingo/PLATFORM is one example of his commitment to balancing the right technology choices with every essential and unique business vision. He consults on and teaches DDD and reactive software development, helping teams and organizations realize the potential of business-driven and reactive systems as they transition from technology-driven legacy web implementation approaches, putting a strong emphasis on embracing simplicity whenever possible. Vaughn is the author of three books: Implementing Domain-Driven Design, Domain-Driven Design Distilled, and Reactive Messaging Patterns with the Actor Model, all published by Addison-Wesley.","photoId":"56e360facdd767534bc50e71b096997e","eventIds":["606768"]},{"id":"369728","name":"Oliver Milke","firstname":"Oliver","lastname":"Milke","company":"Cloudogu GmbH","twitter":"https://twitter.com/OliverMilke","xing":"https://www.xing.com/profile/Oliver_Milke3","bio":"dev at heart, involved in 4Kids, co-orga of JUG Ostfalen, co-founder @ithubbs | gym aficionado and free athlete, board gamer | working @cloudogu ","photoId":"4d5ae35bf1d275608f9b6651b6c9ab7f","eventIds":["607440"]},{"id":"368607","name":"Geoffrey De Smet","firstname":"Geoffrey","lastname":"De Smet","company":"Red Hat","website":"https://www.optaplanner.org/","twitter":"https://twitter.com/GeoffreyDeSmet","linkedin":"https://www.linkedin.com/in/ge0ffrey/","bio":"Geoffrey De Smet is the founder and lead of OptaPlanner (www.optaplanner.org), the open source AI constraint solver in Java that is used across the globe to automatically solve employee rostering, vehicle routing, task assignment, maintenance scheduling and other planning problems.","photoId":"98b84f2d82cf92450110490b3f0acc97","eventIds":["606390"]},{"id":"355102","name":"Dirk Weil","firstname":"Dirk","lastname":"Weil","company":"GEDOPLAN GmbH","website":"http://gedoplan.de/","twitter":"https://twitter.com/dirkweil","xing":"https://www.xing.com/profile/Dirk_Weil2","linkedin":"https://www.linkedin.com/in/dirk-weil-49940683/","bio":"Dirk Weil ist seit 1998 als Berater im Bereich Java tätig. Als Geschäftsführer der GEDOPLAN GmbH in Bielefeld ist er für die Konzeption und Realisierung von Informationssystemen auf Basis von Java EE verantwortlich. Seine langjährige Erfahrung in der Entwicklung anspruchsvoller Unternehmenslösungen machen ihn zu einem kompetenten Ansprechpartner und anerkannten Experten auf dem Gebiet Java EE. Er ist Fachbuchautor, schreibt Artikel für Fachmagazine, hält Vorträge und leitet Seminare und Workshops zu diversen Java-SE-/EE-Themen. ","eventIds":["606623"]},{"id":"382169","name":"Maarten Mulders","firstname":"Maarten","lastname":"Mulders","company":"Info Support","website":"https://maarten.mulders.it","twitter":"https://twitter.com/mthmulders","linkedin":"https://www.linkedin.com/in/mthmulders/","bio":"Passionate architect, senior developer and trainer at Info Support. Also Oracle Groundbreaker Ambassador. I'm eager about \"building the right thing\" and \"building the thing right\". I focus on lean and elegant solutions, and I love to share new ideas and knowledge. Outside work, I appreciate crafting and eating good food, photography, and music, in no particular order.","photoId":"ded9920af3af1f8b98106afeaa778e88","eventIds":["606323"]},{"id":"369887","name":"Thorben Janssen","firstname":"Thorben","lastname":"Janssen","website":"https://www.thoughts-on-java.org","twitter":"https://twitter.com/thjanssen123","facebook":"https://www.facebook.com/thoughtsonjava","xing":"https://www.xing.com/profile/Thorben_Janssen","linkedin":"https://www.linkedin.com/in/thorbenjanssen/","bio":"Thorben Janssen löst als freiberuflicher Consultant und Trainer Persistenzprobleme mit JPA und Hibernate. \r\nEr ist Autor des Amazon Bestsellers Hibernate Tips - More than 70 solutions to common Hibernate problems und internationaler Redner mit mehr als 15 Jahren Erfahrung in der Entwicklung von Anwendungen auf Basis von JPA und Hibernate.\r\nAuf seinem Blog www.thoughts-on-java.org schreibt er mehrmals wöchentlich über JPA, Hibernate und andere Persistenztechnologien.","photoId":"fe91e95f8b09e95dab969b44228b64b5","eventIds":["606488","606492"]},{"id":"371813","name":"Lars Röwekamp","firstname":"Lars","lastname":"Röwekamp","company":"open knowledge GmbH","twitter":"https://twitter.com/mobilelarson","eventIds":["606615","606611"]},{"id":"357053","name":"Simon Ritter","firstname":"Simon","lastname":"Ritter","company":"Azul Systems","website":"www.azul.com","twitter":"speakjava","bio":"Simon Ritter is the Deputy CTO of Azul Systems.  Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. \r\n\r\nSimon joined Sun Microsystems in 1996 and started working with Java technology from JDK 1.0; he has spent time working in both Java development and consultancy.  Having moved to Oracle as part of the Sun acquisition, he managed the Java Evangelism team for the core Java platform, Java for client applications and embedded Java.  Now at Azul, he continues to help people understand Java as well as Azul?s JVM technologies and products.  Simon has twice been awarded Java Rockstar status at JavaOne and is a Java Champion.  He currently represents Azul on the JCP Executive Committee and on the Java SE Expert Group (JSR 379 and JSR 383).","photoId":"c1cf2ac18ba65cf61c9b6dbc07d583f5","eventIds":["606667"]},{"id":"386266","name":"René Heck","firstname":"René","lastname":"Heck","eventIds":["606777"]},{"id":"387954","name":"Thorben Kuck","firstname":"Thorben","lastname":"Kuck","company":"OPEN KNOWLEDGE GmbH","eventIds":["606912"]},{"id":"371568","name":"Hanno Embregts","firstname":"Hanno","lastname":"Embregts","company":"Info Support","website":"https://hannotify.github.io/","twitter":"https://twitter.com/hannotify","linkedin":"https://www.linkedin.com/in/hannoembregts/","bio":"Hanno Embregts is a Java Developer, Speaker and Teacher at Info Support (the Netherlands). He has over 12 years experience with both front- and back-end development, with a special interest in automating the software development process to the fullest. He likes his work best when it is fast-paced and versatile, which is why he juggles Java development, public speaking and teaching courses at Info Support?s Knowledge Centre. When Hanno doesn?t have access to any kind of computer - which can only be called the most desperate of times - he plays in a band as a lead singer and guitar player. He is also a passionate fan of alternative rock band Switchfoot and Dutch football club Feyenoord. Last but not least: he has been told off repeatedly for using Star Wars quotes at work (things didn?t improve much by replying ?I find your lack of faith disturbing?).","photoId":"1e36b01fa656496aac907497ef35b8ec","eventIds":["606394"]},{"id":"368392","name":"Christian Kaltepoth","firstname":"Christian","lastname":"Kaltepoth","company":"ingenit GmbH & Co. KG","twitter":"https://twitter.com/chkal","eventIds":["606639"]},{"id":"389305","name":"Sandra Parsick","firstname":"Sandra","lastname":"Parsick","eventIds":["606428"]},{"id":"382495","name":"Jen Tong","firstname":"Jen","lastname":"Tong","company":"Google","website":"https://jen.run","twitter":"https://twitter.com/MimmingCodes","bio":"Jen is a Security Advocate on Google Cloud Platform. In this role she helps developers and IT professionals stay out of trouble while getting the most out of cloud computing. If she?s away from her laptop, she?s probably playing ice hockey, or hanging from aerial silk.","photoId":"a13b21e5f936af738b266ae1257cb93b","eventIds":["606760"]},{"id":"364707","name":"Ivar Grimstad","firstname":"Ivar","lastname":"Grimstad","company":"Eclipse Foundation","website":"https://jakarta.ee","twitter":"https://twitter.com/ivar_grimstad","linkedin":"https://www.linkedin.com/in/ivargrimstad","bio":"Ivar Grimstad is the Jakarta EE Developer Advocate at Eclipse Foundation. He is a Java Champion, and JUG Leader based in Sweden.\r\n\r\nIvar is the PMC Lead for Eclipse Enterprise for Java (EE4J) and involved in the Jakarta EE Working Group. He is also one of the community representatives in the JCP Executive Committee as well as specification lead for JSR 371 (MVC 1.0).\r\n\r\nIvar is also involved in Eclipse MicroProfile, Apache NetBeans and a frequent speaker at International developer conferences.","photoId":"011bc16ea1fe18a68a53c603764e6d32","eventIds":["606315","606548"]},{"id":"356530","name":"Bernd Müller","firstname":"Bernd","lastname":"Müller","company":"Ostfalia","bio":"Nach seinem Studium der Informatik und der Promotion arbeitete Bernd Müller für die IBM und die HDI Informationssysteme. Er ist Professor, Geschäftsführer, Autor mehrerer Bücher zu den Themen JSF und JPA, sowie Speaker auf nationalen und internationalen Konferenzen. Er engagiert sich im iJUG und speziell in der JUG Ostfalen.","eventIds":["606412"]},{"id":"389310","name":"Nils Hyoma","firstname":"Nils","lastname":"Hyoma","company":"WPS ? Workplace Solutions GmbH","eventIds":["606524"]},{"id":"370059","name":"Gregor Tudan","firstname":"Gregor","lastname":"Tudan","company":"Cofinpro AG","website":"https://cofinpro.de","twitter":"https://twitter.com/cofinpro_greg","bio":"Gregor Tudan ist IT-Consultant bei der Cofinpro AG, einem Beratungshaus mit Schwerpunkt in der Finanzindustrie. Aktuell beschäftigt er sich mit dem Rollout und Whitelabeling der Java-EE-basierten Onlineplattform der MeinInvest auf 500 Genossenschaftsbanken.","photoId":"2593f0cd6d2ab8162d6433c1f0537cc0","eventIds":["606675"]},{"id":"381314","name":"Ixchel Ruiz","firstname":"Ixchel","lastname":"Ruiz","company":"Karakun AG","eventIds":["607417","607376"]},{"id":"375163","name":"Anton Epple","firstname":"Anton","lastname":"Epple","company":"Dukehoff GmbH","twitter":"https://twitter.com/monacotoni","eventIds":["606520"]},{"id":"389373","name":"julien lengrand-lambert","firstname":"julien","lastname":"lengrand-lambert","company":" ","website":"https://lengrand.fr","twitter":"https://twitter.com/jlengrand","linkedin":"https://www.linkedin.com/in/julienlengrand/","bio":"Developer and Community builder @ing. I create 'islands' were engineers are the heroes.\r\nI am a software developer working for 10 years in the industry. I worked in multiple fields, from embedded electronics and image processing, to banking. I mostly work on JVM languages like Java and Kotlin, and all their associated ecosystem.","photoId":"6cc746c3b418edefc0f89a2505362556","eventIds":["606587"]},{"id":"368565","name":"Eberhard Wolff","firstname":"Eberhard","lastname":"Wolff","company":"innoQ Deutschland GmbH","website":"http://ewolff.com","twitter":"https://twitter.com/ewolff","xing":"https://www.xing.com/profile/Eberhard_Wolff/","linkedin":"https://www.linkedin.com/in/eberhardwolff/","bio":"Eberhard Wolff ist Fellow bei INNOQ und arbeitet seit mehr als fünfzehn Jahren als Architekt und Berater, oft an der Schnittstelle zwischen Business und Technologie. Er ist Autor zahlreicher Artikel und Bücher, u.a. zu Continuous Delivery und Microservices und trägt regelmäßig als Sprecher auf internationalen Konferenzen vor. Sein technologischer Schwerpunkt sind moderne Architektur- und Entwicklungsansätze wie Cloud, Continuous Delivery, DevOps und Microservices.","photoId":"536c70abc14849ae39b36036b7a624d7","eventIds":["606643"]},{"id":"358673","name":"Wolfgang Fahl","firstname":"Wolfgang","lastname":"Fahl","company":"BITPlan - smart solutions","eventIds":["606752"]},{"id":"389617","name":"Pia Diedam","firstname":"Pia","lastname":"Diedam","company":"viadee Unternehmensberatung AG","twitter":"@piadiedam","xing":"https://www.xing.com/profile/Pia_Diedam/","bio":"Pia Diedam ist seit 2017 Beraterin bei der viadee Unternehmensberatung. Seit dem Studium der Wirtschaftsinformatik ist sie sowohl im internen Forschungs- und Entwicklungsbereich, als auch extern im Kundeneinsatz an Java-Projekten beteiligt. Sie ist begeistert von dem Zusammenspiel unterschiedlicher Systeme und interessiert sich für moderne Softwarearchitekturen.","eventIds":["606904"]},{"id":"382192","name":"Sven Peters","firstname":"Sven","lastname":"Peters","company":"K15t","eventIds":["606432"]},{"id":"378902","name":"Simon Skoczylas","firstname":"Simon","lastname":"Skoczylas","company":"Karakun AG","website":"https://www.skoczylas.net/","twitter":"https://twitter.com/giftkugel","xing":"https://www.xing.com/profile/Simon_Skoczylas","linkedin":"https://www.linkedin.com/in/simon-skoczylas-29724238","bio":"Software engineer, lateral thinker and passionate web developer. Software developer since 2001. Battled IE6 in the past. Full-stack web developer with focus on JavaScript and Java.  ","photoId":"e55feef8633331782fe73978f3b461c2","eventIds":["606736"]},{"id":"389334","name":"Ko Turk","firstname":"Ko","lastname":"Turk","company":"Senior Java Developer","twitter":"https://twitter.com/KoTurk77","linkedin":"https://www.linkedin.com/in/ko-turk-b271b929/","bio":"Hi! My name is Ko Turk (@KoTurk77), working as a Senior Java Developer for Blue4IT and currently on an assignment at Rabobank. Besides working on creating bad ass software, I’d like to speak at conferences such as JavaZone Oslo, DevNexus Atlanta and of course our own J-Fall. You can find me regularly at the UtrechtJUG.","photoId":"abb453bc751bc9aa549a0d207f660ea8","eventIds":["606452"]},{"id":"366601","name":"Thilo Frotscher","firstname":"Thilo","lastname":"Frotscher","website":"http://www.frotscher.com","twitter":"https://twitter.com/thfro","bio":"Thilo Frotscher arbeitet seit nahezu zwanzig Jahren als freiberuflicher Softwarearchitekt und Trainer. Seine fachlichen Schwerpunkte bilden Java Enterprise-Anwendungen sowie der Themenbereich Systemintegration, APIs und Services. Er unterstützt Unternehmen überwiegend durch Projektmitarbeit oder die Durchführung von Schulungen und Reviews. Thilo ist (Co-) Autor mehrerer Bücher zu Java EE und (Web) Services, hat zahlreiche Fachartikel veröffentlicht und spricht regelmäßig auf internationalen Fachkonferenzen, auf Schulungsveranstaltungen oder bei Java User Groups.","photoId":"d48dbfffd78b53502af80b019702fc30","eventIds":["606711"]},{"id":"386596","name":"Christian Schmidt","firstname":"Christian","lastname":"Schmidt","company":"tarent solutions GmbH","twitter":"https://twitter.com/chrisIwanzik","xing":"https://www.xing.com/profile/Christian_Schmidt1605","bio":"Christian Schmidt, 34 Jahre aus Siegburg, ist nun seit 2010 bei der tarent Solutions GmbH in Bonn tätig. Hauptsächlich auf der JVM arbeitet er mit Java, Kotlin und Scala und entwickelt moderne Microservices.\r\nGerade die innere Architektur der Services liegt dabei mit Domain Driven Design, CQRS oder hexagonaler Architektur im Fokus.\r\nAußerhalb des Codes arbeitet er bereits seit einigen Jahren in modernen Microservicearchitekturen und kümmert sich um die Integration in CI/CD Systeme.","photoId":"8fb47c0bf3f3cecbf986731c610bf432","eventIds":["606380"]},{"id":"389379","name":"Sandra Ahlgrimm","firstname":"Sandra","lastname":"Ahlgrimm","company":" ","eventIds":["606571"]},{"id":"386134","name":"Timothee Bourguignon","firstname":"Timothee","lastname":"Bourguignon","company":"MATHEMA Software GmbH","website":"http://timbourguignon.fr","twitter":"https://twitter.com/timothep","bio":"Timothée Bourguignon ist als Chief Learning Officer, Head of Agile und Agile Coach bei der MATHEMA Software GmbH tätig. Seine Themenschwerpunkte umfassen Agilität, Lean, Scrum, Kanban, Mentoring, Teambuilding und noch einiges mehr. Daneben hält er regelmäßig Vorträge auf Fachkonferenzen und schreibt Artikel für Fachmagazine. In seiner Freizeit, wenn seine kleine Familie schläft, kümmert er sich mit seinem Developer's Journey (devjourney.info) Projekt um die Umwandlung seiner Kollegen in mythische Wesen.","photoId":"7a0049e503992ac32aafed247d9701d3","eventIds":["607359","607363"]},{"id":"389364","name":"Lukas Pradel","firstname":"Lukas","lastname":"Pradel","company":" ","twitter":"https://twitter.com/lukaspradel","xing":"https://www.xing.com/profile/Lukas_Pradel/","linkedin":"https://www.linkedin.com/in/lukaspradel","bio":"Lukas Pradel arbeitet als Senior Consultant bei der Conciso GmbH. Die Zeit, die er nicht mit Softwareentwicklung verbringt, nutzt er am liebsten zum Motorradfahren.","photoId":"f8be84f7a942f71948bf8beba59008f5","eventIds":["606603"]},{"id":"386376","name":"Neslihan Wittek","firstname":"Neslihan","lastname":"Wittek","company":"Ruhr University Bochum","bio":"PhD student at the biopsychology department of the Ruhr University Bochum. Focusing on pigeons? consciousness and self-recognition. While doing behavioural experiments, she also explores challenging analyzing methods and the field of data science. That is also one of the reasons why she is interested in open-source technology (especially Python) which helps her to not get lost in the thorny paths and thick forests of scientific computing that are ruled by gruesome beasts like MATLAB.","photoId":"934649472301dfa257984a40a11a5f13","eventIds":["606655"]},{"id":"386390","name":"Noopur Gupta","firstname":"Noopur","lastname":"Gupta","company":"IBM India Pvt. Ltd.","twitter":"https://twitter.com/noopur2507","linkedin":"https://www.linkedin.com/in/noopur2507","bio":"Noopur Gupta is an open-source enthusiast working as an advisory software engineer at IBM India Software Labs. She co-leads the Eclipse Java Development Tools project and has been a committer on the project for more than eight years. She is also a member of the Eclipse Architecture Council and the ACM Future of Computing Academy.","photoId":"5643523773ea09b554c6b02c9fd509e1","eventIds":["606715"]},{"id":"366617","name":"Jan Westerkamp","firstname":"Jan","lastname":"Westerkamp","eventIds":["607392","607353"]},{"id":"386312","name":"Paco van Beckhoven","firstname":"Paco","lastname":"van Beckhoven","company":"OpenValue","bio":"Paco is a passionate software engineer that likes to challenge the world and the software around him.\r\nHe works as a consultant for OpenValue where he helps customers build better software.\r\nA few years ago, he started speaking at conferences to entertain, and more importantly, educate visitors on various topics.\r\nAfter completing his master thesis on test effectiveness, he tries to get more people started with mutation testing.","photoId":"2e4062b44724d95da3119bf2e6420869","eventIds":["606440"]},{"id":"382191","name":"Jaap Coomans","firstname":"Jaap","lastname":"Coomans","company":"GROUP9","twitter":"https://twitter.com/JaapCoomans","linkedin":"https://www.linkedin.com/in/jaapcoomans/","bio":"Jaap is a Java and Kotlin developer with more than 10 years of experience in Java development in various industries. He's passionate about Java and Open Source technology and likes to combine architectural work with hands-on development. He loves sharing knowledge and experience with colleagues and like-minded people. Outside IT he loves playing board-games with friends and colleagues.","photoId":"0b9e172dcb6c04f7bf94fdb37c5565c2","eventIds":["606347"]},{"id":"382350","name":"Dirk Hermanns","firstname":"Dirk","lastname":"Hermanns","company":"LVM Versicherung","website":"https://www.lvm.de","twitter":"https://twitter.com/h3rmanns","xing":"https://www.xing.com/profile/Dirk_Hermanns2/cv","bio":"Dirk Hermanns ist Software-Architekt bei der LVM Versicherung und beschäftigt sich mit dem Design von Anwendungen und Systemen und wie sich Eventsourcing in der Praxis anwenden lässt.","photoId":"484f3d79c2ec01e6c8ab2ef5aacc1cc7","eventIds":["606756"]},{"id":"389894","name":"Fabian Meumertzheim","firstname":"Fabian","lastname":"Meumertzheim","company":"Code Intelligence GmbH","eventIds":["606567"]},{"id":"364422","name":"Hendrik Ebbers","firstname":"Hendrik","lastname":"Ebbers","company":"Karakun AG","website":"http://www.guigarage.com","twitter":"https://twitter.com/hendrikEbbers","facebook":"https://www.facebook.com/hendrik.ebbers","xing":"https://www.xing.com/profile/Hendrik_Ebbers","linkedin":"https://www.linkedin.com/in/hendrik-ebbers-92778558/","bio":"Hendrik ist Java Champion, JavaOne Rockstar und Mitglied im Technical Steering Committee bei AdoptOpenJDK sowie einer der Gründer der Karakun AG. In seiner Heimatstadt Dortmund leitet er zudem die Java User Group. Hendrik hält regelmäßig Vorträge über Themen wie Java und Softwareentwicklung auf Meetups und Konferenzen. Sein Buch „Mastering JavaFX 8 Controls“ wurde von Oracle Press 2014 veröffentlicht.","photoId":"7645014c0b096e286b3f083eb11b4fa0","eventIds":["606402","607319","607328"]},{"id":"386186","name":"Marwan Abu-Khalil","firstname":"Marwan","lastname":"Abu-Khalil","company":"Siemens AG","bio":"Marwan Abu-Khalil ist Software Architekt für parallele Systeme im Siemens Forschungsbereich. Er hält regelmäßig Konferenzvorträge und Seminare über Parallelisierung und ist Trainer für zertifizierte Softwarearchitekten der Siemens AG.","photoId":"81ae34bdc2975dd7eb271d58b61b5b28","eventIds":["606508"]},{"id":"385567","name":"Dr. Jens Bendisposto","firstname":"Jens","lastname":"Bendisposto","eventIds":["607410"]},{"id":"386373","name":"Brian Vermeer","firstname":"Brian","lastname":"Vermeer","company":"Snyk","website":"http://snyk.io","twitter":"@brianverm","bio":"Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is an Oracle Groundbreaker Ambassador, Utrecht JUG Co-lead, Virtual JUG organizer and Co-lead at TheSecureDeveloper. He is a regular international speaker on mostly Java-related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more. Besides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher.","photoId":"689b05f59349e404d9c6cc87aaf4ba7a","eventIds":["606355"]},{"id":"382440","name":"Rudy De Busscher","firstname":"Rudy","lastname":"De Busscher","company":" ","website":"https://payara.fish","twitter":"@rdebusscher","linkedin":"https://www.linkedin.com/in/rudy-de-busscher-71480036/","bio":"Rudy loves to create (web) applications with the Java EE platform and MicroProfile implementations and is currently working for Payara Services Limited in the Service Team. He helps customers, writes technical content, is part of some MicroProfile implementations and advocates the Payara Products in various ways.\r\n\r\nHe is active in the IT industry for more than 20 years and created many applications for customers. He is also a big fan of OpenSource and helped in various OpenSource projects like DeltaSpike, PrimeFaces, and Apache Myfaces. He is also passionate about Web Application Security using OAuth2, OpenId Connect, and JWT. He maintains the Octopus OpenSource project and is a member of the Jakarta EE Security API team.","photoId":"6105c9055b55d59135029068dfb94b7d","eventIds":["606583"]},{"id":"367632","name":"Gerrit Meier","firstname":"Gerrit","lastname":"Meier","website":"http://","twitter":"https://twitter.com/meistermeier","facebook":"http://","xing":"https://www.xing.com/profile/Gerrit_Meier","linkedin":"https://www.linkedin.com/in/gerrit-meier/","bio":"Gerrit Meier ist leidenschaftlicher Softwareentwickler und arbeitet als Software Entwickler bei Neo4j. Neue Technologien, Ideen und Ansätze, auch abseits seines technologischen Schwerpunktes, motivieren ihn immer wieder zum Ausprobieren und Verstehen. Da er dieses als eine der wichtigsten Kompetenzen in der Softwareentwicklungswelt sieht, bemüht er sich sowohl beruflich als auch privat, dieses Wissen und den Spaß am Einfach-mal-machen zu vermitteln und zugänglich zu machen. Dies ist auch einer der Gründe, aus denen Gerrit aktiv die JUG Ostfalen unterstützt.","photoId":"8e5d5127e15b107eda0d75a0a9e551d3","eventIds":["606635"]},{"id":"386308","name":"Elisabeth Schulz","firstname":"Elisabeth","lastname":"Schulz","company":"codecentric AG","bio":"Elisabeth Schulz hat ihre lebenslange Leidenschaft für Computer kurzerhand zum Beruf gemacht und arbeitet bei der codecentric AG in Kundenprojekten. Neben Java treiben sie funktionale Programmiersprachen, maschinennahe Sprachen und Computersicherheit um. Sie fühlt sich unter der Oberfläche am wohlsten, wo sie ihre Zeit damit verbringen kann, sicherzustellen, dass alles „einfach funktioniert“.","photoId":"b5149148019fb2cae3f6942370c78206","eventIds":["606748"]},{"id":"136700","name":"Fried Saacke","firstname":"Fried","lastname":"Saacke","website":"http://www.doag.org","xing":"https://www.xing.com/profile/Fried_Saacke","linkedin":"http://de.linkedin.com/in/FriedSaacke","bio":"Fried Saacke ist CEO der DOAG und Geschäftsführer der DOAG Dienstleistungen GmbH sowie Vorsitzender des iJUG e.V.\r\n1997 hat Fried Saacke die DOAG als Besucher der 10. Deutschen ORACLE-Anwenderkonferenz kennengelernt und ein Jahr später die Regionalgruppe Berlin/Brandenburg gegründet und aufgebaut. Bereits 1999 wurde er  in den Vorstand der DOAG gewählt und führte von da an bis zum Juni 2008 den Verein als Vorsitzender des Vorstands. \r\nSeitdem widmet sich Saacke in Vollzeit der DOAG und verantwortet als Geschäftsführer die gesamten operativen Geschäfte des Vereins. Gleichzeitig ist er weiterhin Mitglied des Vorstand der DOAG und übernimmt repräsentative und strategische Aufgaben für den Verein. \r\n\"Mein Ziel ist es, die DOAG bei Oracle und im Markt bekannt zu machen sowie die Anwender zur DOAG zu bringen, von der Mitgliedschaft zu überzeugen und zur aktiven Mitarbeit zu motivieren.\" betont Fried Saacke. \"Für die Zukunft wünsche ich mir für die DOAG, dass es uns gelingt, unsere anspruchsvollen Ziele umzusetzen. Ich stehe für einen wirtschaftlich und rechtlich unabhängigen Verein sowie für einen konstruktiv-kritischen Dialog mit Oracle. \"\r\nAm 1.12.2009 wurde Fried Saacke auf der Gründungsversammlung des Interessenverbund der Java User Groups e.V. (iJUG) zu dessen Vorsitzenden gewählt und nimmt dieses Ehrenamt seitdem wahr. \"In dieser Funktion ist es mein Ziel die gemeinsamen Interessen der Java User Groups im deutschsprachigen Raum zu vertreten.\" Im iJUG e.V. sind zwischenzeitlich über 30 Java User Gruppen zusammengeschlossen. Der Verein vertritt über 20.000 Java Entwickler.\r\nIn seiner Freizeit ist Fried Saacke als Notfallsanitäter des Bayerischen Roten Kreuzes in der Bergwacht und im Sanitätsdienst aktiv. \r\n","photoId":"d76ac840f903bcf8ea5353c66d0944e9","eventIds":["606886"]},{"id":"386360","name":"Stefan López Romero","firstname":"Stefan","lastname":"López Romero","company":"MaibornWolff","eventIds":["606319"]},{"id":"378795","name":"Tim Schade","firstname":"Tim","lastname":"Schade","company":"GFT Technologies SE","eventIds":["606496"]},{"id":"386339","name":"Thodoris Bais","firstname":"Thodoris","lastname":"Bais","company":"Utrecht Java User Group","website":"https://github.com/thodorisbais","twitter":"https://twitter.com/thodorisbais","eventIds":["606728"]},{"id":"371826","name":"Sandra Parsick","firstname":"Sandra","lastname":"Parsick","bio":"Sandra Parsick ist freiberufliche Softwareentwicklerin und Java Champion. Seit 2008 beschäftigt sie sich mit agiler Softwareentwicklung in verschiedenen Rollen. Ihre Schwerpunkte liegen im Bereich der Java Enterprise Anwendungen, agilen Methoden, Software Craftsmanship und in der Automatisierung von Softwareentwicklungsprozessen. Darüber schreibt sie gerne Artikel und  spricht gerne auf Konferenzen.\r\nIn ihrer Freizeit engagiert sich Sandra Parsick in der Softwerkskammer Ruhrgebiet, einer Regionalgruppe der Software Craftmanship Community im deutschsprachigen Raum.","photoId":"575dfc17802d78f92b8072ceff27fd95","eventIds":["607319","607328"]},{"id":"359390","name":"Niko Köbler","firstname":"Niko","lastname":"Köbler","company":"Niko Köbler IT-Beratung","website":"https://www.n-k.de","twitter":"https://twitter.com/dasniko","bio":"Niko macht irgendwas mit Computern, oft im Web und Serverless in der Cloud, meistens auf der JVM.\r\nEr ist Co-Lead der JUG Darmstadt, Autor und Sprecher auf internationalen Konferenzen.\r\nEr hat das Buch \"Serverless Computing in der AWS Cloud\" geschrieben.","photoId":"a1a57e01c5c66f2c154c0642274293d1","eventIds":["606707"]},{"id":"382455","name":"Anika Zohren","firstname":"Anika","lastname":"Zohren","company":"Osudio Deutschland GmbH","bio":"Anika Zohren - Software Entwicklerin seit 2002 - Schwerpunkte sind Java, SAP Commerce (aka hybris) und statische Quelltext Analyse","photoId":"e0c415b3aff03b4f8b4cb185d4f9cb78","eventIds":["606376"]},{"id":"378752","name":"Christian Schneider","firstname":"Christian","lastname":"Schneider","company":" ","website":"https://christian-schneider.net","twitter":"https://twitter.com/cschneider4711","xing":"https://www.xing.com/profile/Christian_Schneider248","linkedin":"https://de.linkedin.com/in/cschneider4711","bio":"Christian Schneider (@cschneider4711) ist als freiberuflicher Softwareentwickler, Whitehat Hacker und Trainer tätig. Er unterstützt Kunden im Bereich der Web Security durch Penetrationstests und \"Security Architecture Consulting\" sowie Teams bei der Einführung von \"Security DevOps\". In dieser Rolle ist er regelmäßig als Trainer tätig, spricht auf Konferenzen und bloggt auf www.Christian-Schneider.net","photoId":"93fb1a54e4208b83c0a04b13aa71f372","eventIds":["606563"]},{"id":"364863","name":"Sebastian Daschner","firstname":"Sebastian","lastname":"Daschner","company":"IBM Deutschland GmbH","website":"https://www.sebastian-daschner.com","twitter":"https://twitter.com/DaschnerS","bio":"Sebastian Daschner ist selbstständiger Java Consultant und Trainer und programmiert begeistert mit Java (EE). Seine Kunden unterstützt er mit Workshops und Beratung in Enterprise-Themen. Er ist Autor des Buches ?Architecting Modern Java EE Applications?. Sebastian nimmt am Java Community Process teil, ist in den JAX-RS, JSON-P und Config Expert Groups vertreten und entwickelt an diversen Open Source Projekten. Für seinen Beitrag in der Java Community und Java-Ökosystem wurde er mit den Titeln Java Champion, Oracle Developer Champion und JavaOne 2016 Rockstar ausgezeichnet. Sebastian spricht auf internationalen IT-Konferenzen, wie JavaLand, JavaOne oder Jfokus. Neben Java und Java EE benutzt Sebastian intensiv Linux und Container-Technologien wie Docker und Kubernetes. Er evangelisiert Java- und Programmierthemen unter https://blog.sebastian-daschner.com und auf Twitter unter @DaschnerS. Wenn er nicht gerade mit Java arbeitet, bereist er auch gerne die Welt???entweder per Flugzeug oder Motorrad.","photoId":"de7c8147613723a6d8a79fc85fad0ee7","eventIds":["607197"]},{"id":"371819","name":"Johannes Dienst","firstname":"Johannes","lastname":"Dienst","company":"DB Systel","website":"https://johannesdienst.net","twitter":"https://twitter.com/JohannesDienst","bio":"Johannes Dienst ist Softwarecraftsman aus Leidenschaft bei der DB Systel GmbH. Sein Tätigkeitsschwerpunkt liegt im Bereich Content Management, DevOps und Softwarequalität.","photoId":"c4de3812b015ddb52523456e7b9fda28","eventIds":["606468"]},{"id":"386099","name":"Peter Palaga","firstname":"Peter","lastname":"Palaga","company":"Red Hat","website":"http://ppalaga.github.io/","twitter":"https://twitter.com/ppalaga","bio":"Senior Software Engineeer for Red Hat Fuse, working mostly on porting Apache Camel components to Quarkus","photoId":"7171b0d2ad7e8ec5416382deacc6e07b","eventIds":["606579","606575"]},{"id":"374853","name":"Kevin Wittek","firstname":"Kevin","lastname":"Wittek","company":"if(is)","website":"https://groovy-coder.com/","twitter":"https://twitter.com/Kiview","facebook":"http://","xing":"http://","linkedin":"http://","bio":"Testcontainers co-maintainer and Testcontainers-Spock author, in love with FLOSS. Received the Oracle Groundbreaker Ambassador award for his contributions to the Open Source community. Software Craftsman and testing fan. Plays the electric guitar and is a musician in his second life. Found his own company during his university years, developing mobile apps and client-server applications, which introduced him to Grails and the Groovy ecosystem. Fell in love with TDD because of Spock. \r\n\r\nAfter many years working in the industry as a software engineer, Kevin is now doing his PhD at the Institute for Internet Security and is leading a research team in the field of blockchain technology.\r\n","photoId":"8f400deee7b74d9cabe8b2d2f0ae332d","eventIds":["606651"]},{"id":"378544","name":"Joep Weijers","firstname":"Joep","lastname":"Weijers","company":"TOPdesk","website":"https://joepweijers.nl","twitter":"https://twitter.com/joepweijers","bio":"Joep is a Build Master at TOPdesk with a keen interest in delivering quality software continuously. He loves playing around with Jenkins Pipelines, Selenium, Docker and keeps in touch with his inner developer by educating his colleagues on testable Java code.","photoId":"01cbf252fe9777302257005fe65bc32e","eventIds":["606691"]},{"id":"389351","name":"Ranjan Mohan","firstname":"Ranjan","lastname":"Mohan","company":" ","eventIds":["606504"]},{"id":"386408","name":"Bernd Ruecker","firstname":"Bernd","lastname":"Ruecker","company":" ","eventIds":["606424"]},{"id":"389368","name":"Johannes Unterstein","firstname":"Johannes","lastname":"Unterstein","company":" ","eventIds":["606544"]},{"id":"374893","name":"Mario-Leander Reimer","firstname":"Mario-Leander","lastname":"Reimer","company":"QAware GmbH","website":"http://www.qaware.de/unternehmen/mario-leander-reimer/","twitter":"https://twitter.com/leanderreimer","linkedin":"https://www.linkedin.com/in/mario-leander-reimer-b2b67aa0/","bio":"M.-Leander Reimer passionierter Entwickler, Architekt und #CloudNativeNerd, er arbeitet als Cheftechnologe bei der QAware GmbH. Er beschäftigt sich intensiv mit Technologien rund um den Cloud Native Stack und deren Einsatzmöglichkeiten im Unternehmensumfeld. Er unterrichtet Cloud Computing und Software-Qualitätssicherung an der TH Rosenheim.","photoId":"e6a14270f2b37daa24e0622c4ffcbc82","eventIds":["606683"]},{"id":"389387","name":"Karsten Silz","firstname":"Karsten","lastname":"Silz","website":"https://betterprojectsfaster.com/","twitter":"https://twitter.com/karsilz","xing":"https://www.xing.com/profile/Karsten_Silz","linkedin":"https://www.linkedin.com/in/ksilz/","bio":"Karsten Silz arbeitet seit 22 Jahren als Java-Entwickler. Er war schon in 5 europäischen Ländern und den USA tätig. 2004 war er Mitgründer eines Software-Start-Ups in den USA. Das Produkt erreichte 80% Marktanteil in der nordamerikanischen Kabel-TV-Industrie. Bei Stromausfällen schütze es Fernsehen, Internet und Telefon in 50 Millionen Haushalten. Karsten leitete 13 Jahre die Produkt-Entwicklung und verließ die Firma, nachdem sie erfolgreich verkauft wurde.\r\n\r\nSeit 2017 arbeitet er als freiberuflicher Full-Stack Java-Entwickler für Web (Angular) und Mobile (Flutter) in Deutschland und Großbritannien. 2020 hat er das Software as a service (SaaS) Start-up \"Your Home in Good Hands\" (https://yourhomeingoodhands.co.uk) als CTO in Großbritannien mitbegründet.\r\n\r\nKarsten hat einen Newsletter (https://bpfnl.substack.com), eine Webseite für Entwickler (https://bpf.li) und eine Freiberufler-Website (https://ksilz.com). \r\n","photoId":"adf117beef0fb4201605319842a2a3e9","eventIds":["606695"]},{"id":"386412","name":"Kai Gellien","firstname":"Kai","lastname":"Gellien","company":"GFT Technologies","xing":"https://www.xing.com/profile/Kai_Gellien","linkedin":"https://www.linkedin.com/in/kai-gellien-b99046149/","bio":"Kai Gellien ist Senior IT-Consultant bei der GFT Deutschland. Seine Schwerpunkte sind agile Methoden, objektorientierte und funktionale Softwareentwicklung sowie Projektinfrastruktur.","eventIds":["606631"]},{"id":"359611","name":"Daniel Van Ross","firstname":"Daniel","lastname":"Van Ross","eventIds":["607453","607386","607368"]},{"id":"382491","name":"Georg Berky","firstname":"Georg","lastname":"Berky","company":"Valtech Mobility GmbH","twitter":"https://twitter.com/georgberky","bio":"Ich bin leidenschaftlicher Programmier und hauptsächlich in JVM-Sprachen, z.B. Java, Groovy oder Clojure unterwegs.\r\n\r\nProgrammieren ist mein Handwerk, aber dazu gehören auch Themen wie die Automatisierung von Builds oder Deployments und Scripting in der Shell und Agilität im Team. \r\n\r\nSeit einigen Jahren bin ich Co-Organisator der Software Craftsmanship Communities im Ruhrgebiet und in Düsseldorf. \r\n\r\nWenn ich nicht programmiere praktiziere ich Aikido oder spiele Trompete.","photoId":"a30b0c0e338075f45a01378b8d7d21fa","eventIds":["606398"]},{"id":"389361","name":"Lisa Maria Moritz","firstname":"Lisa Maria","lastname":"Moritz","company":"innoQ Deutschland GmbH","eventIds":["606540"]},{"id":"371317","name":"Wolfgang Schell","firstname":"Wolfgang","lastname":"Schell","company":"metaphacts GmbH","eventIds":["606351"]},{"id":"374933","name":"Ondrej Mihályi","firstname":"Ondrej","lastname":"Mihályi","company":"Payara Services","eventIds":["606599"]},{"id":"365280","name":"Thomas Endres","firstname":"Thomas","lastname":"Endres","company":"TNG Technology Consulting GmbH","website":"https://www.tngtech.com/","twitter":"https://twitter.com/originalOne1984","facebook":"https://www.facebook.com/thomas.endres.524","xing":"https://www.xing.com/profile/Thomas_Endres5","linkedin":"https://www.linkedin.com/in/thomasendres","bio":"Thomas Endres arbeitet als IT-Consultant für TNG Technology Consulting in München. Neben seiner \"normalen\" Tätigkeit für den Kunden entwickelt er zusammen mit dem TNG-Hardware-Hacking-Team veschiedene Prototypen - darunter ein Augmented Reality Device, durch das man die Welt durch die Augen eines  Terminators sehen kann, oder aber ein Telepräsenz-Robotik-System. In seiner Freizeit arbeitet er an gestensgesteuerten Anwendungen, um damit beispielsweise Quadrocopter fernzusteuern. Darüber hinaus ist er in verschiedenen Open-Source-Projekten in Java, C# und allen Spielarten von JavaScript involviert. Nebenberuflich betätigt er sich als Dozent an der Universität für Angewandte Wissenschaften in Landshut.\r\nThomas ist studierter Informatiker (TU München) und leidenschaftlicher Softwareentwickler. Als Intel Software Innovator und Black Belt präsentiert er weltweit neue Technologien wie Gestensteuerung, AR/VR und Robotik. Vor kurzem erhielt er dafür einen JavaOne Rockstar-Award.","photoId":"5786056e926df294cc1e40336d3bf131","eventIds":["606384"]},{"id":"368551","name":"Thomas Much","firstname":"Thomas","lastname":"Much","company":"muchsoft.com","website":"http://www.muchsoft.com","twitter":"https://twitter.com/thmuch","xing":"https://www.xing.com/profile/Thomas_Much","linkedin":"https://www.linkedin.com/in/thomasmuch","bio":"Als Agile Developer Coach und Softwareentwickler (Java et al.) unterstützt Thomas Much zahlreiche Teams bei der Bewältigung der alltäglichen Projekt-Herausforderungen, sowohl methodisch als auch technisch - und oft auch an der Reibefläche dazwischen. Er lebt mit seiner Familie in Hamburg und lässt sich gerne vom nordischen Wind den Kopf für neue Ideen freipusten.","photoId":"115ac4ae671037b2768a3684ab5eea63","eventIds":["607472","607434"]},{"id":"384320","name":"Christian Meter","firstname":"Christian","lastname":"Meter","website":"https://schnaq.com","twitter":"https://twitter.com/cmeter_","facebook":"https://www.facebook.com/cmeter/","xing":"https://www.xing.com/profile/Christian_Meter/cv","linkedin":"https://www.linkedin.com/in/christian-meter-2960a948/","bio":"Christian ist Co-Founder von schnaq und befasst sich damit Wissensstrukturierung mithilfe von Diskussionen zu ermöglichen. Promoviert hat er in der Informatik an der Heinrich-Heine-Universität in Düsseldorf zum Thema Online Diskussionen. In Forschung und aus Passion befasst er sich mit vielen Themen der Softwareentwicklung, startet eine Menge eigener Projekte und ist stets an Verbesserungen von Softwareentwicklungsprozessen interessiert. Er organisiert das Clojure Meetup Düsseldorf, Lambda Düsseldorf und ist Co-Organisator der rheinjug.","photoId":"a5343da863d2e9b47178ae8f64b8fb23","eventIds":["606789","607410"]},{"id":"363284","name":"Falk Sippach","firstname":"Falk","lastname":"Sippach","company":"embarc Software Consulting GmbH","website":"https://www.sippsack.de/","twitter":"https://twitter.com/sippsack","xing":"https://www.xing.com/profile/Falk_Sippach","bio":"Falk Sippach ist bei der embarc Software Consulting GmbH als Softwarearchitekt, Berater und Trainer stets auf der Suche nach dem Funken Leidenschaft, den er bei seinen Teilnehmern, Kunden und Kollegen entfachen kann. Bereits seit über 15 Jahren unterstützt er in meist agilen Softwareentwicklungsprojekten im Java-Umfeld. Als aktiver Bestandteil der Community (Mitorganisator der JUG Darmstadt) teilt er zudem sein Wissen gern in Artikeln, Blog-Beiträgen, sowie bei Vorträgen auf Konferenzen oder User Group Treffen und unterstützt bei der Organisation diverser Fachveranstaltungen. Falk twittert unter @sippsack. ","photoId":"474bb57e93e8353b0cbeafbeca09afe3","eventIds":["607447"]},{"id":"377915","name":"Lisa Rosenberg","firstname":"Lisa","lastname":"Rosenberg","company":"msg DAVID GmbH","twitter":"https://twitter.com/rosenbeli","xing":"https://www.xing.com/profile/Lisa_Rosenberg3/cv","linkedin":"https://www.linkedin.com/in/lisa-rosenberg-206a93142/","bio":"Ich arbeite seit 2017 als Entwicklerin bei der in Braunschweig ansässigen msg DAVID GmbH und studiere parallel Informatik (M.Sc.) an der TU Braunschweig. In meiner freien Zeit bin ich als Speakerin aktiv und engagiere mich als Mentorin bei unterschiedlichen IT-Workshops für Kinder und Jugendliche.","photoId":"fc7be905a8c94923213d9a41ff8af396","eventIds":["607440"]},{"id":"371796","name":"Stephan Classen","firstname":"Stephan","lastname":"Classen","company":"Karakun AG","bio":"Stephan Classen ist ein TDD Enthusiast, Open Source verrückt und liebt es die Code Qualität hoch zu halten. Er arbeitet als Senior Software Engineer bei der Karakun AG in Basel, ist Kontributor bei OpenWebStart und regelmässiger Teilnehmer bei SoCraTes Konferenzen. In seiner Freizeit erkundet er mit seinen zwei Kindern die reale Welt.\r\n","photoId":"06d370ef732668592b96814e9a87c991","eventIds":["606402"]},{"id":"389659","name":"Silvia Siu Luo","firstname":"Silvia Siu","lastname":"Luo","eventIds":["606504"]},{"id":"386821","name":"Jonas Mayer","firstname":"Jonas","lastname":"Mayer","company":"TNG Technology Consulting GmbH","eventIds":["606384"]}]}